відкрити Бібліотека

// Turtle Dodger 0.5b
// Copyright (c) 2014 Nonki Takahashi.
//
// License:
// The MIT License (MIT)
// http://opensource.org/licenses/mit-license.php
//
// History:
// 0.5b 2014-04-17 Changed to detect collision. (QZN342-3)
// 0.4a 2014-04-17 Added opening. (QZN342-2)
// 0.3a 2014-04-02 Avoided to hold while Turtle moving. (QZN342-1)
// 0.2a 2014-04-02 Changed for Silverlight. (QZN342-0)
// 0.1a 2014-04-02 Created. (QZN342)

нехай заголовок = "Черепаха Ухиляка 0.5b"
ГрафичнеВікно.Заголовок <- заголовок
// Debug variables
нехай відлагоджування = ложь
нехай змінливий хрест1 = "<shape name>"
нехай змінливий хрест2 = "<shape name>"
нехай змінливий поз = "<shape name>"
// Global variables
нехай гш = 598
нехай гв = 428
нехай змінливий крутиться = ложь
нехай змінливий рухається = ложь
нехай змінливий виявленоЗіткнення = ложь
нехай змінливий минуло = 0
нехай змінливий останняКнопка = ""
нехай змінливий останнійпмс = 0
нехай колір = слов [1,Кольори.Orange; 2, Кольори.Cyan; 3, Кольори.Lime]
нехай розмір = слов [1,20; 2,16; 3,12]
нехай змінливий рахунок = "<shape name>"
нехай змінливий iMin = 0
нехай змінливий iMax = 0
/// Falling object
тип Об'єкт = { змінливий X:цел; змінливий Y:цел; Род:цел; НазваФігури:строка }
/// Falling objects
нехай об'єкти = ResizeArray<Об'єкт>()

нехай рек Закриття () =
   Таймер.Пауза()
   Черепаха.Повернути(720)
   ГрафичнеВікно.КолірПензлика <- Кольори.White
   ГрафичнеВікно.ІмяШрифта <- "Trebuchet MS"
   ГрафичнеВікно.РозмірШрифта <- 40.0
   нехай x = (гш - 217) / 2
   нехай y = 100
   ГрафичнеВікно.НамалюватиТекст(x, y, "ГРА ЗАКІНЧИЛАСЬ")
   Програма.Затримка(3000)
та Відкриття () =
   нехай url = "" // "http://www.nonkit.com/smallbasic.files/"
   нехай большаяЧерепаха = Фігури.ДодатиЗображення(url + "turtle.png")
   Фігури.Перемістити(большаяЧерепаха, 180, 140)
   ГрафичнеВікно.КолірПензлика <- Кольори.White
   ГрафичнеВікно.ІмяШрифта <- "Trebuchet MS"
   ГрафичнеВікно.РозмірШрифта <- 50.0
   нехай x = (гш - 443) / 2
   нехай y = 40
   ГрафичнеВікно.НамалюватиТекст(x, y, заголовок)
   Програма.Затримка(3000)
   ГрафичнеВікно.Очистити()
та Готово () =
   ГрафичнеВікно.РозмірШрифта <- 40.0
   нехай готово = Фігури.ДодатиТекст("Готовы?")
   нехай x = (гш - 130) / 2
   нехай y = 100
   Фігури.Перемістити(готово, x, y)
   для opacity у 100 .. -10 .. 0 зробити
     Фігури.ВстановитиНепрозорість(готово, opacity)
     Програма.Затримка(200)
   Фігури.Видалити(готово)
та Гра () =
   Черепаха.Швидкість <- 7
   Черепаха.ПіднятиПеро()
   нехай x = гш / 2
   нехай y = гв - 40
   ГрафичнеВікно.КолірПензлика <- Кольори.White
   ГрафичнеВікно.РозмірШрифта <- 18.0
   рахунок <- Фігури.ДодатиТекст("0")
   Фігури.Перемістити(рахунок, 20, 20)
   якщо відлагоджування тоді
     ГрафичнеВікно.КолірПензлика <- Кольори.White
     ГрафичнеВікно.РозмірШрифта <- 12.0
     поз <- Фігури.ДодатиТекст("(" + x.ToString() + "," + y.ToString() + ")")
     ГрафичнеВікно.ШиринаПера <- 1.0
     хрест1 <- Фігури.ДодатиЛінію(0, -8, 0, 8)
     хрест2 <- Фігури.ДодатиЛінію(-8, 0, 8, 0)
     Фігури.Перемістити(хрест1, x, y)
     Фігури.Перемістити(хрест2, x, y)
     Фігури.Перемістити(поз, гш - 100, 20)   
   Черепаха.ПереміститиВ(x, y)
   Черепаха.Кут <- 0.0   
   рухається <- ложь
   крутиться <- ложь
   Готово()
   ГрафичнеВікно.КлавішаНатиснута <- Callback(НаКнопкаНатиснута)
   нехай тик = ложь
   Таймер.Интервал <- 1000 / 24
   Таймер.Тик <- Callback(НаТик)
   останнійпмс <- Годинник.МинуліМілісекунди
   iMin <- 0
   доки не виявленоЗіткнення зробити
     якщо рухається тоді
       якщо останняКнопка = "Left" тоді
         Черепаха.ПовернутиНалево()
         Черепаха.Перемістити(30)
         Черепаха.ПовернутиНаправо()
       інякщо останняКнопка = "Right" тоді
         Черепаха.ПовернутиНаправо()
         Черепаха.Перемістити(30)
         Черепаха.ПовернутиНалево()      
       рухається <- ложь
     інакше
       Програма.Затримка(100)      
та Ініціалізація () =
   ГрафичнеВікно.КолірФона <- Кольори.DodgerBlue
   ГрафичнеВікно.Ширина <- гш
   ГрафичнеВікно.Висота <- гв   
   минуло <- 0
   виявленоЗіткнення <- ложь
та НаТик () =
   якщо не крутиться тоді
     крутиться <- істина
     нехай пмс = Годинник.МинуліМілісекунди
     якщо пмс - останнійпмс > 500 тоді
       ДодатиОб'єкт()
       останнійпмс <- пмс    
     КрутитиОб'єкт()
     крутиться <- ложь
   якщо відлагоджування тоді
     нехай x = Математика.Floor(Черепаха.X)
     нехай y = Математика.Floor(Черепаха.Y)
     Фігури.УстановитьТекст(поз, "(" + x.ToString() + "," + y.ToString() + ")")
     Фігури.Перемістити(хрест1, x, y)
     Фігури.Перемістити(хрест2, x, y)
та КрутитиОб'єкт () =
   для i = iMin до iMax-1 зробити
     нехай x = об'єкти.[i].X
     нехай y = об'єкти.[i].Y + 5
     нехай tx = Математика.Floor(Черепаха.X) |> int
     нехай ty = Математика.Floor(Черепаха.Y) |> int
     нехай д = Математика.КвадратнийКорінь(float (Математика.Ступінь(tx - x, 2) + Математика.Ступінь(ty - y, 2))) |> int
     якщо д < (розмір.[об'єкти.[i].Род] + 16) / 2 тоді
       виявленоЗіткнення <- істина   
     якщо y > гв тоді
       минуло <- минуло + 1
       Фігури.УстановитьТекст(рахунок, string минуло)
       Фігури.Видалити(об'єкти.[i].НазваФігури)
       iMin <- i + 1
     інакше
       Фігури.Перемістити(об'єкти.[i].НазваФігури, x, y)
       об'єкти.[i].X <- x
       об'єкти.[i].Y <- y   
та ДодатиОб'єкт () =   
   iMax <- iMax + 1
   ГрафичнеВікно.ШиринаПера <- 1.0
   нехай род = Математика.ОтриматиВипадковеЧисло(3)
   ГрафичнеВікно.КолірПензлика <- колір.[род]
   нехай рз = розмір.[род]
   нехай назваФігури = Фігури.ДодатиПрямокутник(рз, рз)
   нехай x = Математика.ОтриматиВипадковеЧисло(гш - 20) + 10
   нехай y = -20
   об'єкти.Add({ X = x; Y=y; Род=род; НазваФігури=назваФігури})
   Фігури.Перемістити(назваФігури, x, y)
   Фігури.Повернути(назваФігури, Математика.ОтриматиВипадковеЧисло(360))
та НаКнопкаНатиснута () =
   якщо не рухається тоді
     рухається <- істина
     останняКнопка <- ГрафичнеВікно.ОстанняКнопка   

Ініціалізація()
Відкриття()
Гра()
Закриття()