#if INTERACTIVE
#r "./bin/debug/Xwt.dll"
#r "./bin/debug/FunSharp.dll"
#endif

open Бібліотека

// Asteroids Game
// Copyright (C) 2009, Jason T. Jacques 
// License: MIT license http://www.opensource.org/licenses/mit-license.php

// Game area controls
let ширинаГри  = 640.0
let высотаГри = 480.0
let колірФону = Кольори.Black

// Window title
let заголовокГри = "Астероїди, Рахунок: "

// Target frames per second
let fps = 25

// Управление кнопками
let кнопкаЛево  = "Left"
let кнопкаПраво = "Right"
let КнопкаВперед = "Up"
let кнопкаНазад = "Down"
let кнопкаВогонь = "Space"
let кнопкаПауза = "P"

// Asteroid (rock) settings
let швидкістьАстероїдів = 1.0
let колірАстероїдів = Кольори.White
let минАстероїд = 20 // small size rock
let типАстероїдів = 3 // number of rock sizes (multiples of small rock size)
let mutable іницАстероїди = 5

// Ammo settings
let швидкістьКулі = 5.0
let колірКулі = Кольори.White
let життяКулі = 60 // moves before auto destruct
let максКуль = 10
let розмірКулі = 5.0

// Player settings
let колірІгрока = Кольори.White
let висотаІгрока = 30.0
let ширинаІгрока = 20.0
let mutable ігрок = ""
let mutable кутІгрока = 0.0
let mutable швидкітьІгрока = 0.0
let безпечнийЧас = 100 // time player has to get out of the way on level up

// Point multiplier
let множникБалів = 10

// Array name initialisation
let астероїд = ResizeArray()
let кутАстероїда = ResizeArray()
let размірАстероїда = ResizeArray()
let куля = ResizeArray()
let кутКулі = ResizeArray<float>()
let вікПулі = ResizeArray()

let mutable кількістьАстероїдів = 0
let mutable кількістьКуль = 0

let шлях = "" // "http://smallbasic.com/drop/"
let великийАстероїд = СписокЗображень.ЗавантажитиЗображення(шлях + "Asteroids_BigRock.png")
let середнійАстероїд = СписокЗображень.ЗавантажитиЗображення(шлях + "Asteroids_MediumRock.png")
let малАстероїд = СписокЗображень.ЗавантажитиЗображення(шлях + "Asteroids_SmallRock.png")
let фон = СписокЗображень.ЗавантажитиЗображення(шлях + "Asteroids_Sky.png")

let mutable пауза = 0
let mutable гра = 0
let mutable безпекаІгрока = 0
let mutable рахунок = 0

let mutable наступнийРозмір = 0
let mutable наступнаПозиція = ""
let mutable px1 = 0.0
let mutable py1 = 0.0
let mutable px2 = 0.0
let mutable py2 = 0.0

// Налаштувати світ
let rec Ініціалізація () =
   ГрафичнеВікно.Сховати()
   ГрафичнеВікно.Заголовок <- заголовокГри + "0"
   //GraphicsWindow.CanResize <- "False"
   ГрафичнеВікно.Ширина <- int ширинаГри
   ГрафичнеВікно.Висота <-int высотаГри

   ГрафичнеВікно.КолірФона <- колірФону
   ГрафичнеВікно.КолірПензлика <- колірФону
   ГрафичнеВікно.НамалюватиЗображення(фон, 0, 0)

   ПеревіркаРівня()

   ГрафичнеВікно.КолірПера <- колірІгрока
   ігрок <- Фігури.ДодатиЗображення(шлях + "Asteroids_Ship.png")
   // player = Фігури.AddTriangle(playerWidth/2, 0, 0, playerHeight, playerWidth, playerHeight)
   Фігури.Перемістити(ігрок, (ширинаГри - ширинаІгрока) / 2.0, (float высотаГри - висотаІгрока) / 2.0)
   кутІгрока <- 0.0

// Головна ігрова процедура
and Гра () =
   ГрафичнеВікно.Показати()
   ГрафичнеВікно.КлавішаНатиснута <- Callback(ЗмінитиНапрямок)

   // Main loop
   гра <- 1
   пауза <- 0
   while (гра = 1) do
     Програма.Затримка(1000/fps)
     if (пауза = 0) then
       Рух()
       ПеревіркаЗіткнень()
       СтарінняКуль()
       ПеревіркаРівня()

// Read key event and act
and ЗмінитиНапрямок () =   
   if (ГрафичнеВікно.ОстанняКнопка = кнопкаПраво) then
     кутІгрока <- (кутІгрока + 10.0) % 360.0
   elif (ГрафичнеВікно.ОстанняКнопка = кнопкаЛево) then
     кутІгрока <- (кутІгрока - 10.0) % 360.0
   elif (ГрафичнеВікно.ОстанняКнопка = КнопкаВперед) then
     швидкітьІгрока <- швидкітьІгрока + 1.0
   elif (ГрафичнеВікно.ОстанняКнопка = кнопкаНазад) then
     швидкітьІгрока <- швидкітьІгрока - 1.0
   elif (ГрафичнеВікно.ОстанняКнопка = кнопкаВогонь) then
     Постріл()
   elif (ГрафичнеВікно.ОстанняКнопка = кнопкаПауза) then
     пауза <- Математика.Залишок(пауза + 1, 2)  
   Фігури.Повернути(ігрок, кутІгрока)

// Move all on screen items
and Рух () =
   // Move player
   let x = Математика.Залишок(Фігури.ОтриматиЛіво(ігрок) + (Математика.Кос(Математика.ОтриматиРадіани(кутІгрока - 90.0)) * швидкітьІгрока) + ширинаГри, ширинаГри)
   let y = Математика.Залишок(Фігури.ОтриматиВерх(ігрок) + (Математика.Син(Математика.ОтриматиРадіани(кутІгрока - 90.0)) * швидкітьІгрока) + высотаГри, высотаГри)
   Фігури.Перемістити(ігрок, x, y)

   // Move rocks
   for i = 0 to кількістьАстероїдів-1 do
     let x = Математика.Залишок(Фігури.ОтриматиЛіво(астероїд.[i]) + (Математика.Кос(Математика.ОтриматиРадіани(кутАстероїда.[i] - 90.0)) * швидкістьАстероїдів) + ширинаГри, ширинаГри)
     let y = Математика.Залишок(Фігури.ОтриматиВерх(астероїд.[i]) + (Математика.Син(Математика.ОтриматиРадіани(кутАстероїда.[i] - 90.0)) * швидкістьАстероїдів) + высотаГри, высотаГри)
     Фігури.Перемістити(астероїд.[i], x, y)

   // Move ammo
   for i = 0 to кількістьКуль-1 do
     let x = Математика.Залишок(Фігури.ОтриматиЛіво(куля.[i]) + (Математика.Кос(Математика.ОтриматиРадіани(кутКулі.[i] - 90.0)) * швидкістьКулі) + ширинаГри, ширинаГри)
     let y = Математика.Залишок(Фігури.ОтриматиВерх(куля.[i]) + (Математика.Син(Математика.ОтриматиРадіани(кутКулі.[i] - 90.0)) * швидкістьКулі) + высотаГри, высотаГри)
     Фігури.Перемістити(куля.[i], x, y)
     вікПулі.[i] <- вікПулі.[i] + 1

// Check for collisions between onscreen items
and ПеревіркаЗіткнень () =
   // Calculate player bounding box.
   px1 <- Фігури.ОтриматиЛіво(ігрок) - ( (Математика.Модуль(ширинаІгрока * Математика.Кос(Математика.ОтриматиРадіани(кутІгрока)) + висотаІгрока * Математика.Син(Математика.ОтриматиРадіани(кутІгрока))) - ширинаІгрока) / 2.0)
   py1 <- Фігури.ОтриматиВерх(ігрок) - ( (Математика.Модуль(ширинаІгрока * Математика.Син(Математика.ОтриматиРадіани(кутІгрока)) + висотаІгрока * Математика.Кос(Математика.ОтриматиРадіани(кутІгрока))) - висотаІгрока) / 2.0)
   px2 <- px1 + Математика.Модуль(ширинаІгрока * Математика.Кос(Математика.ОтриматиРадіани(кутІгрока)) + висотаІгрока * Математика.Син(Математика.ОтриматиРадіани(кутІгрока)))
   py2 <- py1 + Математика.Модуль(ширинаІгрока * Математика.Син(Математика.ОтриматиРадіани(кутІгрока)) + висотаІгрока * Математика.Кос(Математика.ОтриматиРадіани(кутІгрока)))

   // Re-order co-oridinates if they are the wrong way arround
   if (px1 > px2) then
     let tmp = px1
     px1 <- px2
     px2 <- tmp  
   if (py1 > py2) then
     let tmp = py1
     py1 <- py2
     py2 <- tmp 

   let астероїдиДоВидалення = ResizeArray()
   let кулиДоВидалення = ResizeArray()
   // Check if each rock has hit something
   for i = 0 to кількістьАстероїдів-1 do
     let ax1 = Фігури.ОтриматиЛіво(астероїд.[i])
     let ay1 = Фігури.ОтриматиВерх(астероїд.[i])
     let ax2 = ax1 + float размірАстероїда.[i]
     let ay2 = ay1 + float размірАстероїда.[i]

     // Player collison
     if (безпекаІгрока < 1) then
       if ( (ax1 < px1 && ax2 > px1) || (ax1 < px2 && ax2 > px2) ) then
         if ( (ay1 < py1 && ay2 > py1) || (ay1 < py2 && ay2 > py2) ) then
           КінецьГри()

     // Ammo collison
     for j in 0..кількістьКуль-1 do          
         let bx1 = Фігури.ОтриматиЛіво(куля.[j])
         let by1 = Фігури.ОтриматиВерх(куля.[j])
         let bx2 = bx1 + розмірКулі
         let by2 = by1 + розмірКулі

         if ( (ax1 < bx1 && ax2 > bx1) || (ax1 < bx2 && ax2 > bx2) ) then
            if ( (ay1 < by1 && ay2 > by1) || (ay1 < by2 && ay2 > by2) ) then           
               астероїдиДоВидалення.Add(i)
               кулиДоВидалення.Add(j)

   for i in астероїдиДоВидалення |> Seq.distinct |> List.ofSeq |> List.rev do
      ВидалитиАстероид i
   for j in кулиДоВидалення |> Seq.distinct |> List.ofSeq |> List.rev do
      ВидалитиПулю j

   // Decrease the time player is safe
   if (безпекаІгрока > 0) then
     безпекаІгрока <- безпекаІгрока - 1   

// Add a new rock to the world
and ДодатиАстероїд () =
   // Check if the next rock size/position has been specified   
   let розмір,x,y =
      if (наступнийРозмір <> 0) then
         let розмір = минАстероїд * наступнийРозмір
         let x = Фігури.ОтриматиЛіво(наступнаПозиція)
         let y = Фігури.ОтриматиВерх(наступнаПозиція)
         наступнийРозмір <- 0
         розмір,x,y
      else
         // Choose a random size and position
         let розмір = минАстероїд * Математика.ОтриматиВипадковеЧисло(типАстероїдів)
         let x = Математика.ОтриматиВипадковеЧисло(int ширинаГри - розмір)
         let y = Математика.ОтриматиВипадковеЧисло(int высотаГри - розмір)
         розмір,float x,float y
   // Draw the rock
   ГрафичнеВікно.КолірПера <- колірАстероїдів
   let зображення =
      if розмір = 60 then великийАстероїд
      elif розмір = 40 then середнійАстероїд
      else малАстероїд
   астероїд.Add(Фігури.ДодатиЗображення(зображення))
   //Фігури.Zoom(rock.[rockCount],1.0,1.0)
   Фігури.Перемістити(астероїд.[кількістьАстероїдів], x, y)
   кутАстероїда.Add(float (Математика.ОтриматиВипадковеЧисло(360)))
   размірАстероїда.Add(розмір)
   кількістьАстероїдів <- кількістьАстероїдів + 1

// Remove a rock from the world and update score
and ВидалитиАстероид наступнийВилучений =
   let mutable видаляємийРозмір = размірАстероїда.[наступнийВилучений] / минАстероїд

   // If not a mini rock
   if (видаляємийРозмір > 1) then
     // ... add new rocks until we have made up for it being broken apart...
     while (видаляємийРозмір > 0) do
       наступнийРозмір <- Математика.ОтриматиВипадковеЧисло(видаляємийРозмір - 1)
       наступнаПозиція <- астероїд.[наступнийВилучений]
       видаляємийРозмір <- видаляємийРозмір - наступнийРозмір
       ДодатиАстероїд ()
     // And give a point for a 'hit'
     рахунок <- рахунок + 1
   else
     // We've destroyed it - give some extra points and 
     рахунок <- рахунок + 5   

   // Show updated score
   ГрафичнеВікно.Заголовок <- заголовокГри + (рахунок * множникБалів).ToString()

   // Remove all references from the arrays
   Фігури.Видалити(астероїд.[наступнийВилучений])
      
   астероїд.RemoveAt(наступнийВилучений)
   кутАстероїда.RemoveAt(наступнийВилучений)
   размірАстероїда.RemoveAt(наступнийВилучений)
   кількістьАстероїдів <- кількістьАстероїдів - 1

// Check if the player has completed the level, if so, level up
and ПеревіркаРівня () =
   if (кількістьАстероїдів < 1) then
     наступнийРозмір <- 0
     for i = 1 to іницАстероїди do
       ДодатиАстероїд()     
     іницАстероїди <- іницАстероїди + 1
     // Give players some time to move out of the way
     безпекаІгрока <- безпечнийЧас   

// Add ammo to game
and Постріл () =
   // Remove additional ammo
   while (кількістьКуль > (максКуль - 1)) do     
     ВидалитиПулю 0
   // Add the ammo
   ГрафичнеВікно.КолірПера <- колірКулі   
   куля.Add(Фігури.ДобавитьЭллипс(розмірКулі, розмірКулі))
   Фігури.Перемістити(куля.[кількістьКуль], (px1 + px2 - розмірКулі) / 2.0, (py1 + py2 - розмірКулі) / 2.0)
   кутКулі.Add(кутІгрока)
   вікПулі.Add(0)
   кількістьКуль <- кількістьКуль + 1

// Check ammo age
and СтарінняКуль () =
   while вікПулі.Count > 0 && (вікПулі.[0] > життяКулі) do     
      ВидалитиПулю 0

// Remove top Ammo
and ВидалитиПулю наступнийВилучений =
   Фігури.Видалити(куля.[наступнийВилучений])
   куля.RemoveAt(наступнийВилучений)
   кутКулі.RemoveAt(наступнийВилучений)
   вікПулі.RemoveAt(наступнийВилучений)
   кількістьКуль <- кількістьКуль - 1
   
// Display simple end game message box
and КінецьГри () =
   гра <- 0
   Фігури.Видалити(ігрок)
   ГрафичнеВікно.ПоказатиПовідомлення("Ваш рахунок " + (рахунок * множникБалів).ToString() + " балів. Дякуємо за гру.", "Гра скінчилась!")

// Start game
Ініціалізація()
Гра()
