open Бібліотека

ГрафичнеВікно.Ширина <- 288
ГрафичнеВікно.Висота <- 440

let фон = Фігури.ДодатиЗображення("bg.png")
let земля = Фігури.ДодатиЗображення("ground.png")
let чирикающая_птичка = Фігури.ДодатиЗображення("bird_sing.png")
let труба1 = СписокЗображень.ЗавантажитиЗображення("tube1.png")
let труба2 = СписокЗображень.ЗавантажитиЗображення("tube2.png")
Фігури.Перемістити(земля, 0, 340)

/// Тип птиці
type Птиця = { X:float; Y:float; VY:float; Жива:bool }
/// Respond to flap command
let хлоп (птиця:Птиця) = { птиця with VY = - System.Math.PI }
/// Применяет гравитацию к птице
let гравітація (bird:Птиця) = { bird with VY = bird.VY + 0.1 }
/// Applies physics to bird
let фізика (bird:Птиця) = { bird with Y = bird.Y + bird.VY }
/// Updates bird with gravity & physics
let оновити = гравітація >> фізика
 
/// Формує позиції труб рівня
let сгенеруватиРівень n =
   let rand = System.Random()
   [for i in 1..n -> 50+(i*150), 32+rand.Next(160)]

let рівень = сгенеруватиРівень 10

let труби =
   [for (x,y) in рівень ->
      let труба1 = Фігури.ДодатиЗображення(труба1)
      let труба2 = Фігури.ДодатиЗображення(труба2)
      Фігури.Перемістити(труба1,x,y-320)
      Фігури.Перемістити(труба2,x,y+100)
      (x,y), труба1, труба2]

let скролл = ref 0
let хлопик = ref { X = 30.0; Y = 150.0; VY = 0.0; Жива=true }
let хлопмене () = if (хлопик.Value).Жива then хлопик.Value <- хлоп хлопик.Value

ГрафичнеВікно.КнопкаНатиснута <-    
    fun () -> if ГрафичнеВікно.ОстанняКнопка = "Space" then хлопмене ()
ГрафичнеВікно.МишаНатиснута <-
    fun () -> хлопмене ()

while true do
   хлопик := оновити !хлопик
   let птиця = !хлопик
   Фігури.Перемістити(чирикающая_птичка, птиця.X, птиця.Y)
   for ((x,y),труба1,труба2) in труби do
      Фігури.Перемістити(труба1, float (x + !скролл),float (y-320))
      Фігури.Перемістити(труба2, float (x + !скролл),float (y+100))
   Фігури.Перемістити(земля, !скролл % 48, 340)
   decr скролл  
   Програма.Затримка(20)
