модуль Библиотека.Математика

пусть частный ранд = System.Random()
пусть ВзятьРадианы (град:float) = град * System.Math.PI / 180.
пусть ВзятьСлучайноеЧисло(n) = ранд.Next(n) + 1
пусть встроенный Остаток(x,y) = x % y
пусть Кос(угол) = cos угол
пусть Син(угол) = sin угол
пусть АркТан(угол) = atan угол
пусть встроенный Модуль(n) = abs n
пусть встроенный Floor(n) = floor n |> int
пусть встроенный Округлить(n) = round n
пусть встроенный КвадратныйКорень(d) = sqrt d
пусть встроенный Степень(x,n) = pown x n
