#r "nuget: Avalonia.Desktop, 11.0.0-preview3"
#r "nuget: Avalonia.Themes.Fluent, 11.0.0-preview3"
#r "../ісх/bin/Debug/net7.0/ВеселШарп.Бiблiотека.dll"

open Бiблiотека

let ГШ = float ГрафичнеВікно.Ширина
let ГВ = float ГрафичнеВікно.Висота
let Радиус = 200.0
let СредX = ГШ/2.0
let СредY = ГВ/2.0

let инициализироватьОкно () =
   ГрафичнеВікно.Показать()
   ГрафичнеВікно.Заголовок <- "Analog Clock"
   ГрафичнеВікно.КолірФона <- Кольори.Black
   ГрафичнеВікно.КолірПензлика <- Кольори.BurlyWood
   ГрафичнеВікно.НамалюватиЕліпс(СредX-Радиус-15.,СредY-Радиус-5.,Радиус*2.+30.,Радиус*2.+20.)
   ГрафичнеВікно.ЗаповнитиЕліпс(СредX-Радиус-15.,СредY-Радиус-5.,Радиус*2.+30.,Радиус*2.+20.)
   for angle in 1.0..180.0 do
     let x = СредX+(Радиус+15.)*Математика.Кос(Математика.ОтриматиРадіани(angle))
     let y1 = СредY+Радиус*Математика.Син(Математика.ОтриматиРадіани(angle))+15.
     let y2 = СредY+(Радиус+15.)*Математика.Син(Математика.ОтриматиРадіани(-angle))+10.
     let базоваяЯркость = Математика.ОтриматиВипадковеЧисло(40)+30
     ГрафичнеВікно.ШиринаПера <- Математика.ОтриматиВипадковеЧисло(5) |> float
     let цвет = 
       ГрафичнеВікно.ПолучитьЦветИзRGB(
         базоваяЯркость+100+Математика.ОтриматиВипадковеЧисло(10),
         базоваяЯркость+60+Математика.ОтриматиВипадковеЧисло(20),
         базоваяЯркость)
     ГрафичнеВікно.КолірПера <- цвет
     Фігури.ДобавитьЛинию(x,y1,x,y2) |> ignore
   ГрафичнеВікно.КолірПензлика <- Кольори.White   
   let ЦифрыЧасов = Словник()
   for i in 1. .. 12. do
     let Радианы = Математика.ОтриматиРадіани(-i * 30. + 90.)
     ЦифрыЧасов.[i] <- Фігури.ДобавитьТекст(i.ToString())
     Фігури.Перемістити(ЦифрыЧасов.[i],СредX-4.+Радиус*Математика.Кос(Радианы),СредY-4.-Радиус*Математика.Син(Радианы))   
   
let mutable ЧасоваяСтрелка = "<shape name>"
let mutable МинутнаяСтрелка = "<shape name>"
let mutable СекунднаяСтрелка = "<shape name>"
let mutable Час = 0.
let mutable Минута = 0.
let mutable Секунда = 0.
let установитьСтрелки () = 
   if (float Часы.Час + float Часы.Минута/60. + float Часы.Секунда/3600. <> Час) then
     Фігури.Видалити(ЧасоваяСтрелка)
     Час <- float Часы.Час + float Часы.Минута/60. + float Часы.Секунда/3600.
     ГрафичнеВікно.КолірПера <- Кольори.Black
     ГрафичнеВікно.ШиринаПера <- 3.
     ЧасоваяСтрелка <- 
       Фігури.ДобавитьЛинию(
         СредX,
         СредY,
         СредX+Радиус/2.*Математика.Кос(Математика.ОтриматиРадіани(Час*30.-90.)),
         СредY+Радиус/2.*Математика.Син(Математика.ОтриматиРадіани(Час*30.-90.)))   
   if float Часы.Минута <> Минута then
     Фігури.Видалити(МинутнаяСтрелка)
     Минута <- float Часы.Минута + float Часы.Секунда/60.
     ГрафичнеВікно.КолірПера <- Кольори.Blue
     ГрафичнеВікно.ШиринаПера <- 2.
     МинутнаяСтрелка <- 
       Фігури.ДобавитьЛинию(
         СредX,
         СредY,
         СредX+Радиус/1.2*Математика.Кос(Математика.ОтриматиРадіани(Минута*6.-90.)),
         СредY+Радиус/1.2*Математика.Син(Математика.ОтриматиРадіани(Минута*6.-90.)))   
   if float Часы.Секунда <> Секунда then
     Фігури.Видалити(СекунднаяСтрелка)
     Секунда <- float Часы.Секунда
     ГрафичнеВікно.КолірПера <- Кольори.Red
     ГрафичнеВікно.ШиринаПера <- 1.
     СекунднаяСтрелка <- 
       Фігури.ДобавитьЛинию(
         СредX,
         СредY,
         СредX+Радиус*Математика.Кос(Математика.ОтриматиРадіани(Секунда*6.-90.)),
         СредY+Радиус*Математика.Син(Математика.ОтриматиРадіани(Секунда*6.-90.)))
   
инициализироватьОкно()
while true do
   установитьСтрелки()
   //Звук.ИгратьКлик()
   Програма.Затримка(1000)