#r "nuget: Avalonia.Desktop, 11.0.0-preview4"
#r "nuget: Avalonia.Themes.Fluent, 11.0.0-preview4"
#r "../ісх/bin/Debug/net7.0/ВеселШарп.Бібліотека.dll"

відкрити Бібліотека

нехай гш = float ГрафичнеВікно.Ширина
нехай гв = float ГрафичнеВікно.Висота
нехай ракетка = Фігури.ДодатиПрямокутник(120, 12)
нехай мяч = Фігури.ДодатиЭллипс(16, 16)
нехай змінливий рахунок = 0

нехай НаПереміщенняМиші () =
  нехай ракеткаX = ГрафичнеВікно.МишаX
  Фігури.Перемістити(ракетка, ракеткаX - 60.0, гв - 12.0)

нехай НадрукуватиРахунок () =
  // Спочатку очистімо рахунок, а потім намалюємо справжній текст рахунка
  ГрафичнеВікно.КолірПензлика <- Кольори.White
  ГрафичнеВікно.ЗаповнитиПрямокутник(10, 10, 200, 20)
  ГрафичнеВікно.КолірПензлика <- Кольори.Black
  ГрафичнеВікно.НамалюватиТекст(10, 10, "Рахунок: " + рахунок.ToString())

ГрафичнеВікно.РозмірШрифта <- 14.0
ГрафичнеВікно.МишаПереміщена <- Callback(НаПереміщенняМиші)

НадрукуватиРахунок()
//Звук.ИгратьЗвонок()

нехай змінливий x = 0.0
нехай змінливий y = 0.0
нехай змінливий дельтаX = 1.0
нехай змінливий дельтаY = 2.0

доки (y < гв) зробити
  x <- x + дельтаX
  y <- y + дельтаY
  
  якщо (x >= гш - 16.0 || x <= 0.0) тоді
    дельтаX <- -дельтаX 
  якщо (y <= 0.0) тоді
    дельтаY <- -дельтаY
 
  нехай ракеткаX = Фігури.ОтриматиЛіво(ракетка)
  якщо (y = гв - 28.0 && x >= ракеткаX && x <= ракеткаX + 120.0) тоді
    //Звук.ИгратьКлик()
    рахунок <- рахунок + 10
    НадрукуватиРахунок()
    дельтаY <- -дельтаY  

  Фігури.Перемістити(мяч, x, y)
  Програма.Затримка(15)
  
ГрафичнеВікно.ПоказатиПовідомлення("Ваш рахунок: " + рахунок.ToString(), "Ракетка")
Програма.Затримка(1_500)