#r "nuget: Xwt"
#r "../ісх/bin/Debug/net48/ВеселШарп.Бiблiотека.dll"

open Бiблiотека

let гш = float ГрафичнеВікно.Ширина
let гв = float ГрафичнеВікно.Высота
let ракетка = Фигуры.ДодатиПрямокутник(120, 12)
let мяч = Фигуры.ДобавитьЭллипс(16, 16)
let mutable счет = 0

let НаМышьПеремещена () =
  let ракеткаX = ГрафичнеВікно.МишаX
  Фигуры.Перемістити(ракетка, ракеткаX - 60.0, гв - 12.0)

let НапечататьСчет () =
  // Сперва очистим счет и затем нарисуем текст настоящего счета
  ГрафичнеВікно.ЦветКисти <- Кольори.White
  ГрафичнеВікно.ЗаполнитьПрямоугольник(10, 10, 200, 20)
  ГрафичнеВікно.ЦветКисти <- Кольори.Black
  ГрафичнеВікно.НарисоватьТекст(10, 10, "Счет: " + счет.ToString())

ГрафичнеВікно.РозмірШрифта <- 14.0
ГрафичнеВікно.МышьПеремещена <- Callback(НаМышьПеремещена)

НапечататьСчет()
//Звук.ИгратьЗвонок()

let mutable x = 0.0
let mutable y = 0.0
let mutable дельтаX = 1.0
let mutable дельтаY = 2.0

while (y < гв) do
  x <- x + дельтаX
  y <- y + дельтаY
  
  if (x >= гш - 16.0 || x <= 0.0) then
    дельтаX <- -дельтаX 
  if (y <= 0.0) then
    дельтаY <- -дельтаY
 
  let padX = Фигуры.ПолучитьЛево(ракетка)
  if (y = гв - 28.0 && x >= padX && x <= padX + 120.0) then
    //Звук.ИгратьКлик()
    счет <- счет + 10
    НапечататьСчет()
    дельтаY <- -дельтаY  

  Фигуры.Перемістити(мяч, x, y)
  Програма.Затримка(15)
  
ГрафичнеВікно.ПоказатьСообщение("Ваш счет: " + счет.ToString(), "Ракетка")
Програма.Затримка(1_500)