#r "nuget: Avalonia.Desktop, 11.0.0-preview3"
#r "nuget: Avalonia.Themes.Fluent, 11.0.0-preview3"
#r "../ісх/bin/Debug/net7.0/ВеселШарп.Бібліотека.dll"

open Бібліотека

let mutable p = 0

ГрафичнеВікно.МожнаЗмінитиРозмір <- false
ГрафичнеВікно.Ширина <- 520
ГрафичнеВікно.Висота <- 460
ГрафичнеВікно.Заголовок <- "Калькулятор v. 1.0 від Alex_2000"

ГрафичнеВікно.КолірФона = ГрафичнеВікно.ОтриматиКолірЗRGB(240, 240, 240)
ГрафичнеВікно.ЖирністьШрифта <- false
ГрафичнеВікно.КолірПензлика <- Кольори.Black

let m = Фігури.ДодатиТекст("M")
Фігури.Перемістити(m, 22, 62)
Фігури.СкрытьФигуру(m)

let N = 2

let т = ЭлементиКерування.ДобавитьТекстовоеПоле(10, 10)
ЭлементиКерування.УстановитьРазмер(т, 240*N, 22*N)
ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")

let R0 = 58
let R1 = R0 + (95-58)*N
let R2 = R1 + (128-95)*N 
let R3 = R2 + (161-128)*N
let R4 = R3 + (194-161)*N
let C0 = 10
let C1 = C0  + (58-10)*N
let C2 = C1  + (99-58)*N
let C3 = C2 + (140-99)*N
let C4 = C3 + (181-140)*N
let C5 = C4 + (222-181)*N
let T0 = C0
let T1 = T0 + (139-58)*N
let T2 = T1 + (202-139)*N 
ГрафичнеВікно.КолірПензлика <- Кольори.Red
let кнопкаMC = ЭлементиКерування.ДобавитьКнопку("MC", C0, R1)
ЭлементиКерування.УстановитьРазмер(кнопкаMC, 35*N, 25*N)
let кнопкаMR = ЭлементиКерування.ДобавитьКнопку("MR", C0, R2)
ЭлементиКерування.УстановитьРазмер(кнопкаMR, 35*N, 25*N)
let кнопкаMS = ЭлементиКерування.ДобавитьКнопку("MS", C0, R3)
ЭлементиКерування.УстановитьРазмер(кнопкаMS, 35*N, 25*N)
let кнопкаMплюс = ЭлементиКерування.ДобавитьКнопку("M+", C0, R4)
ЭлементиКерування.УстановитьРазмер(кнопкаMплюс, 35*N, 25*N)
let кнопкаC = ЭлементиКерування.ДобавитьКнопку("C", T2, R0)
ЭлементиКерування.УстановитьРазмер(кнопкаC, 55*N, 25*N )
let кнопкаCE = ЭлементиКерування.ДобавитьКнопку("CE", T1, R0)
ЭлементиКерування.УстановитьРазмер(кнопкаCE, 55*N, 25*N)
let кнопкаСтереть = ЭлементиКерування.ДобавитьКнопку("Backspace", T0, R0)
ЭлементиКерування.УстановитьРазмер(кнопкаСтереть, 70*N, 25*N)

let кнопкаделение = ЭлементиКерування.ДобавитьКнопку("/", C4, R1)
ЭлементиКерування.УстановитьРазмер(кнопкаделение, 35*N, 25*N)
let кнопкаумножение = ЭлементиКерування.ДобавитьКнопку("*", C4, R2)
ЭлементиКерування.УстановитьРазмер(кнопкаумножение, 35*N, 25*N)
let кнопкаминус = ЭлементиКерування.ДобавитьКнопку("-", C4, R3)
ЭлементиКерування.УстановитьРазмер(кнопкаминус, 35*N, 25*N)
let кнопкаплюс = ЭлементиКерування.ДобавитьКнопку("+", C4, R4)
ЭлементиКерування.УстановитьРазмер(кнопкаплюс, 35*N, 25*N)
let кнопкаравно = ЭлементиКерування.ДобавитьКнопку("=", C5, R4)
ЭлементиКерування.УстановитьРазмер(кнопкаравно, 35*N, 25*N)

ГрафичнеВікно.КолірПензлика <- Кольори.Blue
let кнопка7 = ЭлементиКерування.ДобавитьКнопку("7", C1, R1)
ЭлементиКерування.УстановитьРазмер(кнопка7, 35*N, 25*N)
let кнопка8 = ЭлементиКерування.ДобавитьКнопку("8", C2, R1)
ЭлементиКерування.УстановитьРазмер(кнопка8, 35*N, 25*N)
let кнопка9 = ЭлементиКерування.ДобавитьКнопку("9", C3, R1)
ЭлементиКерування.УстановитьРазмер(кнопка9, 35*N, 25*N)
let кнопка4 = ЭлементиКерування.ДобавитьКнопку("4", C1, R2)
ЭлементиКерування.УстановитьРазмер(кнопка4, 35*N, 25*N)
let кнопка5 = ЭлементиКерування.ДобавитьКнопку("5", C2, R2)
ЭлементиКерування.УстановитьРазмер(кнопка5, 35*N, 25*N)
let кнопка6 = ЭлементиКерування.ДобавитьКнопку("6", C3, R2)
ЭлементиКерування.УстановитьРазмер(кнопка6, 35*N, 25*N)
let кнопка1 = ЭлементиКерування.ДобавитьКнопку("1", C1, R3)
ЭлементиКерування.УстановитьРазмер(кнопка1, 35*N, 25*N)
let кнопка2 = ЭлементиКерування.ДобавитьКнопку("2", C2, R3)
ЭлементиКерування.УстановитьРазмер(кнопка2, 35*N, 25*N)
let кнопка3 = ЭлементиКерування.ДобавитьКнопку("3", C3, R3)
ЭлементиКерування.УстановитьРазмер(кнопка3, 35*N, 25*N)
let кнопка0 = ЭлементиКерування.ДобавитьКнопку("0", C2, R4)
ЭлементиКерування.УстановитьРазмер(кнопка0, 35*N, 25*N)

let кнопкаплюсминус = ЭлементиКерування.ДобавитьКнопку("+/-", C3, R4)
ЭлементиКерування.УстановитьРазмер(кнопкаплюсминус, 35*N, 25*N)
let кнопкаточка = ЭлементиКерування.ДобавитьКнопку(".", C1, R4)
ЭлементиКерування.УстановитьРазмер(кнопкаточка, 35*N, 25*N)

let кнопкакорень = ЭлементиКерування.ДобавитьКнопку("sqrt", C5, R1)
ЭлементиКерування.УстановитьРазмер(кнопкакорень, 35*N, 25*N)
let keyprocent = ЭлементиКерування.ДобавитьКнопку("%", C5, R2)
ЭлементиКерування.УстановитьРазмер(keyprocent, 35*N, 25*N)
let кнопканаХ = ЭлементиКерування.ДобавитьКнопку("1/x", C5, R3)
ЭлементиКерування.УстановитьРазмер(кнопканаХ, 35*N, 25*N)

let mutable a = ""
let mutable b = ""
let mutable c = ""
let mutable знак = ""

let нажато () =
  //Sound.PlayClick()
  if ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка0 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "0"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка1 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "1"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка2 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "2"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка3 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "3"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка4 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "4"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка5 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "5"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка6 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "6"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка7 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "7"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка8 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "8"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопка9 then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "9"))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаточка then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), "."))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаплюсминус then
    if p = 0 then
      ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.Додати("-", ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)))
      p <- 1
    else
      ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (Математика.Модуль(float (ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)))))
      p <- 0   
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаплюс then
    a <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
    знак <- "+"
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаминус then
    a <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
    знак <- "-"
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаумножение then
    a <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
    знак <- "*"
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаделение then
    a <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
    знак <- "/"
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкакорень then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (Математика.КвадратнийКорінь(float(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)))))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопканаХ then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (1.0/float (ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т))))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаC then
    a <- ""
    b <- ""
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаCE then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "")
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаСтереть then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, Текст.ОтриматиЧастинуТекста(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т), 1, Текст.ОтриматиДовжину(ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т))-1))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаMплюс || ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаMS then
    c <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    Фігури.ПоказатьФигуру(m)
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаMC then
    c <- ""
    Фігури.СкрытьФигуру(m)
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаMR then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, c)
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = keyprocent then
    ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (float a * float (ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т))/100.0))
  elif ЭлементиКерування.ПоследняяКликнутаяКнопка = кнопкаравно then
    b <- ЭлементиКерування.ПолучитьТекстТекстовогоПоля(т)
    if знак = "+" then
      ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (float a + float b))
    elif знак = "-" then
      ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (float a - float b))
    elif знак = "*" then
      ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (float a * float b))
    elif знак = "/" then
      if float b = 0.0 then
        ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, "Divide by zero is impossible!")
      else
        ЭлементиКерування.УстановитьТекстТекстовогоПоля(т, string (float a / float b))

ЭлементиКерування.КнопкаКликнута <- Callback(нажато)

Програма.Затримка(20_000)