#r "nuget: Avalonia.Desktop, 11.0.0-preview3"
#r "nuget: Avalonia.Themes.Fluent, 11.0.0-preview3"
#r "../ісх/bin/Debug/net7.0/ВеселШарп.Бібліотека.dll"

відкрити Бібліотека

нехай наНатискКнопки () =
   match ГрафичнеВікно.ОстанняКнопка із
   | "F1" -> ГрафичнеВікно.КолірПера <- Кольори.Red
   | "F2" -> ГрафичнеВікно.КолірПера <- Кольори.Blue
   | "F3" -> ГрафичнеВікно.КолірПера <- Кольори.LightGreen
   | "C" -> ГрафичнеВікно.Очистити()
   | s -> printfn "'%s'" s; System.Diagnostics.Debug.WriteLine(s)

нехай змінливий останX = 0.0
нехай змінливий останY = 0.0

нехай наНатискМиші () =
   останX <- ГрафичнеВікно.МишаX
   останY <- ГрафичнеВікно.МишаY
   
нехай наПереміщенняМиші () =
   нехай x = ГрафичнеВікно.МишаX
   нехай y = ГрафичнеВікно.МишаY
   якщо Миша.ЛіваКнопкаНатиснута тоді
      ГрафичнеВікно.НамалюватиЛінію(останX, останY, x, y)
   останX <- x
   останY <- y

ГрафичнеВікно.КолірПера <- Кольори.Black
ГрафичнеВікно.КолірФона <- Кольори.White
ГрафичнеВікно.МишаДонизу <- Callback(наНатискМиші)
ГрафичнеВікно.МишаПереміщена <- Callback(наПереміщенняМиші)
ГрафичнеВікно.КлавішаНатиснута <- Callback(наНатискКнопки)
Програма.Затримка(20_000)