#r "nuget: Avalonia.Desktop, 12.1.3"
#r "nuget: System.Windows.Extensions, 10.0.12"
#r "nuget: FSharp.Core.Ukrainian"
#r "../ісх/bin/Debug/net10.0/ВеселШарп.Бібліотека.dll"

відкрити Бібліотека

нехай наНатискКнопки () =
   відповідає ГрафичнеВікно.ОстанняКнопка із
   | "F1" -> ГрафичнеВікно.КолірПера <- Кольори.Червоний
   | "F2" -> ГрафичнеВікно.КолірПера <- Кольори.Синій
   | "F3" -> ГрафичнеВікно.КолірПера <- Кольори.LightGreen
   | "C" -> ГрафичнеВікно.Очистити()
   | s -> printfn "'%s'" s; System.Diagnostics.Debug.WriteLine(s)

нехай змінливий останX = 0.0
нехай змінливий останY = 0.0

нехай наНатискМиші () =
   останX <- ГрафичнеВікно.МишаX
   останY <- ГрафичнеВікно.МишаY
   
нехай наПереміщенняМиші () =
   нехай x = ГрафичнеВікно.МишаX
   нехай y = ГрафичнеВікно.МишаY
   якщо Миша.ЛіваКнопкаНатиснута тоді
      ГрафичнеВікно.НамалюватиЛінію(останX, останY, x, y)
   останX <- x
   останY <- y

ГрафичнеВікно.КолірПера <- Кольори.Чорний
ГрафичнеВікно.КолірФона <- Кольори.Білий
ГрафичнеВікно.МишаДонизу <- Callback(наНатискМиші)
ГрафичнеВікно.МишаПереміщена <- Callback(наПереміщенняМиші)
ГрафичнеВікно.КлавішаНатиснута <- Callback(наНатискКнопки)
Програма.Затримка(20_000)
