#r "nuget: Avalonia.Desktop, 12.1.3"
#r "nuget: System.Windows.Extensions, 10.0.12"
#r "nuget: FSharp.Core.Ukrainian"
#r "../ісх/bin/Debug/net10.0/ВеселШарп.Бібліотека.dll"

open Бібліотека

let наНатискКнопки () =
   match ГрафичнеВікно.ОстанняКнопка with
   | "F1" -> ГрафичнеВікно.КолірПера <- Кольори.Червоний
   | "F2" -> ГрафичнеВікно.КолірПера <- Кольори.Синій
   | "F3" -> ГрафичнеВікно.КолірПера <- Кольори.LightGreen
   | "C" -> ГрафичнеВікно.Очистити()
   | s -> printfn "'%s'" s; System.Diagnostics.Debug.WriteLine(s)

let mutable останX = 0.0
let mutable останY = 0.0

let наНатискМиші () =
   останX <- ГрафичнеВікно.МишаX
   останY <- ГрафичнеВікно.МишаY
   
let наПереміщенняМиші () =
   let x = ГрафичнеВікно.МишаX
   let y = ГрафичнеВікно.МишаY
   if Миша.ЛіваКнопкаНатиснута then
      ГрафичнеВікно.НамалюватиЛінію(останX, останY, x, y)
   останX <- x
   останY <- y

ГрафичнеВікно.КолірПера <- Кольори.Чорний
ГрафичнеВікно.КолірФона <- Кольори.Білий
ГрафичнеВікно.МишаДонизу <- Callback(наНатискМиші)
ГрафичнеВікно.МишаПереміщена <- Callback(наПереміщенняМиші)
ГрафичнеВікно.КлавішаНатиснута <- Callback(наНатискКнопки)
Програма.Затримка(20_000)
