#r "nuget: Avalonia.Desktop, 11.0.0"
#r "nuget: Avalonia.Themes.Fluent, 11.0.0"
#r "../ісх/bin/Debug/net7.0/ВеселШарп.Бібліотека.dll"

відкрити Бібліотека

нехай фон = Фігури.ДодатиЗображення("http://flappycreator.com/default/bg.png")
нехай земля = Фігури.ДодатиЗображення("http://flappycreator.com/default/ground.png")
нехай птиця = Фігури.ДодатиЗображення("http://flappycreator.com/default/bird_sing.png")
нехай труба1 = СписокЗображень.ЗавантажитиЗображення("http://flappycreator.com/default/tube1.png")
нехай труба2 = СписокЗображень.ЗавантажитиЗображення("http://flappycreator.com/default/tube2.png")
нехай т1 = Фігури.ДодатиЗображення(труба1)
нехай т2 = Фігури.ДодатиЗображення(труба2)

Фігури.Перемістити(т1, 150.0, 50.0-320.0)
Фігури.Перемістити(т2, 150.0, 150.0)
Фігури.Перемістити(земля, 0.0, 340.0)
Фігури.Повернути(птиця,45.0*4.0)
Фігури.Перемістити(птиця,50.0,100.0)
ГрафичнеВікно.Показати()
ГрафичнеВікно.Ширина <- 288
ГрафичнеВікно.Висота <- 440
Програма.Затримка(20_000)
