#r "nuget: Xwt"
#r "../ісх/bin/Debug/net48/ВеселШарп.Бiблiотека.dll"

open Бiблiотека

let наКнопкаНажата () =
   match ГрафичнеВікно.ОстанняКнопка with
   | "F1" -> ГрафичнеВікно.КолірПера <- Кольори.Red
   | "F2" -> ГрафичнеВікно.КолірПера <- Кольори.Blue
   | "F3" -> ГрафичнеВікно.КолірПера <- Кольори.LightGreen
   | "c" -> ГрафичнеВікно.Очистити()
   | s -> printfn "'%s'" s; System.Diagnostics.Debug.WriteLine(s)

let mutable останX = 0.0
let mutable останY = 0.0

let наМышьНажата () =
   останX <- ГрафичнеВікно.МишаX
   останY <- ГрафичнеВікно.МишаY
   
let наМышьПеремещена () =
   let x = ГрафичнеВікно.МишаX
   let y = ГрафичнеВікно.МишаY
   if Мышь.ЛеваяКнопкаНажата then
      ГрафичнеВікно.НамалюватиЛінію(останX, останY, x, y)
   останX <- x
   останY <- y

ГрафичнеВікно.КолірПера <- Кольори.Black
ГрафичнеВікно.КолірФона <- Кольори.White
ГрафичнеВікно.МышьНажата <- Callback(наМышьНажата)
ГрафичнеВікно.МышьПеремещена <- Callback(наМышьПеремещена)
ГрафичнеВікно.КнопкаНажата <- Callback(наКнопкаНажата)
Програма.Затримка(20_000)