#r "nuget: Avalonia.Desktop, 12.1.3"
#r "nuget: System.Windows.Extensions, 10.0.12"
#r "nuget: FSharp.Core.Ukrainian"
#r "../ісх/bin/Debug/net10.0/ВеселШарп.Бібліотека.dll"

відкрити Бібліотека

нехай кут = 30.0
нехай дельта = 10.0

нехай рек намалюватиДерево відстань =
   якщо відстань > 0.0 тоді
      Черепаха.Перемістити(відстань)
      Черепаха.Повернути(кут)
      намалюватиДерево(відстань - дельта)
      Черепаха.Повернути(-кут * 2.0)
      намалюватиДерево(відстань - дельта)
      Черепаха.Повернути(кут)
      Черепаха.Перемістити(-відстань)

намалюватиДерево 60.0
Програма.Затримка(2_000)
