відкрити Бібліотека

ГрафичнеВікно.Ширина <- 288
ГрафичнеВікно.Висота <- 440

нехай фон = Фігури.ДодатиЗображення("bg.png")
нехай земля = Фігури.ДодатиЗображення("ground.png")
нехай цвірінькаюча_пташка = Фігури.ДодатиЗображення("bird_sing.png")
нехай труба1 = СписокЗображень.ЗавантажитиЗображення("tube1.png")
нехай труба2 = СписокЗображень.ЗавантажитиЗображення("tube2.png")
Фігури.Перемістити(земля, 0, 340)

/// Тип птиці
тип Птиця = { X:float; Y:float; VY:float; Жива:bool }
/// Відповісти на команди помахів
нехай помах (птиця:Птиця) = { птиця із VY = - System.Math.PI }
/// Застосовуємо гравітацію до птиці
нехай гравітація (птиця:Птиця) = { птиця із VY = птиця.VY + 0.1 }
/// Застосовуємо фізіку до птиці
нехай фізика (птиця:Птиця) = { птиця із Y = птиця.Y + птиця.VY }
/// Оновлюємо птицю с допомогою гравітації та фізіки
нехай оновити = гравітація >> фізика
 
/// Формує позиції труб рівня
нехай сгенеруватиРівень n =
   нехай rand = System.Random()
   [для i у 1..n -> 50+(i*150), 32+rand.Next(160)]

нехай рівень = сгенеруватиРівень 10

нехай труби =
   [для (x,y) у рівень ->
      нехай труба1 = Фігури.ДодатиЗображення(труба1)
      нехай труба2 = Фігури.ДодатиЗображення(труба2)
      Фігури.Перемістити(труба1,x,y-320)
      Фігури.Перемістити(труба2,x,y+100)
      (x,y), труба1, труба2]

нехай скролл = ссил 0
нехай помашок = ссил { X = 30.0; Y = 150.0; VY = 0.0; Жива=істина }
нехай помашимною () = якщо (помашок.Value).Жива тоді помашок.Value <- помах помашок.Value

ГрафичнеВікно.КлавішаНатиснута <-    
    фун () -> якщо ГрафичнеВікно.ОстанняКнопка = "Space" тоді помашимною ()
ГрафичнеВікно.МишаДонизу <-
    фун () -> помашимною ()

доки істина зробити
   помашок := оновити !помашок
   нехай птиця = !помашок
   Фігури.Перемістити(цвірінькаюча_пташка, птиця.X, птиця.Y)
   для ((x,y),труба1,труба2) у труби зробити
      Фігури.Перемістити(труба1, плаваюча (x + !скролл),плаваюча (y-320))
      Фігури.Перемістити(труба2, плаваюча (x + !скролл),плаваюча (y+100))
   Фігури.Перемістити(земля, !скролл % 48, 340)
   зменьш скролл
   Програма.Затримка(20)
