open Бібліотека

ГрафичнеВікно.Ширина <- 288
ГрафичнеВікно.Висота <- 440

let фон = Фігури.ДодатиЗображення("bg.png")
let земля = Фігури.ДодатиЗображення("ground.png")
let цвірінькаюча_пташка = Фігури.ДодатиЗображення("bird_sing.png")
let труба1 = СписокЗображень.ЗавантажитиЗображення("tube1.png")
let труба2 = СписокЗображень.ЗавантажитиЗображення("tube2.png")
Фігури.Перемістити(земля, 0, 340)

/// Тип птиці
type Птиця = { X:float; Y:float; VY:float; Жива:bool }
/// Відповісти на команди помахів
let помах (птиця:Птиця) = { птиця with VY = - System.Math.PI }
/// Застосовуємо гравітацію до птиці
let гравітація (птиця:Птиця) = { птиця with VY = птиця.VY + 0.1 }
/// Застосовуємо фізіку до птиці
let фізика (птиця:Птиця) = { птиця with Y = птиця.Y + птиця.VY }
/// Оновлюємо птицю с допомогою гравітації та фізіки
let оновити = гравітація >> фізика
 
/// Формує позиції труб рівня
let сгенеруватиРівень n =
   let rand = System.Random()
   [for i in 1..n -> 50+(i*150), 32+rand.Next(160)]

let рівень = сгенеруватиРівень 10

let труби =
   [for (x,y) in рівень ->
      let труба1 = Фігури.ДодатиЗображення(труба1)
      let труба2 = Фігури.ДодатиЗображення(труба2)
      Фігури.Перемістити(труба1,x,y-320)
      Фігури.Перемістити(труба2,x,y+100)
      (x,y), труба1, труба2]

let скролл = ref 0
let помашок = ref { X = 30.0; Y = 150.0; VY = 0.0; Жива=true }
let помашимною () = if (помашок.Value).Жива then помашок.Value <- помах помашок.Value

ГрафичнеВікно.КлавішаНатиснута <-    
    fun () -> if ГрафичнеВікно.ОстанняКнопка = "Space" then помашимною ()
ГрафичнеВікно.МишаДонизу <-
    fun () -> помашимною ()

while true do
   помашок := оновити !помашок
   let птиця = !помашок
   Фігури.Перемістити(цвірінькаюча_пташка, птиця.X, птиця.Y)
   for ((x,y),труба1,труба2) in труби do
      Фігури.Перемістити(труба1, float (x + !скролл),float (y-320))
      Фігури.Перемістити(труба2, float (x + !скролл),float (y+100))
   Фігури.Перемістити(земля, !скролл % 48, 340)
   decr скролл  
   Програма.Затримка(20)
