#if INTERACTIVE
#r "./bin/debug/Xwt.dll"
#r "./bin/debug/FunSharp.dll"
#endif

відкрити Бібліотека

тип System.Collections.Generic.Dictionary<'TKey,'TValue> із
   член this.GetOrDefault(ключ:'TKey,значение:'TValue) =
      відповідає this.TryGetValue(ключ) із
      | істина, значение -> значение
      | ложь, _ -> значение


// 1942 like Game ID: KJW676
// Copyright (C) 2010, Laurent GIRAUD laurent.giraud1@free.fr
// License: MIT license http://www.opensource.org/licenses/mit-license.php
// most of Game artwork created by Ari Feldman ari@arifeldman.com"
// and others grabed from free web sprites

нехай кулиСінхр = obj()

//-------------------------
// or load from web url
//нехай Путь= "http://imode.free.fr/images1942/"
нехай Шлях = ""
//-------------------------

// Game area controls
нехай ширинаГри  = 640
нехай висотаГри = 480
нехай fps = 50
нехай швф = 2 //backgroundspeed
нехай змінливий Життя_Гравця = 10
нехай клкостровів = 5 //nomber of island images
нехай кількістьостровів = 5 //nomber of island in the wall field

// Заголовок окна
нехай заголовокГри = "1942, Рахунок: "

ГрафичнеВікно.Сховати()
ГрафичнеВікно.Заголовок <- заголовокГри + "0"
ГрафичнеВікно.МожнаЗмінитиРозмір <- ложь
ГрафичнеВікно.Ширина <- ширинаГри
ГрафичнеВікно.Висота <- висотаГри

// Global variables

нехай змінливий ігрок = "<shape name>"
нехай змінливий ракеткаX = 0
нехай змінливий ракеткаY = 0
нехай змінливий фон = "<shape name>"

// addImage in the right order is needed to define the shapes depth
нехай острів4 = СписокЗображень.ЗавантажитиЗображення(Шлях + "island4.png")
нехай острів1= СписокЗображень.ЗавантажитиЗображення(Шлях + "island1.png")
нехай острів2= СписокЗображень.ЗавантажитиЗображення(Шлях + "island2.png")
нехай острів3= СписокЗображень.ЗавантажитиЗображення(Шлях + "island3.png")
нехай острів5= СписокЗображень.ЗавантажитиЗображення(Шлях + "island5.png")
нехай ігрок0 = СписокЗображень.ЗавантажитиЗображення(Шлях + "myplane1.png")
нехай основа = СписокЗображень.ЗавантажитиЗображення(Шлях + "fond.png")
нехай куля0 = СписокЗображень.ЗавантажитиЗображення(Шлях + "bullet.png")
нехай ворог= СписокЗображень.ЗавантажитиЗображення(Шлях + "enemy1.png")
нехай ворог2 = СписокЗображень.ЗавантажитиЗображення(Шлях + "enemy2.png")
нехай вибух_ворога1=СписокЗображень.ЗавантажитиЗображення(Шлях + "explo1.png")
нехай вибух_ворога2=СписокЗображень.ЗавантажитиЗображення(Шлях + "explo2.png")
нехай вибух_ігрока=СписокЗображень.ЗавантажитиЗображення(Шлях + "explo2.png")
нехай Ворожа_куля=СписокЗображень.ЗавантажитиЗображення(Шлях + "E_bullet.png")
нехай ``кінець`` = СписокЗображень.ЗавантажитиЗображення(Шлях + "End.png")

нехай массив_Ворогів = Словник() // Array that contain all the enemies
нехай час_Ворогів = Словник()
нехай лінія_ворогів = Словник()
нехай позX_Ворога = Словник()
нехай позY_Ворога = Словник()
нехай ворог_ШляхNBR = Словник()

нехай змінливий ном_Ворога = 6
нехай змінливий кількість_Ворога = 0
нехай швидкість_ворогів = 4.0
//enemy_NextRemove = 1
нехай життя_Ворогів = 10
нехай розмір_ігрока= 65
нехай розмір_ворога = 32
нехай розмір_куль_ворога = 8
нехай розмір_кулі_ігрока = 32

нехай масив_Островів = Словник()

нехай Кули_Гравця = Словник()
нехай ВікКули_Гравця = Словник()
ВікКули_Гравця.[1] <- 0
нехай Ігрок_МаксКуль = 50
нехай змінливий Гравець_КількістьКуль = 0
нехай ШвидкістьКули_Ігрока = float швф + 4.0
нехай Ігрок_ЖиттяСнаряда = 100

нехай змінливий ПострілX = nan
нехай змінливий ВыстрелY = nan

нехай змінливий інкx = 0  // X-axis increment for background
нехай змінливий інкy = 0  // Y-axis increment for background
нехай змінливий інккx = 0.0 // increment for bullets and all objects on X
нехай змінливий інккy = 0.0 // increment for bullets and all objects on Y

нехай Кули_Ворога = Словник()
нехай ВікКулі_Ворога = Словник()
ВікКулі_Ворога.[1] <- 0
нехай Кут_Куль_Ворога= Словник()
нехай Ворог_МаксКуль = 30
нехай змінливий КількістьКуль_Ворога = 0
нехай Швидкість_КульВорога = швф + 4
нехай Ворог_ЖиттяСнаряда = 50
нехай Ворог_Агрессивність = 200
нехай змінливий Постріл_ВорогаX = 0
нехай змінливий Постріл_ВорогаY = 0

нехай змінливий ЧасІгри = 0

нехай змінливий шляхNBR = 1
нехай змінливий позВорогаX1 = 0
нехай змінливий позВорогаY1 = 0
нехай змінливий тип_ворога = 0

нехай змінливий рахунок = 0

нехай позОстровів = Словник<int,Словник<int,int>>()
нехай інкострівx = Словник<int,int>()
нехай інкострівy = Словник<int,int>()
нехай рівень1 = Словник<int,Словник<int,int>>()
нехай шляхВорога = Словник<int, Словник<int, Словник<int,float>>>()
нехай позx = Словник<int,_>()
нехай позy = Словник<int,_>()

// Налаштувати світ
нехай рек Ініціалізація() =
   ГрафичнеВікно.Сховати()

   Миша.СховатиКурсор()

   // every enemy in tha array has 5 informations
   // TimeLine: each enemy has its own timeline
   // PathNBR: the precalculated path defineing the movement
   // the movement is decomposed in LineNbr differents lines
   // each line is define in the enemy_path table with rotation, deltaY and deltaY
   // PositonX, PositonY: position in space
   //

   ПозиціїОстровів()
   створити_рівень1()

   фон <- Фігури.ДодатиЗображення(основа)
   масив_Островів.[1] <- Фігури.ДодатиЗображення(острів1)
   масив_Островів.[2] <- Фігури.ДодатиЗображення(острів2)
   масив_Островів.[3] <- Фігури.ДодатиЗображення(острів3)
   масив_Островів.[4] <- Фігури.ДодатиЗображення(острів4)
   масив_Островів.[5] <- Фігури.ДодатиЗображення(острів5)
   для i = 6 до кількістьостровів зробити
      масив_Островів.[i] <- масив_Островів.[Математика.Залишок(i,4)]

   ігрок <- Фігури.ДодатиЗображення(ігрок0)
   ГрафичнеВікно.РозмірШрифта <- 20.0
   ГрафичнеВікно.КолірФона <- Кольори.Gray
   ГрафичнеВікно.КолірПера <- Кольори.Yellow



// Головна ігрова процедура
та Гра () =
   ГрафичнеВікно.Показати()

   // Головний цикл
   нехай гра = 1
   нехай пауза = 0
   інкx <- 0  // X-axis increment for background
   інкy <- 0  // Y-axis increment for background
   інккx <- 0.0 // increment for bullets and all objects on X
   інккy <- 0.0 // increment for bullets and all objects on Y
   нехай змінливий ескадрон = 1
   // Начальна позиция островів 
   нехай змінливий j=0

   для i=1 до кількістьостровів зробити
      j <- Математика.Залишок(i,6)
      позy.[i] <- позОстровів.[j].[2]
      позx.[i] <- позОстровів.[j].[3]
      інкострівx.[i] <- 0
      інкострівy.[i] <- 0   
   ЧасІгри <- 0
   Фігури.Перемістити(ігрок, ширинаГри/2 , висотаГри - 80 )
   доки (гра = 1) зробити
      Програма.Затримка(1000/fps)
      ЧасІгри <- ЧасІгри + 1

      якщо (пауза = 0) тоді
         якщо (ЧасІгри = рівень1.[ескадрон].[1]) тоді

            шляхNBR <- рівень1.[ескадрон].[2]
            позВорогаX1 <- рівень1.[ескадрон].[3]  //позиция X
            позВорогаY1 <- рівень1.[ескадрон].[4]  //позиция Y
            ном_Ворога <- рівень1.[ескадрон].[6]
            тип_ворога <- рівень1.[ескадрон].[7]
            якщо (рівень1.[ескадрон].[5]=1) тоді
               створити_ворогів_зліва()
            інакше
               створити_ворогів_справа()         
            ескадрон <- ескадрон + 1
                 
         якщо (ЧасІгри > 4000) тоді
            Фігури.Перемістити(Фігури.ДодатиЗображення(``кінець``), 230,200)
            Програма.Затримка(5000)
            Програма.Закінчити()     
         lock кулиСінхр (фун () ->  
            переміститиусе()
         )

         ГрафичнеВікно.МишаПереміщена <- Callback(НаРухМиші)
         ГрафичнеВікно.МишаДонизу <- Callback(НаНажаттяМиші)

         ПостарітиКулю_Гравця()

та НаРухМиші () =
   ракеткаX <- int ГрафичнеВікно.МишаX - розмір_ігрока / 2
   ракеткаY <- int ГрафичнеВікно.МишаY - розмір_ігрока

   якщо (ракеткаX < 0) тоді
      ракеткаX <- 0   
   Фігури.Перемістити(ігрок, ракеткаX , ракеткаY )

та НаНажаттяМиші () =
   ПострілX <- ГрафичнеВікно.МишаX - 15.0 // in order to be from the neck of the plane
   ВыстрелY <- ГрафичнеВікно.МишаY - 80.0
   Вогонь()

та переміститиусе () =
   інккx <- 0.0
   інккy <- 0.0
   ГрафичнеВікно.Заголовок <- заголовокГри + рахунок.ToString() + " Життя:" + Життя_Гравця.ToString()

   якщо (ракеткаX > (ширинаГри-62) ) тоді
      інкx <- інкx - швф
      інккx <- інккx - float швф
      для i=1 до кількістьостровів зробити
         інкострівx.[i] <- інкострівx.[i] - швф    
      якщо (інкx = -32 ) тоді
         інкx <- 0
   якщо (ракеткаX < 64 ) тоді
      інкx <- інкx + швф
      інккx <- інккx + float швф
      для i=1 до кількістьостровів зробити
         інкострівx.[i] <- інкострівx.[i] + швф
      якщо (інкx = 32 ) тоді
         інкx <- 0
   Фігури.Перемістити(фон,інкx - 32 ,інкy - 32)

   для i=1 до кількістьостровів зробити
      нехай острx = позx.[i]+інкострівx.[i]
      нехай острy = позy.[i]+інкострівy.[i]
      Фігури.Перемістити(масив_Островів.[i],острx,острy)

   інкy <- інкy + швф
   інккy <- інккy + float швф
   для i=1 до кількістьостровів зробити
      інкострівy.[i] <- інкострівy.[i] + швф    

   if (інкy = 32) тоді
      інкy <- 0   

   для i=1 до кількістьостровів зробити
      якщо ((позy.[i]+інкострівy.[i]) > (висотаГри+15)) тоді // relaunch island if no more visible
         нехай R = int (Математика.Округляти(float (Математика.ОтриматиВипадковеЧисло(клкостровів))))
         нехай AA = Математика.Залишок(ЧасІгри,6)
         // give new coordinates
         позx.[i] <- позОстровів.[AA].[2]
         позy.[i] <- позОстровів.[AA].[3]
         Фігури.Перемістити(масив_Островів.[R],позx.[i],позy.[i])
         інкострівy.[i] <- 0
         інкострівx.[i] <- 0         
   // Перемістити пули игрока
   для i = 1 до Гравець_КількістьКуль зробити
      нехай имяФигуры = Кули_Гравця.[i]
      нехай Пуля_Игрокаx = Фігури.ОтриматиЛіво(имяФигуры) + інккx
      нехай Пуля_Игрокаy = Фігури.ОтриматиВерх(имяФигуры) - ШвидкістьКули_Ігрока
      Фігури.Перемістити(имяФигуры, Пуля_Игрокаx, Пуля_Игрокаy)
      нехай старийВік = ВікКули_Гравця.GetOrDefault(i, 0)
      ВікКули_Гравця.[i] <- старийВік + 1
   // Перемістити пули врага
   для iea = 1 до КількістьКуль_Ворога зробити
      нехай dx = (Математика.Син((Кут_Куль_Ворога.[iea] )) * float Швидкість_КульВорога)
      нехай dy = (Математика.Кос((Кут_Куль_Ворога.[iea] )) * float Швидкість_КульВорога)
      нехай Куля_Ворогаx = Фігури.ОтриматиЛіво(Кули_Ворога.[iea]) + dx + інккx
      нехай Куля_Ворогаy = Фігури.ОтриматиВерх(Кули_Ворога.[iea]) + dy + інккy * 0.1
      Фігури.Перемістити(Кули_Ворога.[iea], Куля_Ворогаx, Куля_Ворогаy)
      нехай старийВік =
         відповідає ВікКулі_Ворога.TryGetValue(iea) із
         | true, n -> n
         | false, _ -> 0
      ВікКулі_Ворога.[iea] <- старийВік + 1

   // move ennemies
   нехай змінливий i=1
   доки i <= кількість_Ворога зробити
      // move as TimeLine and Path say
      нехай вNBR = ворог_ШляхNBR.[i]
      нехай змінливий uu = лінія_ворогів.[i]
      нехай Час = час_Ворогів.[i]
      нехай etl = шляхВорога.[вNBR].[1].GetOrDefault(uu, 0.0)  //enemy own timeLine
      якщо (Час=etl) тоді  //время повернуть врага
         нехай rr = шляхВорога.[вNBR].[2].GetOrDefault(uu+1, 0.0)            
         Фігури.Повернути(массив_Ворогів.[i],rr)
      якщо (Час > etl)  тоді
         uu <- uu+1
         лінія_ворогів.[i] <- uu    // следующая линия для передвижения врага      
      нехай xx1 = позX_Ворога.[i]
      нехай yy1 = позY_Ворога.[i]
      нехай xx = float xx1+шляхВорога.[вNBR].[3].GetOrDefault(uu, 0.0)+інккx
      нехай yy = float yy1+шляхВорога.[вNBR].[4].GetOrDefault(uu, 0.0)+інккy*0.1
      // Случайные выстрелы врага
      якщо (Математика.ОтриматиВипадковеЧисло(Ворог_Агрессивність)=1) тоді
         Постріл_ВорогаX <- xx1 + 16
         Постріл_ВорогаY <- yy1 + 4
         якщо (yy1 > 0 && xx1 > 0 && yy1 < висотаГри && xx1 < ширинаГри) тоді
            // это избегает выстрелы врага изза экрана
            постріл_Ворога()

      Фігури.Перемістити(массив_Ворогів.[i],xx,yy)
      позX_Ворога.[i] <- int xx
      позY_Ворога.[i] <- int yy
      час_Ворогів.[i] <- Час + 1.0
      якщо ((float uu > шляхВорога.[вNBR].[0].[0]) && (Час > etl)) тоді // if last timelife remove the enemy sprite 
         нехай наступний_видаляемий_ворог = i
         видалити_ворога(наступний_видаляемий_ворог)      
      
      Зіткнення_ипв()
      Зіткнення_ви()

      i <- i + 1
      
та ВидалитиКулю_Гравця (player_Ammo_nextRemove) =
   Фігури.Видалити(Кули_Гравця.[player_Ammo_nextRemove])
   для iz = player_Ammo_nextRemove до Гравець_КількістьКуль - 1 зробити
       Кули_Гравця.[iz] <- Кули_Гравця.[iz+1]
       ВікКули_Гравця.[iz] <- ВікКули_Гравця.[iz+1]
   Кули_Гравця.Remove(Гравець_КількістьКуль) |> ignore
   ВікКули_Гравця.Remove(Гравець_КількістьКуль) |> ignore
   Гравець_КількістьКуль <- Гравець_КількістьКуль - 1

та ВидалитиКулю_Ворога (enemy_Ammo_nextRemove) =
   Фігури.Видалити(Кули_Ворога.[enemy_Ammo_nextRemove])
   для irea = enemy_Ammo_nextRemove до КількістьКуль_Ворога - 1 зробити
       Кули_Ворога.[irea] <- Кули_Ворога.[irea+1]      
       ВікКулі_Ворога.[irea] <-
         якщо (irea+1) < ВікКулі_Ворога.Count тоді ВікКулі_Ворога.[irea+1] інакше 0
       Кут_Куль_Ворога.[irea] <- Кут_Куль_Ворога.[irea+1]
   Кули_Ворога.Remove(КількістьКуль_Ворога) |> ignore
   ВікКулі_Ворога.Remove(КількістьКуль_Ворога) |> ignore
   Кут_Куль_Ворога.Remove(КількістьКуль_Ворога) |> ignore
   КількістьКуль_Ворога <- КількістьКуль_Ворога - 1

та Вогонь () =
   lock кулиСінхр (фун () -> 
      // Remove additional player Ammo
      доки (Гравець_КількістьКуль > Ігрок_МаксКуль ) зробити
         ВидалитиКулю_Гравця(1)

      // Add the player Ammo
      Гравець_КількістьКуль <- Гравець_КількістьКуль + 1
      Кули_Гравця.[Гравець_КількістьКуль] <- Фігури.ДодатиЗображення(куля0)
      Фігури.Перемістити(Кули_Гравця.[Гравець_КількістьКуль], ПострілX, ВыстрелY)
   )

та постріл_Ворога () =
   // Remove additional Enemy Ammo
   доки (КількістьКуль_Ворога > (Ворог_МаксКуль - 1)) зробити      
      ВидалитиКулю_Ворога(1)

   // Add the Enemy Ammo
   КількістьКуль_Ворога <- КількістьКуль_Ворога + 1
   Кули_Ворога.[КількістьКуль_Ворога] <- Фігури.ДодатиЗображення(Ворожа_куля)
   Кут_Куль_Ворога.[КількістьКуль_Ворога] <- Математика.АркТан(float(ракеткаX- Постріл_ВорогаX+розмір_ігрока/2)/float(ракеткаY-Постріл_ВорогаY))
   нехай фігура = Кули_Ворога.[КількістьКуль_Ворога]
   Фігури.Перемістити(фігура, Постріл_ВорогаX, Постріл_ВорогаY)

//Check playerammo age
та ПостарітиКулю_Гравця () =
   доки (ВікКули_Гравця.Count > 0 && ВікКули_Гравця.[1] > Ігрок_ЖиттяСнаряда) зробити
      ВидалитиКулю_Гравця(1)  

// Check enemy ammo age
та ПостарітиКулю_Ворога () =
   доки (ВікКулі_Ворога.Count > 0 && ВікКулі_Ворога.[1] > Ворог_ЖиттяСнаряда) зробити
      ВидалитиКулю_Ворога(1)

та видалити_ворога (next_enemy_remove) =
   Фігури.Видалити(массив_Ворогів.[next_enemy_remove])
   // Remove all references from the arrays
   для ii = next_enemy_remove до кількість_Ворога - 1 зробити
      массив_Ворогів.[ii] <- массив_Ворогів.[ii+1]
      лінія_ворогів.[ii] <- лінія_ворогів.[ii+1]
      позX_Ворога.[ii] <- позX_Ворога.[ii+1]
      позY_Ворога.[ii] <- позY_Ворога.[ii+1]
      час_Ворогів.[ii] <- час_Ворогів.[ii+1]
      ворог_ШляхNBR.[ii] <- ворог_ШляхNBR.[ii+1]
   массив_Ворогів.Remove(кількість_Ворога) |> ignore
   лінія_ворогів.Remove(кількість_Ворога) |> ignore
   позX_Ворога.Remove(кількість_Ворога) |> ignore
   позY_Ворога.Remove(кількість_Ворога) |> ignore
   час_Ворогів.Remove(кількість_Ворога) |> ignore
   ворог_ШляхNBR.Remove(кількість_Ворога) |> ignore
   кількість_Ворога <- кількість_Ворога - 1

та створити_ворогів_зліва () =

   нехай змінливий Хронометраж1 = 0.0
   для i=1 до ном_Ворога зробити
      кількість_Ворога <- кількість_Ворога + 1
      ворог_ШляхNBR.[кількість_Ворога] <- шляхNBR
      якщо (тип_ворога = 2) тоді
         массив_Ворогів.[кількість_Ворога] <- Фігури.ДодатиЗображення(ворог2)
      інакше
         массив_Ворогів.[кількість_Ворога] <- Фігури.ДодатиЗображення(ворог)
      лінія_ворогів.[кількість_Ворога] <- 1
      позX_Ворога.[кількість_Ворога] <- позВорогаX1
      позY_Ворога.[кількість_Ворога] <- позВорогаY1
      час_Ворогів.[кількість_Ворога] <- Хронометраж1

      позВорогаX1 <- позВорогаX1 - 64  // distance between ennemies
      Хронометраж1 <- Хронометраж1 - 64.0 / float швидкість_ворогів   
   для i=(кількість_Ворога-ном_Ворога+1) до кількість_Ворога зробити
      нехай xxx = позX_Ворога.[i]
      нехай yyy = позY_Ворога.[i]
      Фігури.Перемістити(массив_Ворогів.[i],xxx,yyy)

та створити_ворогів_справа () =

   нехай змінливий Хронометраж1 = 0.0
   для i=1 до ном_Ворога зробити
      кількість_Ворога <- кількість_Ворога + 1
      ворог_ШляхNBR.[кількість_Ворога] <- шляхNBR
      массив_Ворогів.[кількість_Ворога] <- Фігури.ДодатиЗображення(ворог)
      лінія_ворогів.[кількість_Ворога] <- 1
      позX_Ворога.[кількість_Ворога] <- позВорогаX1
      позY_Ворога.[кількість_Ворога] <- позВорогаY1
      час_Ворогів.[кількість_Ворога] <- float Хронометраж1

      позВорогаX1 <- позВорогаX1 + 64 // distance between ennemies
      Хронометраж1 <- Хронометраж1 - 64.0 / швидкість_ворогів
         
   для i=(кількість_Ворога-ном_Ворога+1) до кількість_Ворога зробити
      нехай xxx=позX_Ворога.[i]
      нехай yyy=позY_Ворога.[i]
      Фігури.Перемістити(массив_Ворогів.[i],xxx,yyy)
   
та Зіткнення_ипв () =  // для пуль-игрока и врагов

   нехай змінливий i1 = 1
   доки i1 <= Гравець_КількістьКуль зробити
      // позиція кулі ігрока
      нехай назваФігури = Кули_Гравця.[i1]
      нехай Player_Ammox = int (Фігури.ОтриматиЛіво(назваФігури))
      нехай Player_Ammoy = int (Фігури.ОтриматиВерх(назваФігури))
      нехай px1=Player_Ammox+розмір_кулі_ігрока/3   // щоб отримати більш точне зіткнення, ніж розмір зображення кулі
      нехай py1=Player_Ammoy+розмір_кулі_ігрока/3
      нехай px2=px1+2*розмір_кулі_ігрока/3
      нехай py2=py1+2*розмір_кулі_ігрока/3

      нехай змінливий куліВидалені = false
      нехай змінливий i2 = 1
      доки i2 <= кількість_Ворога зробити
         // позиція ворога
         нехай ax1=позX_Ворога.[i2]+розмір_ворога/4
         нехай ay1=позY_Ворога.[i2]+розмір_ворога/4

         нехай ax2=ax1+3*розмір_ворога/4
         нехай ay2=ay1+3*розмір_ворога/4

         якщо ( (ax1 < px1 && ax2 > px1) || (ax1 < px2 && ax2 > px2) ) тоді
            якщо ( (ay1 < py1 && ay2 > py1) || (ay1 < py2 && ay2 > py2) ) тоді
               // зіткнення між ворогом nbr i2 та кулею гравця i
               // видалити кулю i та анімувати вибух і видалити ворога i2
               якщо not куліВидалені тоді 
                  ВидалитиКулю_Гравця(i1)
                  куліВидалені <- true
               нехай наступний_видаляемий_ворог = i2
               видалити_ворога(наступний_видаляемий_ворог)
               // begin animation for explosion at coordinate ax1, ay1
               нехай toto = Фігури.ДодатиЗображення(вибух_ворога1)
               Фігури.Перемістити(toto,ax1,ay1)
               Програма.Затримка(30)
               Фігури.Видалити(toto)
               нехай toto = Фігури.ДодатиЗображення(вибух_ворога2)
               Фігури.Перемістити(toto,ax1,ay1)
               Програма.Затримка(30)
               Фігури.Видалити(toto)
               рахунок <- рахунок + 100

         i2 <- i2 + 1

      
      i1 <- i1 + 1

та Зіткнення_ви () =   // для врагов и игрока 
   нехай px1 = int (Фігури.ОтриматиЛіво(ігрок))
   нехай py1 = int (Фігури.ОтриматиВерх(ігрок))
   нехай px2 = px1 + розмір_ігрока
   нехай py2 = py1 + розмір_ігрока

   //Фігури.Move(Фігури.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   нехай змінливий i2 = 1
   доки i2 <= кількість_Ворога зробити
      // позиция врага
      нехай ax1=позX_Ворога.[i2]
      нехай ay1=позY_Ворога.[i2]

      нехай ax2=ax1+розмір_ворога
      нехай ay2=ay1+розмір_ворога
      //Фігури.Move(Фігури.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      якщо ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) тоді
         якщо ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) тоді
            // collision between enemy nbr i2 and player 
            // animate explosion and decrease lives            
            видалити_ворога(i2)
            // begin animation for explosion at coordinate ax1, ay1
            нехай toto = Фігури.ДодатиЗображення(вибух_ворога1)
            Фігури.Перемістити(toto,ax1,ay1)
            Програма.Затримка(30)
            Фігури.Видалити(toto)
            нехай toto = Фігури.ДодатиЗображення(вибух_ігрока)
            Фігури.Перемістити(toto,ax1,ay1)
            Програма.Затримка(300)
            Фігури.Видалити(toto)
            Життя_Гравця <- Життя_Гравця - 1
            якщо (Життя_Гравця = 0) тоді
               Програма.Закінчити()

      i2 <- i2 + 1

   нехай px1 = ракеткаX
   нехай py1 = ракеткаY
   нехай px2 = px1 + розмір_ігрока
   нехай py2 = py1 + розмір_ігрока
   // Фігури.Move(Фігури.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   
   нехай змінливий i3 = 1
   доки i3 <= КількістьКуль_Ворога зробити
      // позиция врага 

      нехай ax1=int (Фігури.ОтриматиЛіво(Кули_Ворога.[i3]))
      нехай ay1=int (Фігури.ОтриматиВерх(Кули_Ворога.[i3]))

      нехай ax2=ax1+розмір_куль_ворога
      нехай ay2=ay1+розмір_куль_ворога
      //Фігури.Move(Фігури.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      якщо ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) тоді
         якщо ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) тоді
            // collision between enemy ammo nbr i3 and player 
            // animate explosion and decrease lives
            ВидалитиКулю_Ворога(i3)

            // begin animation for explosion at coordinate ax1, ay1
            нехай toto = Фігури.ДодатиЗображення(вибух_ворога1)
            Фігури.Перемістити(toto,ракеткаX+ розмір_ігрока/2,ракеткаY+ розмір_ігрока/2)
            Програма.Затримка(30)
            Фігури.Видалити(toto)
            нехай toto = Фігури.ДодатиЗображення(вибух_ігрока)
            Фігури.Перемістити(toto,ракеткаX+ розмір_ігрока/2,ракеткаY+ розмір_ігрока/2)
            Програма.Затримка(300)
            Фігури.Видалити(toto)
            Життя_Гравця <- Життя_Гравця - 1
            якщо (Життя_Гравця = 0) тоді
               Програма.Закінчити()

      i3 <- i3 + 1

та ПозиціїОстровів () =
   // island positions, avoid randomGeneration and islands overlap
   позОстровів.[0] <- Словник()
   позОстровів.[0].[1] <- 1
   позОстровів.[0].[2] <- 0
   позОстровів.[0].[3] <- -150
   позОстровів.[1] <- Словник()
   позОстровів.[1].[1] <- 1
   позОстровів.[1].[2] <- - int (Математика.Округляти(float ширинаГри/2.0))
   позОстровів.[1].[3] <- -150
   позОстровів.[2] <- Словник()
   позОстровів.[2].[1] <- 2
   позОстровів.[2].[2] <- -2 * int (Математика.Округляти(float ширинаГри/3.0))
   позОстровів.[2].[3] <- -150
   позОстровів.[3] <- Словник()
   позОстровів.[3].[1] <- 1
   позОстровів.[3].[2] <- 2 * int (Математика.Округляти(float ширинаГри/3.0))
   позОстровів.[3].[3] <- -150
   позОстровів.[4] <- Словник()
   позОстровів.[4].[1] <- 2
   позОстровів.[4].[2] <- ширинаГри
   позОстровів.[4].[3] <- -150
   позОстровів.[5] <- Словник()
   позОстровів.[5].[1] <- 3
   позОстровів.[5].[2] <- int (Математика.Округляти(float ширинаГри/3.0))
   позОстровів.[5].[3] <- -150
   позОстровів.[6] <- Словник()
   позОстровів.[6].[1] <- 3
   позОстровів.[6].[2] <- -ширинаГри
   позОстровів.[6].[3] <- -150

та визначити_шляхи () =
   для i = 0 до 6 зробити
      шляхВорога.[i] <- Словник()
      для j = 0 до 4 зробити 
         шляхВорога.[i].[j] <- Словник()

   шляхВорога.[0].[0].[0] <- 3.   // nbr of strait lines of path
   шляхВорога.[0].[1].[1] <- 30.  // from 0 to this in timeline
   шляхВорога.[0].[1].[2] <- 100. // from this to next in timeline
   шляхВорога.[0].[1].[3] <- 400. // sprite goes up

   шляхВорога.[0].[2].[1] <- 0.   // first line rotation = 0
   шляхВорога.[0].[2].[2] <- 45.  // second line rotation = 45
   шляхВорога.[0].[2].[3] <- 45.

   шляхВорога.[0].[3].[1] <- швидкість_ворогів // first line x movment
   шляхВорога.[0].[3].[2] <- швидкість_ворогів // second line x movment
   шляхВорога.[0].[3].[3] <- швидкість_ворогів // third line ...

   шляхВорога.[0].[4].[1] <- 0. // first line y movment
   шляхВорога.[0].[4].[2] <- швидкість_ворогів
   шляхВорога.[0].[4].[3] <- швидкість_ворогів
   // ---------- second pat
   шляхВорога.[1].[0].[0] <- 4.
   шляхВорога.[1].[1].[1] <- 1.
   шляхВорога.[1].[1].[2] <- 1.
   шляхВорога.[1].[1].[3] <- 100.
   шляхВорога.[1].[1].[4] <- 400.

   шляхВорога.[1].[2].[1] <- 180.
   шляхВорога.[1].[2].[2] <- 135.
   шляхВорога.[1].[2].[3] <- 135.
   шляхВорога.[1].[2].[4] <- 90.

   шляхВорога.[1].[3].[1] <- -швидкість_ворогів
   шляхВорога.[1].[3].[2] <- -швидкість_ворогів
   шляхВорога.[1].[3].[3] <- -швидкість_ворогів
   шляхВорога.[1].[3].[4] <- 0.

   шляхВорога.[1].[4].[1] <- 0.
   шляхВорога.[1].[4].[2] <- 0.
   шляхВорога.[1].[4].[3] <- швидкість_ворогів
   шляхВорога.[1].[4].[4] <- швидкість_ворогів
   // round r=5
   шляхВорога.[2].[0].[0] <- 21.
   шляхВорога.[2].[1].[1] <- 50.
   шляхВорога.[2].[1].[2] <- 55.
   шляхВорога.[2].[1].[3] <- 60.
   шляхВорога.[2].[1].[4] <- 65.
   шляхВорога.[2].[1].[5] <- 70.
   шляхВорога.[2].[1].[6] <- 75.
   шляхВорога.[2].[1].[7] <- 80.
   шляхВорога.[2].[1].[8] <- 85.
   шляхВорога.[2].[1].[9] <- 90.
   шляхВорога.[2].[1].[10] <- 95.
   шляхВорога.[2].[1].[11] <- 100.
   шляхВорога.[2].[1].[12] <- 105.
   шляхВорога.[2].[1].[13] <- 110.
   шляхВорога.[2].[1].[14] <- 115.
   шляхВорога.[2].[1].[15] <- 120.
   шляхВорога.[2].[1].[16] <- 125.
   шляхВорога.[2].[1].[17] <- 130.
   шляхВорога.[2].[1].[18] <- 135.
   шляхВорога.[2].[1].[19] <- 140.
   шляхВорога.[2].[1].[20] <- 145.
   шляхВорога.[2].[1].[21] <-350.
   шляхВорога.[2].[2].[1] <- 0.
   шляхВорога.[2].[2].[2] <- 18.
   шляхВорога.[2].[2].[3] <- 36.
   шляхВорога.[2].[2].[4] <- 54.
   шляхВорога.[2].[2].[5] <- 72.
   шляхВорога.[2].[2].[6] <- 90.
   шляхВорога.[2].[2].[7] <- 108.
   шляхВорога.[2].[2].[8] <- 126.
   шляхВорога.[2].[2].[9] <- 144.
   шляхВорога.[2].[2].[10] <- 162.
   шляхВорога.[2].[2].[11] <- 180.
   шляхВорога.[2].[2].[12] <- 198.
   шляхВорога.[2].[2].[13] <- 216.
   шляхВорога.[2].[2].[14] <- 234.
   шляхВорога.[2].[2].[15] <- 252.
   шляхВорога.[2].[2].[16] <- -90.
   шляхВорога.[2].[2].[17] <- -72.
   шляхВорога.[2].[2].[18] <- -54.
   шляхВорога.[2].[2].[19] <- -36.
   шляхВорога.[2].[2].[20] <- -18.
   шляхВорога.[2].[2].[21] <- 0.
   шляхВорога.[2].[3].[1] <- швидкість_ворогів
   шляхВорога.[2].[3].[2] <- 0.95*швидкість_ворогів
   шляхВорога.[2].[3].[3] <- 0.81*швидкість_ворогів
   шляхВорога.[2].[3].[4] <- 0.59*швидкість_ворогів
   шляхВорога.[2].[3].[5] <- 0.31*швидкість_ворогів
   шляхВорога.[2].[3].[6] <- 0.
   шляхВорога.[2].[3].[7] <- -0.31*швидкість_ворогів
   шляхВорога.[2].[3].[8] <- -0.59*швидкість_ворогів
   шляхВорога.[2].[3].[9] <- -0.81*швидкість_ворогів
   шляхВорога.[2].[3].[10] <- -0.95*швидкість_ворогів
   шляхВорога.[2].[3].[11] <- -швидкість_ворогів
   шляхВорога.[2].[3].[12] <- -0.95*швидкість_ворогів
   шляхВорога.[2].[3].[13] <- -0.81*швидкість_ворогів
   шляхВорога.[2].[3].[14] <- -0.59*швидкість_ворогів
   шляхВорога.[2].[3].[15] <- -0.31*швидкість_ворогів
   шляхВорога.[2].[3].[16] <- 0.
   шляхВорога.[2].[3].[17] <- 0.31*швидкість_ворогів
   шляхВорога.[2].[3].[18] <- 0.59*швидкість_ворогів
   шляхВорога.[2].[3].[19] <- 0.81*швидкість_ворогів
   шляхВорога.[2].[3].[20] <- 0.95*швидкість_ворогів
   шляхВорога.[2].[3].[21] <- швидкість_ворогів
   шляхВорога.[2].[4].[1] <- 0.
   шляхВорога.[2].[4].[2] <- 0.31*швидкість_ворогів
   шляхВорога.[2].[4].[3] <- 0.59*швидкість_ворогів
   шляхВорога.[2].[4].[4] <- 0.81*швидкість_ворогів
   шляхВорога.[2].[4].[5] <- 0.95*швидкість_ворогів
   шляхВорога.[2].[4].[6] <- швидкість_ворогів
   шляхВорога.[2].[4].[7] <- 0.95*швидкість_ворогів
   шляхВорога.[2].[4].[8] <- 0.81*швидкість_ворогів
   шляхВорога.[2].[4].[9] <- 0.59*швидкість_ворогів
   шляхВорога.[2].[4].[10] <- 0.31*швидкість_ворогів
   шляхВорога.[2].[4].[11] <- 0.
   шляхВорога.[2].[4].[12] <- -0.31*швидкість_ворогів
   шляхВорога.[2].[4].[13] <- -0.59*швидкість_ворогів
   шляхВорога.[2].[4].[14] <- -0.81*швидкість_ворогів
   шляхВорога.[2].[4].[15] <- -0.95*швидкість_ворогів
   шляхВорога.[2].[4].[16] <- -швидкість_ворогів
   шляхВорога.[2].[4].[17] <- -0.95*швидкість_ворогів
   шляхВорога.[2].[4].[18] <- -0.81*швидкість_ворогів
   шляхВорога.[2].[4].[19] <- -0.59*швидкість_ворогів
   шляхВорога.[2].[4].[20] <- -0.31*швидкість_ворогів
   шляхВорога.[2].[4].[21] <- 0.
   // round r=20
   шляхВорога.[3].[0].[0] <- 21.
   шляхВорога.[3].[1].[1] <- 120.
   шляхВорога.[3].[1].[2] <- 140.
   шляхВорога.[3].[1].[3] <- 160.
   шляхВорога.[3].[1].[4] <- 180.
   шляхВорога.[3].[1].[5] <- 200.
   шляхВорога.[3].[1].[6] <- 220.
   шляхВорога.[3].[1].[7] <- 240.
   шляхВорога.[3].[1].[8] <- 260.
   шляхВорога.[3].[1].[9] <- 280.
   шляхВорога.[3].[1].[10] <- 300.
   шляхВорога.[3].[1].[11] <- 320.
   шляхВорога.[3].[1].[12] <- 340.
   шляхВорога.[3].[1].[13] <- 360.
   шляхВорога.[3].[1].[14] <- 380.
   шляхВорога.[3].[1].[15] <- 400.
   шляхВорога.[3].[1].[16] <- 420.
   шляхВорога.[3].[1].[17] <- 440.
   шляхВорога.[3].[1].[18] <- 460.
   шляхВорога.[3].[1].[19] <- 480.
   шляхВорога.[3].[1].[20] <- 500.
   шляхВорога.[3].[1].[21] <- 600.
   шляхВорога.[3].[2].[1] <- 0.
   шляхВорога.[3].[2].[2] <- 18.
   шляхВорога.[3].[2].[3] <- 36.
   шляхВорога.[3].[2].[4] <- 54.
   шляхВорога.[3].[2].[5] <- 72.
   шляхВорога.[3].[2].[6] <- 90.
   шляхВорога.[3].[2].[7] <- 108.
   шляхВорога.[3].[2].[8] <- 126.
   шляхВорога.[3].[2].[9] <- 144.
   шляхВорога.[3].[2].[10] <- 162.
   шляхВорога.[3].[2].[11] <- 180.
   шляхВорога.[3].[2].[12] <- 198.
   шляхВорога.[3].[2].[13] <- 216.
   шляхВорога.[3].[2].[14] <- 234.
   шляхВорога.[3].[2].[15] <- 252.
   шляхВорога.[3].[2].[16] <- -90.
   шляхВорога.[3].[2].[17] <- -72.
   шляхВорога.[3].[2].[18] <- -54.
   шляхВорога.[3].[2].[19] <- -36.
   шляхВорога.[3].[2].[20] <- -18.
   шляхВорога.[3].[2].[21] <- 0.
   шляхВорога.[3].[3].[1] <- швидкість_ворогів
   шляхВорога.[3].[3].[2] <- 0.95*швидкість_ворогів
   шляхВорога.[3].[3].[3] <- 0.81*швидкість_ворогів
   шляхВорога.[3].[3].[4] <- 0.59*швидкість_ворогів
   шляхВорога.[3].[3].[5] <- 0.31*швидкість_ворогів
   шляхВорога.[3].[3].[6] <- 0.
   шляхВорога.[3].[3].[7] <- -0.31*швидкість_ворогів
   шляхВорога.[3].[3].[8] <- -0.59*швидкість_ворогів
   шляхВорога.[3].[3].[9] <- -0.81*швидкість_ворогів
   шляхВорога.[3].[3].[10] <- -0.95*швидкість_ворогів
   шляхВорога.[3].[3].[11] <- -швидкість_ворогів
   шляхВорога.[3].[3].[12] <- -0.95*швидкість_ворогів
   шляхВорога.[3].[3].[13] <- -0.81*швидкість_ворогів
   шляхВорога.[3].[3].[14] <- -0.59*швидкість_ворогів
   шляхВорога.[3].[3].[15] <- -0.31*швидкість_ворогів
   шляхВорога.[3].[3].[16] <- 0.
   шляхВорога.[3].[3].[17] <- 0.31*швидкість_ворогів
   шляхВорога.[3].[3].[18] <- 0.59*швидкість_ворогів
   шляхВорога.[3].[3].[19] <- 0.81*швидкість_ворогів
   шляхВорога.[3].[3].[20] <- 0.95*швидкість_ворогів
   шляхВорога.[3].[3].[21] <- швидкість_ворогів
   шляхВорога.[3].[4].[1] <- 0.
   шляхВорога.[3].[4].[2] <- 0.31*швидкість_ворогів
   шляхВорога.[3].[4].[3] <- 0.59*швидкість_ворогів
   шляхВорога.[3].[4].[4] <- 0.81*швидкість_ворогів
   шляхВорога.[3].[4].[5] <- 0.95*швидкість_ворогів
   шляхВорога.[3].[4].[6] <- швидкість_ворогів
   шляхВорога.[3].[4].[7] <- 0.95*швидкість_ворогів
   шляхВорога.[3].[4].[8] <- 0.81*швидкість_ворогів
   шляхВорога.[3].[4].[9] <- 0.59*швидкість_ворогів
   шляхВорога.[3].[4].[10] <- 0.31*швидкість_ворогів
   шляхВорога.[3].[4].[11] <- 0.
   шляхВорога.[3].[4].[12] <- -0.31*швидкість_ворогів
   шляхВорога.[3].[4].[13] <- -0.59*швидкість_ворогів
   шляхВорога.[3].[4].[14] <- -0.81*швидкість_ворогів
   шляхВорога.[3].[4].[15] <- -0.95*швидкість_ворогів
   шляхВорога.[3].[4].[16] <- -швидкість_ворогів
   шляхВорога.[3].[4].[17] <- -0.95*швидкість_ворогів
   шляхВорога.[3].[4].[18] <- -0.81*швидкість_ворогів
   шляхВорога.[3].[4].[19] <- -0.59*швидкість_ворогів
   шляхВорога.[3].[4].[20] <- -0.31*швидкість_ворогів
   шляхВорога.[3].[4].[21] <- 0.

   // round r=10
   шляхВорога.[4].[0].[0] <- 21.
   шляхВорога.[4].[1].[1] <- 110.
   шляхВорога.[4].[1].[2] <- 120.
   шляхВорога.[4].[1].[3] <- 130.
   шляхВорога.[4].[1].[4] <- 140.
   шляхВорога.[4].[1].[5] <- 150.
   шляхВорога.[4].[1].[6] <- 160.
   шляхВорога.[4].[1].[7] <- 170.
   шляхВорога.[4].[1].[8] <- 180.
   шляхВорога.[4].[1].[9] <- 190.
   шляхВорога.[4].[1].[10] <- 200.
   шляхВорога.[4].[1].[11] <- 210.
   шляхВорога.[4].[1].[12] <- 220.
   шляхВорога.[4].[1].[13] <- 230.
   шляхВорога.[4].[1].[14] <- 240.
   шляхВорога.[4].[1].[15] <- 250.
   шляхВорога.[4].[1].[16] <- 260.
   шляхВорога.[4].[1].[17] <- 270.
   шляхВорога.[4].[1].[18] <- 280.
   шляхВорога.[4].[1].[19] <- 290.
   шляхВорога.[4].[1].[20] <- 300.
   шляхВорога.[4].[1].[21] <- 500.
   шляхВорога.[4].[2].[1] <- 0.
   шляхВорога.[4].[2].[2] <- 18.
   шляхВорога.[4].[2].[3] <- 36.
   шляхВорога.[4].[2].[4] <- 54.
   шляхВорога.[4].[2].[5] <- 72.
   шляхВорога.[4].[2].[6] <- 90.
   шляхВорога.[4].[2].[7] <- 108.
   шляхВорога.[4].[2].[8] <- 126.
   шляхВорога.[4].[2].[9] <- 144.
   шляхВорога.[4].[2].[10] <- 162.
   шляхВорога.[4].[2].[11] <- 180.
   шляхВорога.[4].[2].[12] <- 198.
   шляхВорога.[4].[2].[13] <- 216.
   шляхВорога.[4].[2].[14] <- 234.
   шляхВорога.[4].[2].[15] <- 252.
   шляхВорога.[4].[2].[16] <- -90.
   шляхВорога.[4].[2].[17] <- -72.
   шляхВорога.[4].[2].[18] <- -54.
   шляхВорога.[4].[2].[19] <- -36.
   шляхВорога.[4].[2].[20] <- -18.
   шляхВорога.[4].[2].[21] <- 0.
   шляхВорога.[4].[3].[1] <- швидкість_ворогів
   шляхВорога.[4].[3].[2] <- 0.95*швидкість_ворогів
   шляхВорога.[4].[3].[3] <- 0.81*швидкість_ворогів
   шляхВорога.[4].[3].[4] <- 0.59*швидкість_ворогів
   шляхВорога.[4].[3].[5] <- 0.31*швидкість_ворогів
   шляхВорога.[4].[3].[6] <- 0.
   шляхВорога.[4].[3].[7] <- -0.31*швидкість_ворогів
   шляхВорога.[4].[3].[8] <- -0.59*швидкість_ворогів
   шляхВорога.[4].[3].[9] <- -0.81*швидкість_ворогів
   шляхВорога.[4].[3].[10] <- -0.95*швидкість_ворогів
   шляхВорога.[4].[3].[11] <- -швидкість_ворогів
   шляхВорога.[4].[3].[12] <- -0.95*швидкість_ворогів
   шляхВорога.[4].[3].[13] <- -0.81*швидкість_ворогів
   шляхВорога.[4].[3].[14] <- -0.59*швидкість_ворогів
   шляхВорога.[4].[3].[15] <- -0.31*швидкість_ворогів
   шляхВорога.[4].[3].[16] <- 0.
   шляхВорога.[4].[3].[17] <- 0.31*швидкість_ворогів
   шляхВорога.[4].[3].[18] <- 0.59*швидкість_ворогів
   шляхВорога.[4].[3].[19] <- 0.81*швидкість_ворогів
   шляхВорога.[4].[3].[20] <- 0.95*швидкість_ворогів
   шляхВорога.[4].[3].[21] <- швидкість_ворогів
   шляхВорога.[4].[4].[1] <- 0.
   шляхВорога.[4].[4].[2] <- 0.31*швидкість_ворогів
   шляхВорога.[4].[4].[3] <- 0.59*швидкість_ворогів
   шляхВорога.[4].[4].[4] <- 0.81*швидкість_ворогів
   шляхВорога.[4].[4].[5] <- 0.95*швидкість_ворогів
   шляхВорога.[4].[4].[6] <- швидкість_ворогів
   шляхВорога.[4].[4].[7] <- 0.95*швидкість_ворогів
   шляхВорога.[4].[4].[8] <- 0.81*швидкість_ворогів
   шляхВорога.[4].[4].[9] <- 0.59*швидкість_ворогів
   шляхВорога.[4].[4].[10] <- 0.31*швидкість_ворогів
   шляхВорога.[4].[4].[11] <- 0.
   шляхВорога.[4].[4].[12] <- -0.31*швидкість_ворогів
   шляхВорога.[4].[4].[13] <- -0.59*швидкість_ворогів
   шляхВорога.[4].[4].[14] <- -0.81*швидкість_ворогів
   шляхВорога.[4].[4].[15] <- -0.95*швидкість_ворогів
   шляхВорога.[4].[4].[16] <- -швидкість_ворогів
   шляхВорога.[4].[4].[17] <- -0.95*швидкість_ворогів
   шляхВорога.[4].[4].[18] <- -0.81*швидкість_ворогів
   шляхВорога.[4].[4].[19] <- -0.59*швидкість_ворогів
   шляхВорога.[4].[4].[20] <- -0.31*швидкість_ворогів
   шляхВорога.[4].[4].[21] <- 0.

   // round r=15 + exit down
   шляхВорога.[5].[0].[0] <- 27.
   шляхВорога.[5].[1].[1] <- 120.
   шляхВорога.[5].[1].[2] <- 125.
   шляхВорога.[5].[1].[3] <- 150.
   шляхВорога.[5].[1].[4] <- 165.
   шляхВорога.[5].[1].[5] <- 180.
   шляхВорога.[5].[1].[6] <- 195.
   шляхВорога.[5].[1].[7] <- 210.
   шляхВорога.[5].[1].[8] <- 225.
   шляхВорога.[5].[1].[9] <- 240.
   шляхВорога.[5].[1].[10] <- 255.
   шляхВорога.[5].[1].[11] <- 270.
   шляхВорога.[5].[1].[12] <- 285.
   шляхВорога.[5].[1].[13] <- 300.
   шляхВорога.[5].[1].[14] <- 315.
   шляхВорога.[5].[1].[15] <- 330.
   шляхВорога.[5].[1].[16] <- 345.
   шляхВорога.[5].[1].[17] <- 360.
   шляхВорога.[5].[1].[18] <- 375.
   шляхВорога.[5].[1].[19] <- 390.
   шляхВорога.[5].[1].[20] <- 405.
   шляхВорога.[5].[1].[21] <- 600.
   шляхВорога.[5].[1].[22] <- 615.
   шляхВорога.[5].[1].[23] <- 630.
   шляхВорога.[5].[1].[24] <- 645.
   шляхВорога.[5].[1].[25] <- 660.
   шляхВорога.[5].[1].[26] <- 675.
   шляхВорога.[5].[1].[27] <- 800.

   шляхВорога.[5].[2].[1] <- 0.
   шляхВорога.[5].[2].[2] <- 18.
   шляхВорога.[5].[2].[3] <- 36.
   шляхВорога.[5].[2].[4] <- 54.
   шляхВорога.[5].[2].[5] <- 72.
   шляхВорога.[5].[2].[6] <- 90.
   шляхВорога.[5].[2].[7] <- 108.
   шляхВорога.[5].[2].[8] <- 126.
   шляхВорога.[5].[2].[9] <- 144.
   шляхВорога.[5].[2].[10] <- 162.
   шляхВорога.[5].[2].[11] <- 180.
   шляхВорога.[5].[2].[12] <- 198.
   шляхВорога.[5].[2].[13] <- 216.
   шляхВорога.[5].[2].[14] <- 234.
   шляхВорога.[5].[2].[15] <- 252.
   шляхВорога.[5].[2].[16] <- -90.
   шляхВорога.[5].[2].[17] <- -72.
   шляхВорога.[5].[2].[18] <- -54.
   шляхВорога.[5].[2].[19] <- -36.
   шляхВорога.[5].[2].[20] <- -18.
   шляхВорога.[5].[2].[21] <- 0.

   шляхВорога.[5].[2].[22] <- 18.
   шляхВорога.[5].[2].[23] <- 36.
   шляхВорога.[5].[2].[24] <- 54.
   шляхВорога.[5].[2].[25] <- 72.
   шляхВорога.[5].[2].[26] <- 90.
   шляхВорога.[5].[2].[27] <- 90.


   шляхВорога.[5].[3].[1] <- швидкість_ворогів
   шляхВорога.[5].[3].[2] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[3].[3] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[3].[4] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[3].[5] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[3].[6] <- 0.
   шляхВорога.[5].[3].[7] <- -0.31*швидкість_ворогів
   шляхВорога.[5].[3].[8] <- -0.59*швидкість_ворогів
   шляхВорога.[5].[3].[9] <- -0.81*швидкість_ворогів
   шляхВорога.[5].[3].[10] <- -0.95*швидкість_ворогів
   шляхВорога.[5].[3].[11] <- -швидкість_ворогів
   шляхВорога.[5].[3].[12] <- -0.95*швидкість_ворогів
   шляхВорога.[5].[3].[13] <- -0.81*швидкість_ворогів
   шляхВорога.[5].[3].[14] <- -0.59*швидкість_ворогів
   шляхВорога.[5].[3].[15] <- -0.31*швидкість_ворогів
   шляхВорога.[5].[3].[16] <- 0.
   шляхВорога.[5].[3].[17] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[3].[18] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[3].[19] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[3].[20] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[3].[21] <- швидкість_ворогів
   шляхВорога.[5].[3].[22] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[3].[23] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[3].[24] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[3].[25] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[3].[26] <- 0.
   шляхВорога.[5].[3].[27] <- 0.

   шляхВорога.[5].[4].[1] <- 0.
   шляхВорога.[5].[4].[2] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[4].[3] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[4].[4] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[4].[5] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[4].[6] <- швидкість_ворогів
   шляхВорога.[5].[4].[7] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[4].[8] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[4].[9] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[4].[10] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[4].[11] <- 0.
   шляхВорога.[5].[4].[12] <- -0.31*швидкість_ворогів
   шляхВорога.[5].[4].[13] <- -0.59*швидкість_ворогів
   шляхВорога.[5].[4].[14] <- -0.81*швидкість_ворогів
   шляхВорога.[5].[4].[15] <- -0.95*швидкість_ворогів
   шляхВорога.[5].[4].[16] <- -швидкість_ворогів
   шляхВорога.[5].[4].[17] <- -0.95*швидкість_ворогів
   шляхВорога.[5].[4].[18] <- -0.81*швидкість_ворогів
   шляхВорога.[5].[4].[19] <- -0.59*швидкість_ворогів
   шляхВорога.[5].[4].[20] <- -0.31*швидкість_ворогів
   шляхВорога.[5].[4].[21] <- 0.
   шляхВорога.[5].[4].[22] <- 0.31*швидкість_ворогів
   шляхВорога.[5].[4].[23] <- 0.59*швидкість_ворогів
   шляхВорога.[5].[4].[24] <- 0.81*швидкість_ворогів
   шляхВорога.[5].[4].[25] <- 0.95*швидкість_ворогів
   шляхВорога.[5].[4].[26] <- швидкість_ворогів
   шляхВорога.[5].[4].[27] <- швидкість_ворогів

   шляхВорога.[6].[0].[0] <- 3.
   шляхВорога.[6].[1].[1] <- 1.
   шляхВорога.[6].[1].[2] <- 80.
   шляхВорога.[6].[1].[3] <- 200.
   шляхВорога.[6].[2].[1] <- 0.
   шляхВорога.[6].[2].[2] <- 90.
   шляхВорога.[6].[2].[3] <- -90.
   шляхВорога.[6].[3].[1] <- 0.
   шляхВорога.[6].[3].[2] <- 0.
   шляхВорога.[6].[3].[3] <- 0.
   шляхВорога.[6].[4].[1] <- 0.
   шляхВорога.[6].[4].[2] <- швидкість_ворогів
   шляхВорога.[6].[4].[3] <- -швидкість_ворогів


та створити_рівень1 () =  // this define the behavior of the différent squadron along the time play for level 1
   рівень1.[1] <- Словник()
   рівень1.[1].[1] <- 20    // when timeplay=level1[1][1]
   рівень1.[1].[2] <- 2    // lauch enemy with Path level1[1][2]
   рівень1.[1].[3] <- -10  // at x coordinate level1[1][3]
   рівень1.[1].[4] <- 0   // at y coordinate level1[1][4]
   рівень1.[1].[5] <- 1   // 1 for create enemy at the left side; 2 for the right side of screen
   рівень1.[1].[6] <- 4   // level[1][6] is the number of enemies
   рівень1.[1].[7] <- 1   // тип ворога
   рівень1.[2] <- Словник()
   рівень1.[2].[1] <- 80
   рівень1.[2].[2] <- 6
   рівень1.[2].[3] <- ширинаГри/2
   рівень1.[2].[4] <- -500
   рівень1.[2].[5] <- 1
   рівень1.[2].[6] <- 3
   рівень1.[2].[7] <- 1
   рівень1.[3] <- Словник()
   рівень1.[3].[1] <- 150
   рівень1.[3].[2] <- 0
   рівень1.[3].[3] <- -10
   рівень1.[3].[4] <- 0
   рівень1.[3].[5] <- 1
   рівень1.[3].[6] <- 6
   рівень1.[3].[7] <- 2
   рівень1.[4] <- Словник()
   рівень1.[4].[1] <- 280
   рівень1.[4].[2] <- 4
   рівень1.[4].[3] <- -10
   рівень1.[4].[4] <- 0
   рівень1.[4].[5] <- 1
   рівень1.[4].[6] <- 3
   рівень1.[4].[7] <- 2
   рівень1.[5] <- Словник()
   рівень1.[5].[1] <- 410
   рівень1.[5].[2] <- 6
   рівень1.[5].[3] <- ширинаГри/3
   рівень1.[5].[4] <- -50
   рівень1.[5].[5] <- 1
   рівень1.[5].[6] <- 3
   рівень1.[5].[7] <- 1
   рівень1.[6] <- Словник()
   рівень1.[6].[1] <- 430
   рівень1.[6].[2] <- 6
   рівень1.[6].[3] <- 2*ширинаГри/3
   рівень1.[6].[4] <- -50
   рівень1.[6].[5] <- 2
   рівень1.[6].[6] <- 3
   рівень1.[6].[7] <- 1

   рівень1.[5].[1] <- 500
   рівень1.[5].[2] <- 6
   рівень1.[5].[3] <- ширинаГри/3
   рівень1.[5].[4] <- -50
   рівень1.[5].[5] <- 1
   рівень1.[5].[6] <- 6
   рівень1.[5].[7] <- 2

   рівень1.[6].[1] <- 590
   рівень1.[6].[2] <- 5
   рівень1.[6].[3] <- 100
   рівень1.[6].[4] <- -80
   рівень1.[6].[5] <- 1
   рівень1.[6].[6] <- 3
   рівень1.[6].[7] <- 3
  
   рівень1.[7] <- Словник()
   рівень1.[7].[1] <- 690
   рівень1.[7].[2] <- 6
   рівень1.[7].[3] <- ширинаГри/3
   рівень1.[7].[4] <- -50
   рівень1.[7].[5] <- 2
   рівень1.[7].[6] <- 3
   рівень1.[7].[7] <- 2
   для i= 1 до 10 зробити
      рівень1.[7+i] <- Словник()
      рівень1.[7+i].[1] <- 700+50*i
      рівень1.[7+i].[2] <- 6
      рівень1.[7+i].[3] <- Математика.ОтриматиВипадковеЧисло(ширинаГри)
      рівень1.[7+i].[4] <- -50 + i
      рівень1.[7+i].[5] <- Математика.ОтриматиВипадковеЧисло(2)
      рівень1.[7+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      рівень1.[7+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)
   рівень1.[18] <- Словник()
   рівень1.[18].[1] <- 1300
   рівень1.[18].[2] <- 1
   рівень1.[18].[3] <- ширинаГри
   рівень1.[18].[4] <- -10
   рівень1.[18].[5] <- 2
   рівень1.[18].[6] <- 6
   рівень1.[18].[7] <- 2

   для i=1 до 10 зробити
      рівень1.[18+i] <- Словник()
      рівень1.[18+i].[1] <- 1330+50*i
      рівень1.[18+i].[2] <- 4+Математика.ОтриматиВипадковеЧисло(2)
      рівень1.[18+i].[3] <- Математика.ОтриматиВипадковеЧисло(50)
      рівень1.[18+i].[4] <- i
      рівень1.[18+i].[5] <- 1
      рівень1.[18+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      рівень1.[18+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

   для i= 1 до 10 зробити
      рівень1.[28+i] <- Словник()
      рівень1.[28+i].[1] <- 1900+50*i
      рівень1.[28+i].[2] <- 4+Математика.ОтриматиВипадковеЧисло(2)
      рівень1.[28+i].[3] <- -Математика.ОтриматиВипадковеЧисло(50)
      рівень1.[28+i].[4] <- i
      рівень1.[28+i].[5] <- 1
      рівень1.[28+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      рівень1.[28+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

   для i= 1 до 10 зробити
     рівень1.[38+i] <- Словник()
     рівень1.[38+i].[1] <- 2450+100*i
     рівень1.[38+i].[2] <- 6
     рівень1.[38+i].[3] <- Математика.ОтриматиВипадковеЧисло(ширинаГри)
     рівень1.[38+i].[4] <- -50 + i
     рівень1.[38+i].[5] <- Математика.ОтриматиВипадковеЧисло(2)
     рівень1.[38+i].[6] <- Математика.ОтриматиВипадковеЧисло(5)
     рівень1.[38+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

//Presentation
// todo

// Начать игру
Ініціалізація()
визначити_шляхи()
//створити_ворогів1()
Гра()
printfn "ГРУ ЗАКІНЧЕНО"