#if INTERACTIVE
#r "./bin/debug/Xwt.dll"
#r "./bin/debug/FunSharp.dll"
#endif

open Бiблiотека

type System.Collections.Generic.Dictionary<'TKey,'TValue> with
   member this.GetOrDefault(ключ:'TKey,значение:'TValue) =
      match this.TryGetValue(ключ) with
      | true, значение -> значение
      | false, _ -> значение


// 1942 like Game ID: KJW676
// Copyright (C) 2010, Laurent GIRAUD laurent.giraud1@free.fr
// License: MIT license http://www.opensource.org/licenses/mit-license.php
// most of Game artwork created by Ari Feldman ari@arifeldman.com"
// and others grabed from free web sprites

let пулиСинхр = obj()

//-------------------------
// or load from web url
//let Путь= "http://imode.free.fr/images1942/"
let Путь = ""
//-------------------------

// Game area controls
let ширинаГри  = 640
let высотаГри = 480
let fps = 50
let скф = 2 //backgroundspeed
let mutable Жизни_Игрока = 10
let клвостровов = 5 //nomber of island images
let количествоостровов = 5 //nomber of island in the wall field

// Заголовок окна
let заголовокГри = "1942, Счет: "

ГрафичнеВікно.Сховати()
ГрафичнеВікно.Заголовок <- заголовокГри + "0"
ГрафичнеВікно.CanResize <- false
ГрафичнеВікно.Ширина <- ширинаГри
ГрафичнеВікно.Высота <- высотаГри

// Global variables

let mutable ігрок = "<shape name>"
let mutable ракеткаX = 0
let mutable ракеткаY = 0
let mutable фон = "<shape name>"

// addImage in the right order is needed to define the shapes depth
let остров4 = СписокЗображень.ЗагрузитьИзображение(Путь + "island4.png")
let остров1= СписокЗображень.ЗагрузитьИзображение(Путь + "island1.png")
let остров2= СписокЗображень.ЗагрузитьИзображение(Путь + "island2.png")
let остров3= СписокЗображень.ЗагрузитьИзображение(Путь + "island3.png")
let остров5= СписокЗображень.ЗагрузитьИзображение(Путь + "island5.png")
let игрок0 = СписокЗображень.ЗагрузитьИзображение(Путь + "myplane1.png")
let background = СписокЗображень.ЗагрузитьИзображение(Путь + "fond.png")
let пуля0 = СписокЗображень.ЗагрузитьИзображение(Путь + "bullet.png")
let враг= СписокЗображень.ЗагрузитьИзображение(Путь + "enemy1.png")
let враг2 = СписокЗображень.ЗагрузитьИзображение(Путь + "enemy2.png")
let взрв_врага1=СписокЗображень.ЗагрузитьИзображение(Путь + "explo1.png")
let взрв_врага2=СписокЗображень.ЗагрузитьИзображение(Путь + "explo2.png")
let взрв_игрока=СписокЗображень.ЗагрузитьИзображение(Путь + "explo2.png")
let Enemy_bullet=СписокЗображень.ЗагрузитьИзображение(Путь + "E_bullet.png")
let ``конец`` = СписокЗображень.ЗагрузитьИзображение(Путь + "End.png")

let массив_Врагов = Словник() // Array that contain all the enemies
let враг_Хронометраж = Словник()
let линия_врага = Словник()
let позX_Врага = Словник()
let позY_Врага = Словник()
let враг_ПутьNBR = Словник()

let mutable ном_Врага = 6
let mutable количество_Врагов = 0
let скорость_врагов = 4.0
//enemy_NextRemove = 1
let жизни_Врагов = 10
let размер_игрока= 65
let размер_врага = 32
let размер_пуль_врага = 8
let размер_пули_игрока = 32

let массив_Островов = Словник()

let Пули_Игрока = Словник()
let ВозрастПули_Игрока = Словник()
ВозрастПули_Игрока.[1] <- 0
let Игрок_МаксПуль = 50
let mutable Игрок_КоличествоПуль = 0
let СкоростьПули_Игрока = float скф + 4.0
let Игрок_ЖизньСнаряда = 100

let mutable ВыстрелX = nan
let mutable ВыстрелY = nan

let mutable инкx = 0  // X-axis increment for background
let mutable инкy = 0  // Y-axis increment for background
let mutable инкпx = 0.0 // increment for bullets and all objects on X
let mutable инкпy = 0.0 // increment for bullets and all objects on Y

let Пули_Врага = Словник()
let ВозрастПули_Врага = Словник()
ВозрастПули_Врага.[1] <- 0
let Угол_Пуль_Врага= Словник()
let Враг_МаксПуль = 30
let mutable КоличествоПуль_Врага = 0
let Скорость_ПульВрага = скф + 4
let Враг_ЖизньСнаряда = 50
let Враг_Агрессивность = 200
let mutable Выстрел_ВрагаX = 0
let mutable Выстрел_ВрагаY = 0

let mutable ВремяИгры = 0

let mutable путьNBR = 1
let mutable позВрагаX1 = 0
let mutable позВрагаY1 = 0
let mutable тип_врага = 0

let mutable счет = 0

let позОстровов = Словник<int,Словник<int,int>>()
let инкостровx = Словник<int,int>()
let инкостровy = Словник<int,int>()
let уровень1 = Словник<int,Словник<int,int>>()
let путьВрага = Словник<int, Словник<int, Словник<int,float>>>()
let позx = Словник<int,_>()
let позy = Словник<int,_>()

// Настроить мир
let rec Инициализация() =
   ГрафичнеВікно.Сховати()

   Мышь.СкрытьКурсор()

   // every enemy in tha array has 5 informations
   // TimeLine: each enemy has its own timeline
   // PathNBR: the precalculated path defineing the movement
   // the movement is decomposed in LineNbr differents lines
   // each line is define in the enemy_path table with rotation, deltaY and deltaY
   // PositonX, PositonY: position in space
   //

   ПозицииОстровов()
   создать_уровень1()

   фон <- Фігури.ДобавитьИзображение(background)
   массив_Островов.[1] <- Фігури.ДобавитьИзображение(остров1)
   массив_Островов.[2] <- Фігури.ДобавитьИзображение(остров2)
   массив_Островов.[3] <- Фігури.ДобавитьИзображение(остров3)
   массив_Островов.[4] <- Фігури.ДобавитьИзображение(остров4)
   массив_Островов.[5] <- Фігури.ДобавитьИзображение(остров5)
   for i = 6 to количествоостровов do
      массив_Островов.[i] <- массив_Островов.[Математика.Залишок(i,4)]

   ігрок <- Фігури.ДобавитьИзображение(игрок0)
   ГрафичнеВікно.РозмірШрифта <- 20.0
   ГрафичнеВікно.КолірФона <- Кольори.Gray
   ГрафичнеВікно.КолірПера <- Кольори.Yellow



// Главная игровая процедура
and Игра () =
   ГрафичнеВікно.Показать()

   // Главный цикл
   let гра = 1
   let пауза = 0
   инкx <- 0  // X-axis increment for background
   инкy <- 0  // Y-axis increment for background
   инкпx <- 0.0 // increment for bullets and all objects on X
   инкпy <- 0.0 // increment for bullets and all objects on Y
   let mutable эскадрон = 1
   // Начальная позиция островов 
   let mutable j=0

   for i=1 to количествоостровов do
      j <- Математика.Залишок(i,6)
      позy.[i] <- позОстровов.[j].[2]
      позx.[i] <- позОстровов.[j].[3]
      инкостровx.[i] <- 0
      инкостровy.[i] <- 0   
   ВремяИгры <- 0
   Фігури.Перемістити(ігрок, ширинаГри/2 , высотаГри - 80 )
   while (гра = 1) do
      Програма.Затримка(1000/fps)
      ВремяИгры <- ВремяИгры + 1

      if (пауза = 0) then
         if (ВремяИгры = уровень1.[эскадрон].[1]) then

            путьNBR <- уровень1.[эскадрон].[2]
            позВрагаX1 <- уровень1.[эскадрон].[3]  //позиция X
            позВрагаY1 <- уровень1.[эскадрон].[4]  //позиция Y
            ном_Врага <- уровень1.[эскадрон].[6]
            тип_врага <- уровень1.[эскадрон].[7]
            if (уровень1.[эскадрон].[5]=1) then
               создать_врагов_слева()
            else
               создать_врагов_справа()         
            эскадрон <- эскадрон + 1
                 
         if (ВремяИгры > 4000) then
            Фігури.Перемістити(Фігури.ДобавитьИзображение(``конец``), 230,200)
            Програма.Затримка(5000)
            Програма.Закончить()     
         lock пулиСинхр (fun () ->  
            переместитьвсе()
         )

         ГрафичнеВікно.МишаПереміщена <- Callback(НаДвижениеМыши)
         ГрафичнеВікно.МишаНатиснута <- Callback(НаНажатиеМыши)

         ПостаретьПулю_Игрока()

and НаДвижениеМыши () =
   ракеткаX <- int ГрафичнеВікно.МишаX - размер_игрока / 2
   ракеткаY <- int ГрафичнеВікно.МишаY - размер_игрока

   if (ракеткаX < 0) then
      ракеткаX <- 0   
   Фігури.Перемістити(ігрок, ракеткаX , ракеткаY )

and НаНажатиеМыши () =
   ВыстрелX <- ГрафичнеВікно.МишаX - 15.0 // in order to be from the neck of the plane
   ВыстрелY <- ГрафичнеВікно.МишаY - 80.0
   Огонь()

and переместитьвсе () =
   инкпx <- 0.0
   инкпy <- 0.0
   ГрафичнеВікно.Заголовок <- заголовокГри + счет.ToString() + " Жизни:" + Жизни_Игрока.ToString()

   if (ракеткаX > (ширинаГри-62) ) then
      инкx <- инкx - скф
      инкпx <- инкпx - float скф
      for i=1 to количествоостровов do
         инкостровx.[i] <- инкостровx.[i] - скф    
      if (инкx = -32 ) then
         инкx <- 0
   if (ракеткаX < 64 ) then
      инкx <- инкx + скф
      инкпx <- инкпx + float скф
      for i=1 to количествоостровов do
         инкостровx.[i] <- инкостровx.[i] + скф
      if (инкx = 32 ) then
         инкx <- 0
   Фігури.Перемістити(фон,инкx - 32 ,инкy - 32)

   for i=1 to количествоостровов do
      let острx = позx.[i]+инкостровx.[i]
      let острy = позy.[i]+инкостровy.[i]
      Фігури.Перемістити(массив_Островов.[i],острx,острy)

   инкy <- инкy + скф
   инкпy <- инкпy + float скф
   for i=1 to количествоостровов do
      инкостровy.[i] <- инкостровy.[i] + скф    

   if (инкy = 32) then
      инкy <- 0   

   for i=1 to количествоостровов do
      if ((позy.[i]+инкостровy.[i]) > (высотаГри+15)) then // relaunch island if no more visible
         let R = int (Математика.Округляти(float (Математика.ОтриматиВипадковеЧисло(клвостровов))))
         let AA = Математика.Залишок(ВремяИгры,6)
         // give new coordinates
         позx.[i] <- позОстровов.[AA].[2]
         позy.[i] <- позОстровов.[AA].[3]
         Фігури.Перемістити(массив_Островов.[R],позx.[i],позy.[i])
         инкостровy.[i] <- 0
         инкостровx.[i] <- 0         
   // Перемістити пули игрока
   for i = 1 to Игрок_КоличествоПуль do
      let имяФигуры = Пули_Игрока.[i]
      let Пуля_Игрокаx = Фігури.ПолучитьЛево(имяФигуры) + инкпx
      let Пуля_Игрокаy = Фігури.ПолучитьВерх(имяФигуры) - СкоростьПули_Игрока
      Фігури.Перемістити(имяФигуры, Пуля_Игрокаx, Пуля_Игрокаy)
      let старыйВозраст = ВозрастПули_Игрока.GetOrDefault(i, 0)
      ВозрастПули_Игрока.[i] <- старыйВозраст + 1
   // Перемістити пули врага
   for iea = 1 to КоличествоПуль_Врага do
      let dx = (Математика.Син((Угол_Пуль_Врага.[iea] )) * float Скорость_ПульВрага)
      let dy = (Математика.Кос((Угол_Пуль_Врага.[iea] )) * float Скорость_ПульВрага)
      let Пуля_Врагаx = Фігури.ПолучитьЛево(Пули_Врага.[iea]) + dx + инкпx
      let Пуля_Врагаy = Фігури.ПолучитьВерх(Пули_Врага.[iea]) + dy + инкпy * 0.1
      Фігури.Перемістити(Пули_Врага.[iea], Пуля_Врагаx, Пуля_Врагаy)
      let старыйВозраст =
         match ВозрастПули_Врага.TryGetValue(iea) with
         | true, n -> n
         | false, _ -> 0
      ВозрастПули_Врага.[iea] <- старыйВозраст + 1

   // move ennemies
   let mutable i=1
   while i <= количество_Врагов do
      // move as TimeLine and Path say
      let вNBR = враг_ПутьNBR.[i]
      let mutable uu = линия_врага.[i]
      let Время = враг_Хронометраж.[i]
      let etl = путьВрага.[вNBR].[1].GetOrDefault(uu, 0.0)  //enemy own timeLine
      if (Время=etl) then  //время повернуть врага
         let rr = путьВрага.[вNBR].[2].GetOrDefault(uu+1, 0.0)            
         Фігури.Повернути(массив_Врагов.[i],rr)
      if (Время > etl)  then
         uu <- uu+1
         линия_врага.[i] <- uu    // следующая линия для передвижения врага      
      let xx1 = позX_Врага.[i]
      let yy1 = позY_Врага.[i]
      let xx = float xx1+путьВрага.[вNBR].[3].GetOrDefault(uu, 0.0)+инкпx
      let yy = float yy1+путьВрага.[вNBR].[4].GetOrDefault(uu, 0.0)+инкпy*0.1
      // Случайные выстрелы врага
      if (Математика.ОтриматиВипадковеЧисло(Враг_Агрессивность)=1) then
         Выстрел_ВрагаX <- xx1 + 16
         Выстрел_ВрагаY <- yy1 + 4
         if (yy1 > 0 && xx1 > 0 && yy1 < высотаГри && xx1 < ширинаГри) then
            // это избегает выстрелы врага изза экрана
            выстрел_Врага()

      Фігури.Перемістити(массив_Врагов.[i],xx,yy)
      позX_Врага.[i] <- int xx
      позY_Врага.[i] <- int yy
      враг_Хронометраж.[i] <- Время + 1.0
      if ((float uu > путьВрага.[вNBR].[0].[0]) && (Время > etl)) then // if last timelife remove the enemy sprite 
         let следующий_удаляемый_враг = i
         удалить_врага(следующий_удаляемый_враг)      
      
      Столкновение_ипв()
      Столкновения_ви()

      i <- i + 1
      
and УдалитьПулю_Игрока (player_Ammo_nextRemove) =
   Фігури.Видалити(Пули_Игрока.[player_Ammo_nextRemove])
   for iz = player_Ammo_nextRemove to Игрок_КоличествоПуль - 1 do
       Пули_Игрока.[iz] <- Пули_Игрока.[iz+1]
       ВозрастПули_Игрока.[iz] <- ВозрастПули_Игрока.[iz+1]
   Пули_Игрока.Remove(Игрок_КоличествоПуль) |> ignore
   ВозрастПули_Игрока.Remove(Игрок_КоличествоПуль) |> ignore
   Игрок_КоличествоПуль <- Игрок_КоличествоПуль - 1

and УдалитьПулю_Врага (enemy_Ammo_nextRemove) =
   Фігури.Видалити(Пули_Врага.[enemy_Ammo_nextRemove])
   for irea = enemy_Ammo_nextRemove to КоличествоПуль_Врага - 1 do
       Пули_Врага.[irea] <- Пули_Врага.[irea+1]      
       ВозрастПули_Врага.[irea] <-
         if (irea+1) < ВозрастПули_Врага.Count then ВозрастПули_Врага.[irea+1] else 0
       Угол_Пуль_Врага.[irea] <- Угол_Пуль_Врага.[irea+1]
   Пули_Врага.Remove(КоличествоПуль_Врага) |> ignore
   ВозрастПули_Врага.Remove(КоличествоПуль_Врага) |> ignore
   Угол_Пуль_Врага.Remove(КоличествоПуль_Врага) |> ignore
   КоличествоПуль_Врага <- КоличествоПуль_Врага - 1

and Огонь () =
   lock пулиСинхр (fun () -> 
      // Remove additional player Ammo
      while (Игрок_КоличествоПуль > Игрок_МаксПуль ) do
         УдалитьПулю_Игрока(1)

      // Add the player Ammo
      Игрок_КоличествоПуль <- Игрок_КоличествоПуль + 1
      Пули_Игрока.[Игрок_КоличествоПуль] <- Фігури.ДобавитьИзображение(пуля0)
      Фігури.Перемістити(Пули_Игрока.[Игрок_КоличествоПуль], ВыстрелX, ВыстрелY)
   )

and выстрел_Врага () =
   // Remove additional Enemy Ammo
   while (КоличествоПуль_Врага > (Враг_МаксПуль - 1)) do      
      УдалитьПулю_Врага(1)

   // Add the Enemy Ammo
   КоличествоПуль_Врага <- КоличествоПуль_Врага + 1
   Пули_Врага.[КоличествоПуль_Врага] <- Фігури.ДобавитьИзображение(Enemy_bullet)
   Угол_Пуль_Врага.[КоличествоПуль_Врага] <- Математика.АркТан(float(ракеткаX- Выстрел_ВрагаX+размер_игрока/2)/float(ракеткаY-Выстрел_ВрагаY))
   let shape = Пули_Врага.[КоличествоПуль_Врага]
   Фігури.Перемістити(shape, Выстрел_ВрагаX, Выстрел_ВрагаY)

//Check playerammo age
and ПостаретьПулю_Игрока () =
   while (ВозрастПули_Игрока.Count > 0 && ВозрастПули_Игрока.[1] > Игрок_ЖизньСнаряда) do
      УдалитьПулю_Игрока(1)  

// Check enemy ammo age
and ПостаретьПулю_Врага () =
   while (ВозрастПули_Врага.Count > 0 && ВозрастПули_Врага.[1] > Враг_ЖизньСнаряда) do
      УдалитьПулю_Врага(1)

and удалить_врага (next_enemy_remove) =
   Фігури.Видалити(массив_Врагов.[next_enemy_remove])
   // Remove all references from the arrays
   for ii = next_enemy_remove to количество_Врагов - 1 do
      массив_Врагов.[ii] <- массив_Врагов.[ii+1]
      линия_врага.[ii] <- линия_врага.[ii+1]
      позX_Врага.[ii] <- позX_Врага.[ii+1]
      позY_Врага.[ii] <- позY_Врага.[ii+1]
      враг_Хронометраж.[ii] <- враг_Хронометраж.[ii+1]
      враг_ПутьNBR.[ii] <- враг_ПутьNBR.[ii+1]
   массив_Врагов.Remove(количество_Врагов) |> ignore
   линия_врага.Remove(количество_Врагов) |> ignore
   позX_Врага.Remove(количество_Врагов) |> ignore
   позY_Врага.Remove(количество_Врагов) |> ignore
   враг_Хронометраж.Remove(количество_Врагов) |> ignore
   враг_ПутьNBR.Remove(количество_Врагов) |> ignore
   количество_Врагов <- количество_Врагов - 1

and создать_врагов_слева () =

   let mutable Хронометраж1 = 0.0
   for i=1 to ном_Врага do
      количество_Врагов <- количество_Врагов + 1
      враг_ПутьNBR.[количество_Врагов] <- путьNBR
      if (тип_врага = 2) then
         массив_Врагов.[количество_Врагов] <- Фігури.ДобавитьИзображение(враг2)
      else
         массив_Врагов.[количество_Врагов] <- Фігури.ДобавитьИзображение(враг)
      линия_врага.[количество_Врагов] <- 1
      позX_Врага.[количество_Врагов] <- позВрагаX1
      позY_Врага.[количество_Врагов] <- позВрагаY1
      враг_Хронометраж.[количество_Врагов] <- Хронометраж1

      позВрагаX1 <- позВрагаX1 - 64  // distance between ennemies
      Хронометраж1 <- Хронометраж1 - 64.0 / float скорость_врагов   
   for i=(количество_Врагов-ном_Врага+1) to количество_Врагов do
      let xxx = позX_Врага.[i]
      let yyy = позY_Врага.[i]
      Фігури.Перемістити(массив_Врагов.[i],xxx,yyy)

and создать_врагов_справа () =

   let mutable Хронометраж1 = 0.0
   for i=1 to ном_Врага do
      количество_Врагов <- количество_Врагов + 1
      враг_ПутьNBR.[количество_Врагов] <- путьNBR
      массив_Врагов.[количество_Врагов] <- Фігури.ДобавитьИзображение(враг)
      линия_врага.[количество_Врагов] <- 1
      позX_Врага.[количество_Врагов] <- позВрагаX1
      позY_Врага.[количество_Врагов] <- позВрагаY1
      враг_Хронометраж.[количество_Врагов] <- float Хронометраж1

      позВрагаX1 <- позВрагаX1 + 64 // distance between ennemies
      Хронометраж1 <- Хронометраж1 - 64.0 / скорость_врагов
         
   for i=(количество_Врагов-ном_Врага+1) to количество_Врагов do
      let xxx=позX_Врага.[i]
      let yyy=позY_Врага.[i]
      Фігури.Перемістити(массив_Врагов.[i],xxx,yyy)
   
and Столкновение_ипв () =  // для пуль-игрока и врагов

   let mutable i1 = 1
   while i1 <= Игрок_КоличествоПуль do
      // player bullet position
      let shapeName = Пули_Игрока.[i1]
      let Player_Ammox = int (Фігури.ПолучитьЛево(shapeName))
      let Player_Ammoy = int (Фігури.ПолучитьВерх(shapeName))
      let px1=Player_Ammox+размер_пули_игрока/3   // in order to have a more precise collison than the bullet image size
      let py1=Player_Ammoy+размер_пули_игрока/3
      let px2=px1+2*размер_пули_игрока/3
      let py2=py1+2*размер_пули_игрока/3

      let mutable пулиУдалены = false
      let mutable i2 = 1
      while i2 <= количество_Врагов do
         // позиция врага 
         let ax1=позX_Врага.[i2]+размер_врага/4
         let ay1=позY_Врага.[i2]+размер_врага/4

         let ax2=ax1+3*размер_врага/4
         let ay2=ay1+3*размер_врага/4

         if ( (ax1 < px1 && ax2 > px1) || (ax1 < px2 && ax2 > px2) ) then
            if ( (ay1 < py1 && ay2 > py1) || (ay1 < py2 && ay2 > py2) ) then
               // collision between enemy nbr i2 and player bullet i
               // remove bullet i and animate explosion and remove enemy i2
               if not пулиУдалены then 
                  УдалитьПулю_Игрока(i1)
                  пулиУдалены <- true
               let следующий_удаляемый_враг = i2
               удалить_врага(следующий_удаляемый_враг)
               // begin animation for explosion at coordinate ax1, ay1
               let toto = Фігури.ДобавитьИзображение(взрв_врага1)
               Фігури.Перемістити(toto,ax1,ay1)
               Програма.Затримка(30)
               Фігури.Видалити(toto)
               let toto = Фігури.ДобавитьИзображение(взрв_врага2)
               Фігури.Перемістити(toto,ax1,ay1)
               Програма.Затримка(30)
               Фігури.Видалити(toto)
               счет <- счет + 100

         i2 <- i2 + 1

      
      i1 <- i1 + 1

and Столкновения_ви () =   // для врагов и игрока 
   let px1 = int (Фігури.ПолучитьЛево(ігрок))
   let py1 = int (Фігури.ПолучитьВерх(ігрок))
   let px2 = px1 + размер_игрока
   let py2 = py1 + размер_игрока

   //Фігури.Move(Фігури.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   let mutable i2 = 1
   while i2 <= количество_Врагов do
      // позиция врага
      let ax1=позX_Врага.[i2]
      let ay1=позY_Врага.[i2]

      let ax2=ax1+размер_врага
      let ay2=ay1+размер_врага
      //Фігури.Move(Фігури.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      if ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) then
         if ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) then
            // collision between enemy nbr i2 and player 
            // animate explosion and decrease lives            
            удалить_врага(i2)
            // begin animation for explosion at coordinate ax1, ay1
            let toto = Фігури.ДобавитьИзображение(взрв_врага1)
            Фігури.Перемістити(toto,ax1,ay1)
            Програма.Затримка(30)
            Фігури.Видалити(toto)
            let toto = Фігури.ДобавитьИзображение(взрв_игрока)
            Фігури.Перемістити(toto,ax1,ay1)
            Програма.Затримка(300)
            Фігури.Видалити(toto)
            Жизни_Игрока <- Жизни_Игрока - 1
            if (Жизни_Игрока = 0) then
               Програма.Закончить()

      i2 <- i2 + 1

   let px1 = ракеткаX
   let py1 = ракеткаY
   let px2 = px1 + размер_игрока
   let py2 = py1 + размер_игрока
   // Фігури.Move(Фігури.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   
   let mutable i3 = 1
   while i3 <= КоличествоПуль_Врага do
      // позиция врага 

      let ax1=int (Фігури.ПолучитьЛево(Пули_Врага.[i3]))
      let ay1=int (Фігури.ПолучитьВерх(Пули_Врага.[i3]))

      let ax2=ax1+размер_пуль_врага
      let ay2=ay1+размер_пуль_врага
      //Фігури.Move(Фігури.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      if ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) then
         if ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) then
            // collision between enemy ammo nbr i3 and player 
            // animate explosion and decrease lives
            УдалитьПулю_Врага(i3)

            // begin animation for explosion at coordinate ax1, ay1
            let toto = Фігури.ДобавитьИзображение(взрв_врага1)
            Фігури.Перемістити(toto,ракеткаX+ размер_игрока/2,ракеткаY+ размер_игрока/2)
            Програма.Затримка(30)
            Фігури.Видалити(toto)
            let toto = Фігури.ДобавитьИзображение(взрв_игрока)
            Фігури.Перемістити(toto,ракеткаX+ размер_игрока/2,ракеткаY+ размер_игрока/2)
            Програма.Затримка(300)
            Фігури.Видалити(toto)
            Жизни_Игрока <- Жизни_Игрока - 1
            if (Жизни_Игрока = 0) then
               Програма.Закончить()

      i3 <- i3 + 1

and ПозицииОстровов () =
   // island positions, avoid randomGeneration and islands overlap
   позОстровов.[0] <- Словник()
   позОстровов.[0].[1] <- 1
   позОстровов.[0].[2] <- 0
   позОстровов.[0].[3] <- -150
   позОстровов.[1] <- Словник()
   позОстровов.[1].[1] <- 1
   позОстровов.[1].[2] <- - int (Математика.Округляти(float ширинаГри/2.0))
   позОстровов.[1].[3] <- -150
   позОстровов.[2] <- Словник()
   позОстровов.[2].[1] <- 2
   позОстровов.[2].[2] <- -2 * int (Математика.Округляти(float ширинаГри/3.0))
   позОстровов.[2].[3] <- -150
   позОстровов.[3] <- Словник()
   позОстровов.[3].[1] <- 1
   позОстровов.[3].[2] <- 2 * int (Математика.Округляти(float ширинаГри/3.0))
   позОстровов.[3].[3] <- -150
   позОстровов.[4] <- Словник()
   позОстровов.[4].[1] <- 2
   позОстровов.[4].[2] <- ширинаГри
   позОстровов.[4].[3] <- -150
   позОстровов.[5] <- Словник()
   позОстровов.[5].[1] <- 3
   позОстровов.[5].[2] <- int (Математика.Округляти(float ширинаГри/3.0))
   позОстровов.[5].[3] <- -150
   позОстровов.[6] <- Словник()
   позОстровов.[6].[1] <- 3
   позОстровов.[6].[2] <- -ширинаГри
   позОстровов.[6].[3] <- -150

and определить_пути () =
   for i = 0 to 6 do
      путьВрага.[i] <- Словник()
      for j = 0 to 4 do 
         путьВрага.[i].[j] <- Словник()

   путьВрага.[0].[0].[0] <- 3.   // nbr of strait lines of path
   путьВрага.[0].[1].[1] <- 30.  // from 0 to this in timeline
   путьВрага.[0].[1].[2] <- 100. // from this to next in timeline
   путьВрага.[0].[1].[3] <- 400. // sprite goes up

   путьВрага.[0].[2].[1] <- 0.   // first line rotation = 0
   путьВрага.[0].[2].[2] <- 45.  // second line rotation = 45
   путьВрага.[0].[2].[3] <- 45.

   путьВрага.[0].[3].[1] <- скорость_врагов // first line x movment
   путьВрага.[0].[3].[2] <- скорость_врагов // second line x movment
   путьВрага.[0].[3].[3] <- скорость_врагов // third line ...

   путьВрага.[0].[4].[1] <- 0. // first line y movment
   путьВрага.[0].[4].[2] <- скорость_врагов
   путьВрага.[0].[4].[3] <- скорость_врагов
   // ---------- second pat
   путьВрага.[1].[0].[0] <- 4.
   путьВрага.[1].[1].[1] <- 1.
   путьВрага.[1].[1].[2] <- 1.
   путьВрага.[1].[1].[3] <- 100.
   путьВрага.[1].[1].[4] <- 400.

   путьВрага.[1].[2].[1] <- 180.
   путьВрага.[1].[2].[2] <- 135.
   путьВрага.[1].[2].[3] <- 135.
   путьВрага.[1].[2].[4] <- 90.

   путьВрага.[1].[3].[1] <- -скорость_врагов
   путьВрага.[1].[3].[2] <- -скорость_врагов
   путьВрага.[1].[3].[3] <- -скорость_врагов
   путьВрага.[1].[3].[4] <- 0.

   путьВрага.[1].[4].[1] <- 0.
   путьВрага.[1].[4].[2] <- 0.
   путьВрага.[1].[4].[3] <- скорость_врагов
   путьВрага.[1].[4].[4] <- скорость_врагов
   // round r=5
   путьВрага.[2].[0].[0] <- 21.
   путьВрага.[2].[1].[1] <- 50.
   путьВрага.[2].[1].[2] <- 55.
   путьВрага.[2].[1].[3] <- 60.
   путьВрага.[2].[1].[4] <- 65.
   путьВрага.[2].[1].[5] <- 70.
   путьВрага.[2].[1].[6] <- 75.
   путьВрага.[2].[1].[7] <- 80.
   путьВрага.[2].[1].[8] <- 85.
   путьВрага.[2].[1].[9] <- 90.
   путьВрага.[2].[1].[10] <- 95.
   путьВрага.[2].[1].[11] <- 100.
   путьВрага.[2].[1].[12] <- 105.
   путьВрага.[2].[1].[13] <- 110.
   путьВрага.[2].[1].[14] <- 115.
   путьВрага.[2].[1].[15] <- 120.
   путьВрага.[2].[1].[16] <- 125.
   путьВрага.[2].[1].[17] <- 130.
   путьВрага.[2].[1].[18] <- 135.
   путьВрага.[2].[1].[19] <- 140.
   путьВрага.[2].[1].[20] <- 145.
   путьВрага.[2].[1].[21] <-350.
   путьВрага.[2].[2].[1] <- 0.
   путьВрага.[2].[2].[2] <- 18.
   путьВрага.[2].[2].[3] <- 36.
   путьВрага.[2].[2].[4] <- 54.
   путьВрага.[2].[2].[5] <- 72.
   путьВрага.[2].[2].[6] <- 90.
   путьВрага.[2].[2].[7] <- 108.
   путьВрага.[2].[2].[8] <- 126.
   путьВрага.[2].[2].[9] <- 144.
   путьВрага.[2].[2].[10] <- 162.
   путьВрага.[2].[2].[11] <- 180.
   путьВрага.[2].[2].[12] <- 198.
   путьВрага.[2].[2].[13] <- 216.
   путьВрага.[2].[2].[14] <- 234.
   путьВрага.[2].[2].[15] <- 252.
   путьВрага.[2].[2].[16] <- -90.
   путьВрага.[2].[2].[17] <- -72.
   путьВрага.[2].[2].[18] <- -54.
   путьВрага.[2].[2].[19] <- -36.
   путьВрага.[2].[2].[20] <- -18.
   путьВрага.[2].[2].[21] <- 0.
   путьВрага.[2].[3].[1] <- скорость_врагов
   путьВрага.[2].[3].[2] <- 0.95*скорость_врагов
   путьВрага.[2].[3].[3] <- 0.81*скорость_врагов
   путьВрага.[2].[3].[4] <- 0.59*скорость_врагов
   путьВрага.[2].[3].[5] <- 0.31*скорость_врагов
   путьВрага.[2].[3].[6] <- 0.
   путьВрага.[2].[3].[7] <- -0.31*скорость_врагов
   путьВрага.[2].[3].[8] <- -0.59*скорость_врагов
   путьВрага.[2].[3].[9] <- -0.81*скорость_врагов
   путьВрага.[2].[3].[10] <- -0.95*скорость_врагов
   путьВрага.[2].[3].[11] <- -скорость_врагов
   путьВрага.[2].[3].[12] <- -0.95*скорость_врагов
   путьВрага.[2].[3].[13] <- -0.81*скорость_врагов
   путьВрага.[2].[3].[14] <- -0.59*скорость_врагов
   путьВрага.[2].[3].[15] <- -0.31*скорость_врагов
   путьВрага.[2].[3].[16] <- 0.
   путьВрага.[2].[3].[17] <- 0.31*скорость_врагов
   путьВрага.[2].[3].[18] <- 0.59*скорость_врагов
   путьВрага.[2].[3].[19] <- 0.81*скорость_врагов
   путьВрага.[2].[3].[20] <- 0.95*скорость_врагов
   путьВрага.[2].[3].[21] <- скорость_врагов
   путьВрага.[2].[4].[1] <- 0.
   путьВрага.[2].[4].[2] <- 0.31*скорость_врагов
   путьВрага.[2].[4].[3] <- 0.59*скорость_врагов
   путьВрага.[2].[4].[4] <- 0.81*скорость_врагов
   путьВрага.[2].[4].[5] <- 0.95*скорость_врагов
   путьВрага.[2].[4].[6] <- скорость_врагов
   путьВрага.[2].[4].[7] <- 0.95*скорость_врагов
   путьВрага.[2].[4].[8] <- 0.81*скорость_врагов
   путьВрага.[2].[4].[9] <- 0.59*скорость_врагов
   путьВрага.[2].[4].[10] <- 0.31*скорость_врагов
   путьВрага.[2].[4].[11] <- 0.
   путьВрага.[2].[4].[12] <- -0.31*скорость_врагов
   путьВрага.[2].[4].[13] <- -0.59*скорость_врагов
   путьВрага.[2].[4].[14] <- -0.81*скорость_врагов
   путьВрага.[2].[4].[15] <- -0.95*скорость_врагов
   путьВрага.[2].[4].[16] <- -скорость_врагов
   путьВрага.[2].[4].[17] <- -0.95*скорость_врагов
   путьВрага.[2].[4].[18] <- -0.81*скорость_врагов
   путьВрага.[2].[4].[19] <- -0.59*скорость_врагов
   путьВрага.[2].[4].[20] <- -0.31*скорость_врагов
   путьВрага.[2].[4].[21] <- 0.
   // round r=20
   путьВрага.[3].[0].[0] <- 21.
   путьВрага.[3].[1].[1] <- 120.
   путьВрага.[3].[1].[2] <- 140.
   путьВрага.[3].[1].[3] <- 160.
   путьВрага.[3].[1].[4] <- 180.
   путьВрага.[3].[1].[5] <- 200.
   путьВрага.[3].[1].[6] <- 220.
   путьВрага.[3].[1].[7] <- 240.
   путьВрага.[3].[1].[8] <- 260.
   путьВрага.[3].[1].[9] <- 280.
   путьВрага.[3].[1].[10] <- 300.
   путьВрага.[3].[1].[11] <- 320.
   путьВрага.[3].[1].[12] <- 340.
   путьВрага.[3].[1].[13] <- 360.
   путьВрага.[3].[1].[14] <- 380.
   путьВрага.[3].[1].[15] <- 400.
   путьВрага.[3].[1].[16] <- 420.
   путьВрага.[3].[1].[17] <- 440.
   путьВрага.[3].[1].[18] <- 460.
   путьВрага.[3].[1].[19] <- 480.
   путьВрага.[3].[1].[20] <- 500.
   путьВрага.[3].[1].[21] <- 600.
   путьВрага.[3].[2].[1] <- 0.
   путьВрага.[3].[2].[2] <- 18.
   путьВрага.[3].[2].[3] <- 36.
   путьВрага.[3].[2].[4] <- 54.
   путьВрага.[3].[2].[5] <- 72.
   путьВрага.[3].[2].[6] <- 90.
   путьВрага.[3].[2].[7] <- 108.
   путьВрага.[3].[2].[8] <- 126.
   путьВрага.[3].[2].[9] <- 144.
   путьВрага.[3].[2].[10] <- 162.
   путьВрага.[3].[2].[11] <- 180.
   путьВрага.[3].[2].[12] <- 198.
   путьВрага.[3].[2].[13] <- 216.
   путьВрага.[3].[2].[14] <- 234.
   путьВрага.[3].[2].[15] <- 252.
   путьВрага.[3].[2].[16] <- -90.
   путьВрага.[3].[2].[17] <- -72.
   путьВрага.[3].[2].[18] <- -54.
   путьВрага.[3].[2].[19] <- -36.
   путьВрага.[3].[2].[20] <- -18.
   путьВрага.[3].[2].[21] <- 0.
   путьВрага.[3].[3].[1] <- скорость_врагов
   путьВрага.[3].[3].[2] <- 0.95*скорость_врагов
   путьВрага.[3].[3].[3] <- 0.81*скорость_врагов
   путьВрага.[3].[3].[4] <- 0.59*скорость_врагов
   путьВрага.[3].[3].[5] <- 0.31*скорость_врагов
   путьВрага.[3].[3].[6] <- 0.
   путьВрага.[3].[3].[7] <- -0.31*скорость_врагов
   путьВрага.[3].[3].[8] <- -0.59*скорость_врагов
   путьВрага.[3].[3].[9] <- -0.81*скорость_врагов
   путьВрага.[3].[3].[10] <- -0.95*скорость_врагов
   путьВрага.[3].[3].[11] <- -скорость_врагов
   путьВрага.[3].[3].[12] <- -0.95*скорость_врагов
   путьВрага.[3].[3].[13] <- -0.81*скорость_врагов
   путьВрага.[3].[3].[14] <- -0.59*скорость_врагов
   путьВрага.[3].[3].[15] <- -0.31*скорость_врагов
   путьВрага.[3].[3].[16] <- 0.
   путьВрага.[3].[3].[17] <- 0.31*скорость_врагов
   путьВрага.[3].[3].[18] <- 0.59*скорость_врагов
   путьВрага.[3].[3].[19] <- 0.81*скорость_врагов
   путьВрага.[3].[3].[20] <- 0.95*скорость_врагов
   путьВрага.[3].[3].[21] <- скорость_врагов
   путьВрага.[3].[4].[1] <- 0.
   путьВрага.[3].[4].[2] <- 0.31*скорость_врагов
   путьВрага.[3].[4].[3] <- 0.59*скорость_врагов
   путьВрага.[3].[4].[4] <- 0.81*скорость_врагов
   путьВрага.[3].[4].[5] <- 0.95*скорость_врагов
   путьВрага.[3].[4].[6] <- скорость_врагов
   путьВрага.[3].[4].[7] <- 0.95*скорость_врагов
   путьВрага.[3].[4].[8] <- 0.81*скорость_врагов
   путьВрага.[3].[4].[9] <- 0.59*скорость_врагов
   путьВрага.[3].[4].[10] <- 0.31*скорость_врагов
   путьВрага.[3].[4].[11] <- 0.
   путьВрага.[3].[4].[12] <- -0.31*скорость_врагов
   путьВрага.[3].[4].[13] <- -0.59*скорость_врагов
   путьВрага.[3].[4].[14] <- -0.81*скорость_врагов
   путьВрага.[3].[4].[15] <- -0.95*скорость_врагов
   путьВрага.[3].[4].[16] <- -скорость_врагов
   путьВрага.[3].[4].[17] <- -0.95*скорость_врагов
   путьВрага.[3].[4].[18] <- -0.81*скорость_врагов
   путьВрага.[3].[4].[19] <- -0.59*скорость_врагов
   путьВрага.[3].[4].[20] <- -0.31*скорость_врагов
   путьВрага.[3].[4].[21] <- 0.

   // round r=10
   путьВрага.[4].[0].[0] <- 21.
   путьВрага.[4].[1].[1] <- 110.
   путьВрага.[4].[1].[2] <- 120.
   путьВрага.[4].[1].[3] <- 130.
   путьВрага.[4].[1].[4] <- 140.
   путьВрага.[4].[1].[5] <- 150.
   путьВрага.[4].[1].[6] <- 160.
   путьВрага.[4].[1].[7] <- 170.
   путьВрага.[4].[1].[8] <- 180.
   путьВрага.[4].[1].[9] <- 190.
   путьВрага.[4].[1].[10] <- 200.
   путьВрага.[4].[1].[11] <- 210.
   путьВрага.[4].[1].[12] <- 220.
   путьВрага.[4].[1].[13] <- 230.
   путьВрага.[4].[1].[14] <- 240.
   путьВрага.[4].[1].[15] <- 250.
   путьВрага.[4].[1].[16] <- 260.
   путьВрага.[4].[1].[17] <- 270.
   путьВрага.[4].[1].[18] <- 280.
   путьВрага.[4].[1].[19] <- 290.
   путьВрага.[4].[1].[20] <- 300.
   путьВрага.[4].[1].[21] <- 500.
   путьВрага.[4].[2].[1] <- 0.
   путьВрага.[4].[2].[2] <- 18.
   путьВрага.[4].[2].[3] <- 36.
   путьВрага.[4].[2].[4] <- 54.
   путьВрага.[4].[2].[5] <- 72.
   путьВрага.[4].[2].[6] <- 90.
   путьВрага.[4].[2].[7] <- 108.
   путьВрага.[4].[2].[8] <- 126.
   путьВрага.[4].[2].[9] <- 144.
   путьВрага.[4].[2].[10] <- 162.
   путьВрага.[4].[2].[11] <- 180.
   путьВрага.[4].[2].[12] <- 198.
   путьВрага.[4].[2].[13] <- 216.
   путьВрага.[4].[2].[14] <- 234.
   путьВрага.[4].[2].[15] <- 252.
   путьВрага.[4].[2].[16] <- -90.
   путьВрага.[4].[2].[17] <- -72.
   путьВрага.[4].[2].[18] <- -54.
   путьВрага.[4].[2].[19] <- -36.
   путьВрага.[4].[2].[20] <- -18.
   путьВрага.[4].[2].[21] <- 0.
   путьВрага.[4].[3].[1] <- скорость_врагов
   путьВрага.[4].[3].[2] <- 0.95*скорость_врагов
   путьВрага.[4].[3].[3] <- 0.81*скорость_врагов
   путьВрага.[4].[3].[4] <- 0.59*скорость_врагов
   путьВрага.[4].[3].[5] <- 0.31*скорость_врагов
   путьВрага.[4].[3].[6] <- 0.
   путьВрага.[4].[3].[7] <- -0.31*скорость_врагов
   путьВрага.[4].[3].[8] <- -0.59*скорость_врагов
   путьВрага.[4].[3].[9] <- -0.81*скорость_врагов
   путьВрага.[4].[3].[10] <- -0.95*скорость_врагов
   путьВрага.[4].[3].[11] <- -скорость_врагов
   путьВрага.[4].[3].[12] <- -0.95*скорость_врагов
   путьВрага.[4].[3].[13] <- -0.81*скорость_врагов
   путьВрага.[4].[3].[14] <- -0.59*скорость_врагов
   путьВрага.[4].[3].[15] <- -0.31*скорость_врагов
   путьВрага.[4].[3].[16] <- 0.
   путьВрага.[4].[3].[17] <- 0.31*скорость_врагов
   путьВрага.[4].[3].[18] <- 0.59*скорость_врагов
   путьВрага.[4].[3].[19] <- 0.81*скорость_врагов
   путьВрага.[4].[3].[20] <- 0.95*скорость_врагов
   путьВрага.[4].[3].[21] <- скорость_врагов
   путьВрага.[4].[4].[1] <- 0.
   путьВрага.[4].[4].[2] <- 0.31*скорость_врагов
   путьВрага.[4].[4].[3] <- 0.59*скорость_врагов
   путьВрага.[4].[4].[4] <- 0.81*скорость_врагов
   путьВрага.[4].[4].[5] <- 0.95*скорость_врагов
   путьВрага.[4].[4].[6] <- скорость_врагов
   путьВрага.[4].[4].[7] <- 0.95*скорость_врагов
   путьВрага.[4].[4].[8] <- 0.81*скорость_врагов
   путьВрага.[4].[4].[9] <- 0.59*скорость_врагов
   путьВрага.[4].[4].[10] <- 0.31*скорость_врагов
   путьВрага.[4].[4].[11] <- 0.
   путьВрага.[4].[4].[12] <- -0.31*скорость_врагов
   путьВрага.[4].[4].[13] <- -0.59*скорость_врагов
   путьВрага.[4].[4].[14] <- -0.81*скорость_врагов
   путьВрага.[4].[4].[15] <- -0.95*скорость_врагов
   путьВрага.[4].[4].[16] <- -скорость_врагов
   путьВрага.[4].[4].[17] <- -0.95*скорость_врагов
   путьВрага.[4].[4].[18] <- -0.81*скорость_врагов
   путьВрага.[4].[4].[19] <- -0.59*скорость_врагов
   путьВрага.[4].[4].[20] <- -0.31*скорость_врагов
   путьВрага.[4].[4].[21] <- 0.

   // round r=15 + exit down
   путьВрага.[5].[0].[0] <- 27.
   путьВрага.[5].[1].[1] <- 120.
   путьВрага.[5].[1].[2] <- 125.
   путьВрага.[5].[1].[3] <- 150.
   путьВрага.[5].[1].[4] <- 165.
   путьВрага.[5].[1].[5] <- 180.
   путьВрага.[5].[1].[6] <- 195.
   путьВрага.[5].[1].[7] <- 210.
   путьВрага.[5].[1].[8] <- 225.
   путьВрага.[5].[1].[9] <- 240.
   путьВрага.[5].[1].[10] <- 255.
   путьВрага.[5].[1].[11] <- 270.
   путьВрага.[5].[1].[12] <- 285.
   путьВрага.[5].[1].[13] <- 300.
   путьВрага.[5].[1].[14] <- 315.
   путьВрага.[5].[1].[15] <- 330.
   путьВрага.[5].[1].[16] <- 345.
   путьВрага.[5].[1].[17] <- 360.
   путьВрага.[5].[1].[18] <- 375.
   путьВрага.[5].[1].[19] <- 390.
   путьВрага.[5].[1].[20] <- 405.
   путьВрага.[5].[1].[21] <- 600.
   путьВрага.[5].[1].[22] <- 615.
   путьВрага.[5].[1].[23] <- 630.
   путьВрага.[5].[1].[24] <- 645.
   путьВрага.[5].[1].[25] <- 660.
   путьВрага.[5].[1].[26] <- 675.
   путьВрага.[5].[1].[27] <- 800.

   путьВрага.[5].[2].[1] <- 0.
   путьВрага.[5].[2].[2] <- 18.
   путьВрага.[5].[2].[3] <- 36.
   путьВрага.[5].[2].[4] <- 54.
   путьВрага.[5].[2].[5] <- 72.
   путьВрага.[5].[2].[6] <- 90.
   путьВрага.[5].[2].[7] <- 108.
   путьВрага.[5].[2].[8] <- 126.
   путьВрага.[5].[2].[9] <- 144.
   путьВрага.[5].[2].[10] <- 162.
   путьВрага.[5].[2].[11] <- 180.
   путьВрага.[5].[2].[12] <- 198.
   путьВрага.[5].[2].[13] <- 216.
   путьВрага.[5].[2].[14] <- 234.
   путьВрага.[5].[2].[15] <- 252.
   путьВрага.[5].[2].[16] <- -90.
   путьВрага.[5].[2].[17] <- -72.
   путьВрага.[5].[2].[18] <- -54.
   путьВрага.[5].[2].[19] <- -36.
   путьВрага.[5].[2].[20] <- -18.
   путьВрага.[5].[2].[21] <- 0.

   путьВрага.[5].[2].[22] <- 18.
   путьВрага.[5].[2].[23] <- 36.
   путьВрага.[5].[2].[24] <- 54.
   путьВрага.[5].[2].[25] <- 72.
   путьВрага.[5].[2].[26] <- 90.
   путьВрага.[5].[2].[27] <- 90.


   путьВрага.[5].[3].[1] <- скорость_врагов
   путьВрага.[5].[3].[2] <- 0.95*скорость_врагов
   путьВрага.[5].[3].[3] <- 0.81*скорость_врагов
   путьВрага.[5].[3].[4] <- 0.59*скорость_врагов
   путьВрага.[5].[3].[5] <- 0.31*скорость_врагов
   путьВрага.[5].[3].[6] <- 0.
   путьВрага.[5].[3].[7] <- -0.31*скорость_врагов
   путьВрага.[5].[3].[8] <- -0.59*скорость_врагов
   путьВрага.[5].[3].[9] <- -0.81*скорость_врагов
   путьВрага.[5].[3].[10] <- -0.95*скорость_врагов
   путьВрага.[5].[3].[11] <- -скорость_врагов
   путьВрага.[5].[3].[12] <- -0.95*скорость_врагов
   путьВрага.[5].[3].[13] <- -0.81*скорость_врагов
   путьВрага.[5].[3].[14] <- -0.59*скорость_врагов
   путьВрага.[5].[3].[15] <- -0.31*скорость_врагов
   путьВрага.[5].[3].[16] <- 0.
   путьВрага.[5].[3].[17] <- 0.31*скорость_врагов
   путьВрага.[5].[3].[18] <- 0.59*скорость_врагов
   путьВрага.[5].[3].[19] <- 0.81*скорость_врагов
   путьВрага.[5].[3].[20] <- 0.95*скорость_врагов
   путьВрага.[5].[3].[21] <- скорость_врагов
   путьВрага.[5].[3].[22] <- 0.95*скорость_врагов
   путьВрага.[5].[3].[23] <- 0.81*скорость_врагов
   путьВрага.[5].[3].[24] <- 0.59*скорость_врагов
   путьВрага.[5].[3].[25] <- 0.31*скорость_врагов
   путьВрага.[5].[3].[26] <- 0.
   путьВрага.[5].[3].[27] <- 0.

   путьВрага.[5].[4].[1] <- 0.
   путьВрага.[5].[4].[2] <- 0.31*скорость_врагов
   путьВрага.[5].[4].[3] <- 0.59*скорость_врагов
   путьВрага.[5].[4].[4] <- 0.81*скорость_врагов
   путьВрага.[5].[4].[5] <- 0.95*скорость_врагов
   путьВрага.[5].[4].[6] <- скорость_врагов
   путьВрага.[5].[4].[7] <- 0.95*скорость_врагов
   путьВрага.[5].[4].[8] <- 0.81*скорость_врагов
   путьВрага.[5].[4].[9] <- 0.59*скорость_врагов
   путьВрага.[5].[4].[10] <- 0.31*скорость_врагов
   путьВрага.[5].[4].[11] <- 0.
   путьВрага.[5].[4].[12] <- -0.31*скорость_врагов
   путьВрага.[5].[4].[13] <- -0.59*скорость_врагов
   путьВрага.[5].[4].[14] <- -0.81*скорость_врагов
   путьВрага.[5].[4].[15] <- -0.95*скорость_врагов
   путьВрага.[5].[4].[16] <- -скорость_врагов
   путьВрага.[5].[4].[17] <- -0.95*скорость_врагов
   путьВрага.[5].[4].[18] <- -0.81*скорость_врагов
   путьВрага.[5].[4].[19] <- -0.59*скорость_врагов
   путьВрага.[5].[4].[20] <- -0.31*скорость_врагов
   путьВрага.[5].[4].[21] <- 0.
   путьВрага.[5].[4].[22] <- 0.31*скорость_врагов
   путьВрага.[5].[4].[23] <- 0.59*скорость_врагов
   путьВрага.[5].[4].[24] <- 0.81*скорость_врагов
   путьВрага.[5].[4].[25] <- 0.95*скорость_врагов
   путьВрага.[5].[4].[26] <- скорость_врагов
   путьВрага.[5].[4].[27] <- скорость_врагов

   путьВрага.[6].[0].[0] <- 3.
   путьВрага.[6].[1].[1] <- 1.
   путьВрага.[6].[1].[2] <- 80.
   путьВрага.[6].[1].[3] <- 200.
   путьВрага.[6].[2].[1] <- 0.
   путьВрага.[6].[2].[2] <- 90.
   путьВрага.[6].[2].[3] <- -90.
   путьВрага.[6].[3].[1] <- 0.
   путьВрага.[6].[3].[2] <- 0.
   путьВрага.[6].[3].[3] <- 0.
   путьВрага.[6].[4].[1] <- 0.
   путьВрага.[6].[4].[2] <- скорость_врагов
   путьВрага.[6].[4].[3] <- -скорость_врагов


and создать_уровень1 () =  // this define the behavior of the différent squadron along the time play for level 1
   уровень1.[1] <- Словник()
   уровень1.[1].[1] <- 20    // when timeplay=level1[1][1]
   уровень1.[1].[2] <- 2    // lauch enemy with Path level1[1][2]
   уровень1.[1].[3] <- -10  // at x coordinate level1[1][3]
   уровень1.[1].[4] <- 0   // at y coordinate level1[1][4]
   уровень1.[1].[5] <- 1   // 1 for create enemy at the left side; 2 for the right side of screen
   уровень1.[1].[6] <- 4   // level[1][6] is the number of enemies
   уровень1.[1].[7] <- 1   // type of enemy
   уровень1.[2] <- Словник()
   уровень1.[2].[1] <- 80
   уровень1.[2].[2] <- 6
   уровень1.[2].[3] <- ширинаГри/2
   уровень1.[2].[4] <- -500
   уровень1.[2].[5] <- 1
   уровень1.[2].[6] <- 3
   уровень1.[2].[7] <- 1
   уровень1.[3] <- Словник()
   уровень1.[3].[1] <- 150
   уровень1.[3].[2] <- 0
   уровень1.[3].[3] <- -10
   уровень1.[3].[4] <- 0
   уровень1.[3].[5] <- 1
   уровень1.[3].[6] <- 6
   уровень1.[3].[7] <- 2
   уровень1.[4] <- Словник()
   уровень1.[4].[1] <- 280
   уровень1.[4].[2] <- 4
   уровень1.[4].[3] <- -10
   уровень1.[4].[4] <- 0
   уровень1.[4].[5] <- 1
   уровень1.[4].[6] <- 3
   уровень1.[4].[7] <- 2
   уровень1.[5] <- Словник()
   уровень1.[5].[1] <- 410
   уровень1.[5].[2] <- 6
   уровень1.[5].[3] <- ширинаГри/3
   уровень1.[5].[4] <- -50
   уровень1.[5].[5] <- 1
   уровень1.[5].[6] <- 3
   уровень1.[5].[7] <- 1
   уровень1.[6] <- Словник()
   уровень1.[6].[1] <- 430
   уровень1.[6].[2] <- 6
   уровень1.[6].[3] <- 2*ширинаГри/3
   уровень1.[6].[4] <- -50
   уровень1.[6].[5] <- 2
   уровень1.[6].[6] <- 3
   уровень1.[6].[7] <- 1

   уровень1.[5].[1] <- 500
   уровень1.[5].[2] <- 6
   уровень1.[5].[3] <- ширинаГри/3
   уровень1.[5].[4] <- -50
   уровень1.[5].[5] <- 1
   уровень1.[5].[6] <- 6
   уровень1.[5].[7] <- 2

   уровень1.[6].[1] <- 590
   уровень1.[6].[2] <- 5
   уровень1.[6].[3] <- 100
   уровень1.[6].[4] <- -80
   уровень1.[6].[5] <- 1
   уровень1.[6].[6] <- 3
   уровень1.[6].[7] <- 3
  
   уровень1.[7] <- Словник()
   уровень1.[7].[1] <- 690
   уровень1.[7].[2] <- 6
   уровень1.[7].[3] <- ширинаГри/3
   уровень1.[7].[4] <- -50
   уровень1.[7].[5] <- 2
   уровень1.[7].[6] <- 3
   уровень1.[7].[7] <- 2
   for i= 1 to 10 do
      уровень1.[7+i] <- Словник()
      уровень1.[7+i].[1] <- 700+50*i
      уровень1.[7+i].[2] <- 6
      уровень1.[7+i].[3] <- Математика.ОтриматиВипадковеЧисло(ширинаГри)
      уровень1.[7+i].[4] <- -50 + i
      уровень1.[7+i].[5] <- Математика.ОтриматиВипадковеЧисло(2)
      уровень1.[7+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      уровень1.[7+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)
   уровень1.[18] <- Словник()
   уровень1.[18].[1] <- 1300
   уровень1.[18].[2] <- 1
   уровень1.[18].[3] <- ширинаГри
   уровень1.[18].[4] <- -10
   уровень1.[18].[5] <- 2
   уровень1.[18].[6] <- 6
   уровень1.[18].[7] <- 2

   for i=1 to 10 do
      уровень1.[18+i] <- Словник()
      уровень1.[18+i].[1] <- 1330+50*i
      уровень1.[18+i].[2] <- 4+Математика.ОтриматиВипадковеЧисло(2)
      уровень1.[18+i].[3] <- Математика.ОтриматиВипадковеЧисло(50)
      уровень1.[18+i].[4] <- i
      уровень1.[18+i].[5] <- 1
      уровень1.[18+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      уровень1.[18+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

   for i= 1 to 10 do
      уровень1.[28+i] <- Словник()
      уровень1.[28+i].[1] <- 1900+50*i
      уровень1.[28+i].[2] <- 4+Математика.ОтриматиВипадковеЧисло(2)
      уровень1.[28+i].[3] <- -Математика.ОтриматиВипадковеЧисло(50)
      уровень1.[28+i].[4] <- i
      уровень1.[28+i].[5] <- 1
      уровень1.[28+i].[6] <- Математика.ОтриматиВипадковеЧисло(3)
      уровень1.[28+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

   for i= 1 to 10 do
     уровень1.[38+i] <- Словник()
     уровень1.[38+i].[1] <- 2450+100*i
     уровень1.[38+i].[2] <- 6
     уровень1.[38+i].[3] <- Математика.ОтриматиВипадковеЧисло(ширинаГри)
     уровень1.[38+i].[4] <- -50 + i
     уровень1.[38+i].[5] <- Математика.ОтриматиВипадковеЧисло(2)
     уровень1.[38+i].[6] <- Математика.ОтриматиВипадковеЧисло(5)
     уровень1.[38+i].[7] <- Математика.ОтриматиВипадковеЧисло(2)

//Presentation
// todo

// Начать игру
Инициализация()
определить_пути()
//создать_врагов1()
Игра()
printfn "ИГРА ОКОНЧЕНА"