open Бiблiотека

let гш = float ГрафичнеВікно.Ширина
let гв = float ГрафичнеВікно.Высота
let ракетка = Фигуры.ДодатиПрямокутник(120, 12)
let шарик = Фигуры.ДобавитьЭллипс(16, 16)
let mutable счет = 0

let НаДвижениеМыши () =
  let ракеткаX = ГрафичнеВікно.МишаX
  Фигуры.Перемістити(ракетка, ракеткаX - 60.0, гв - 12.0)

let НапечататьСчет () =
  // Clear the score first and then draw the real score text
  ГрафичнеВікно.ЦветКисти <- Кольори.White
  ГрафичнеВікно.ЗаполнитьПрямоугольник(10, 10, 200, 20)
  ГрафичнеВікно.ЦветКисти <- Кольори.Black
  ГрафичнеВікно.НарисоватьТекст(10, 10, "Score: " + счет.ToString())

ГрафичнеВікно.РозмірШрифта <- 14.0
ГрафичнеВікно.МышьПеремещена <- Callback(НаДвижениеМыши)

НапечататьСчет()
Звук.ИгратьЗвонок (*AndWait*) ()

let mutable x = 0.0
let mutable y = 0.0
let mutable дельтаX = 1.0
let mutable дельтаY = 2.0

while (y < гв) do
  x <- x + дельтаX
  y <- y + дельтаY
  
  if (x >= гш - 16.0 || x <= 0.0) then
    дельтаX <- -дельтаX 
  if (y <= 0.0) then
    дельтаY <- -дельтаY
 
  let ракX = Фигуры.ПолучитьЛево(ракетка)
  if (y = гв - 28.0 && x >= ракX && x <= ракX + 120.0) then
    //Звук.ИгратьЩелчек()
    счет <- счет + 10
    НапечататьСчет()
    дельтаY <- -дельтаY  

  Фигуры.Перемістити(шарик, x, y)
  Програма.Затримка(15)
  
ГрафичнеВікно.ПоказатьСообщение("Ваш счет: " + счет.ToString(), "Ракетка")
