open Бібліотека

let гш = float ГрафичнеВікно.Ширина
let гв = float ГрафичнеВікно.Висота
let ракетка = Фігури.ДодатиПрямокутник(120, 12)
let кулька = Фігури.ДодатиЭллипс(16, 16)
let mutable рахунок = 0

let НаПереміщенняМиші () =
  let ракеткаX = ГрафичнеВікно.МишаX
  Фігури.Перемістити(ракетка, ракеткаX - 60.0, гв - 12.0)

let НадрукуватиРахунок () =
  // Спочатку очистімо рахунок, а потім намалюємо справжній текст рахунка
  ГрафичнеВікно.КолірПензлика <- Кольори.White
  ГрафичнеВікно.ЗаповнитиПрямокутник(10, 10, 200, 20)
  ГрафичнеВікно.КолірПензлика <- Кольори.Black
  ГрафичнеВікно.НамалюватиТекст(10, 10, "Рахунок: " + рахунок.ToString())

ГрафичнеВікно.РозмірШрифта <- 14.0
ГрафичнеВікно.МишаПереміщена <- Callback(НаПереміщенняМиші)

НадрукуватиРахунок()
Звук.ГратиДзвінок (*AndWait*) ()

let mutable x = 0.0
let mutable y = 0.0
let mutable дельтаX = 1.0
let mutable дельтаY = 2.0

while (y < гв) do
  x <- x + дельтаX
  y <- y + дельтаY
  
  if (x >= гш - 16.0 || x <= 0.0) then
    дельтаX <- -дельтаX 
  if (y <= 0.0) then
    дельтаY <- -дельтаY
 
  let ракX = Фігури.ОтриматиЛіво(ракетка)
  if (y = гв - 28.0 && x >= ракX && x <= ракX + 120.0) then
    //Звук.ГратиКлацання()
    рахунок <- рахунок + 10
    НадрукуватиРахунок()
    дельтаY <- -дельтаY  

  Фігури.Перемістити(кулька, x, y)
  Програма.Затримка(15)
  
ГрафичнеВікно.ПоказатиПовідомлення("Ваш рахунок: " + рахунок.ToString(), "Ракетка")
