#if INTERACTIVE
#r "./bin/debug/Xwt.dll"
#r "./bin/debug/FunSharp.dll"
#endif

open Библиотека

type System.Collections.Generic.Dictionary<'TKey,'TValue> with
   member this.GetOrDefault(ключ:'TKey,значение:'TValue) =
      match this.TryGetValue(ключ) with
      | true, значение -> значение
      | false, _ -> значение


// 1942 like Game ID: KJW676
// Copyright (C) 2010, Laurent GIRAUD laurent.giraud1@free.fr
// License: MIT license http://www.opensource.org/licenses/mit-license.php
// most of Game artwork created by Ari Feldman ari@arifeldman.com"
// and others grabed from free web sprites

let пулиСинхр = obj()

//-------------------------
// or load from web url
//let Путь= "http://imode.free.fr/images1942/"
let Путь = ""
//-------------------------

// Game area controls
let ширинаИгры  = 640
let высотаИгры = 480
let fps = 50
let скф = 2 //backgroundspeed
let mutable Player_Lives = 10
let клвостровов = 5 //nomber of island images
let количествоостровов = 5 //nomber of island in the wall field

// Заголовок окна
let заголовокИгры = "1942, Счет: "

ГрафическоеОкно.Спрятать()
ГрафическоеОкно.Заголовок <- заголовокИгры + "0"
ГрафическоеОкно.CanResize <- false
ГрафическоеОкно.Ширина <- ширинаИгры
ГрафическоеОкно.Высота <- высотаИгры

// Global variables

let mutable игрок = "<shape name>"
let mutable ракеткаX = 0
let mutable ракеткаY = 0
let mutable фон = "<shape name>"

// addImage in the right order is needed to define the shapes depth
let остров4 = СписокИзображений.ЗагрузитьИзображение(Путь + "island4.png")
let остров1= СписокИзображений.ЗагрузитьИзображение(Путь + "island1.png")
let остров2= СписокИзображений.ЗагрузитьИзображение(Путь + "island2.png")
let остров3= СписокИзображений.ЗагрузитьИзображение(Путь + "island3.png")
let остров5= СписокИзображений.ЗагрузитьИзображение(Путь + "island5.png")
let игрок0 = СписокИзображений.ЗагрузитьИзображение(Путь + "myplane1.png")
let background = СписокИзображений.ЗагрузитьИзображение(Путь + "fond.png")
let пуля0 = СписокИзображений.ЗагрузитьИзображение(Путь + "bullet.png")
let враг= СписокИзображений.ЗагрузитьИзображение(Путь + "enemy1.png")
let враг2 = СписокИзображений.ЗагрузитьИзображение(Путь + "enemy2.png")
let взрв_врага1=СписокИзображений.ЗагрузитьИзображение(Путь + "explo1.png")
let взрв_врага2=СписокИзображений.ЗагрузитьИзображение(Путь + "explo2.png")
let взрв_игрока=СписокИзображений.ЗагрузитьИзображение(Путь + "explo2.png")
let Enemy_bullet=СписокИзображений.ЗагрузитьИзображение(Путь + "E_bullet.png")
let ``end`` = СписокИзображений.ЗагрузитьИзображение(Путь + "End.png")

let массив_Врагов = Словарь() // Array that contain all the enemies
let enemy_TimeLine = Словарь()
let линия_врага = Словарь()
let позX_Врага = Словарь()
let позY_Врага = Словарь()
let enemy_PathNBR = Словарь()

let mutable enemy_Nbr = 6
let mutable количество_Врагов = 0
let enemy_speed = 4.0
//enemy_NextRemove = 1
let enemy_Life = 10
let размер_игрока= 65
let enemy_size = 32
let enemy_ammo_size = 8
let player_bullet_size = 32

let массив_Островов = Словарь()

let Пули_Игрока = Словарь()
let ВозрастПули_Игрока = Словарь()
ВозрастПули_Игрока.[1] <- 0
let Игрок_МаксПуль = 50
let mutable Игрок_КоличествоПуль = 0
let СкоростьПули_Игрока = float скф + 4.0
let Player_AmmoLife = 100

let mutable ВыстрелX = nan
let mutable ВыстрелY = nan

let mutable incx = 0  // X-axis increment for background
let mutable incy = 0  // Y-axis increment for background
let mutable incbx = 0.0 // increment for bullets and all objects on X
let mutable incby = 0.0 // increment for bullets and all objects on Y

let Пули_Врага = Словарь()
let ВозрастПули_Врага = Словарь()
ВозрастПули_Врага.[1] <- 0
let Угол_Пуль_Врага= Словарь()
let Враг_МаксПуль = 30
let mutable КоличествоПуль_Врага = 0
let Скорость_ПульВрага = скф + 4
let Enemy_AmmoLife = 50
let Enemy_Agresivity = 200
let mutable Выстрел_ВрагаX = 0
let mutable Выстрел_ВрагаY = 0

let mutable TimePlay = 0

let mutable pathNBR = 1
let mutable enemyPosX1 = 0
let mutable enemyPosY1 = 0
let mutable enemy_type = 0

let mutable score = 0

let позОстровов = Словарь<int,Словарь<int,int>>()
let incislandx = Словарь<int,int>()
let incislandy = Словарь<int,int>()
let уровень1 = Словарь<int,Словарь<int,int>>()
let путьВрага = Словарь<int, Словарь<int, Словарь<int,float>>>()
let позx = Словарь<int,_>()
let позy = Словарь<int,_>()

// Setup world
let rec Инициализация() =
   ГрафическоеОкно.Спрятать()

   Мышь.СкрытьКурсор()

   // every enemy in tha array has 5 informations
   // TimeLine: each enemy has its own timeline
   // PathNBR: the precalculated path defineing the movement
   // the movement is decomposed in LineNbr differents lines
   // each line is define in the enemy_path table with rotation, deltaY and deltaY
   // PositonX, PositonY: position in space
   //
   //

   ПозицииОстровов()
   создать_уровень1()

   фон <- Фигуры.ДобавитьИзображение(background)
   массив_Островов.[1] <- Фигуры.ДобавитьИзображение(остров1)
   массив_Островов.[2] <- Фигуры.ДобавитьИзображение(остров2)
   массив_Островов.[3] <- Фигуры.ДобавитьИзображение(остров3)
   массив_Островов.[4] <- Фигуры.ДобавитьИзображение(остров4)
   массив_Островов.[5] <- Фигуры.ДобавитьИзображение(остров5)
   for i = 6 to количествоостровов do
      массив_Островов.[i] <- массив_Островов.[Math.Остаток(i,4)]

   игрок <- Фигуры.ДобавитьИзображение(игрок0)
   ГрафическоеОкно.РазмерШрифта <- 20.0
   ГрафическоеОкно.ЦветФона <- Цвета.Gray
   ГрафическоеОкно.ЦветПера <- Цвета.Yellow



// Главная игровая процедура
and Игра () =
   ГрафическоеОкно.Показать()

   // Main loop
   let play = 1
   let pause = 0
   incx <- 0  // X-axis increment for background
   incy <- 0  // Y-axis increment for background
   incbx <- 0.0 // increment for bullets and all objects on X
   incby <- 0.0 // increment for bullets and all objects on Y
   let mutable squadron = 1
   // Island initial position 
   let mutable j=0

   for i=1 to количествоостровов do
      j <- Math.Остаток(i,6)
      позy.[i] <- позОстровов.[j].[2]
      позx.[i] <- позОстровов.[j].[3]
      incislandx.[i] <- 0
      incislandy.[i] <- 0   
   TimePlay <- 0
   Фигуры.Переместить(игрок, ширинаИгры/2 , высотаИгры - 80 )
   while (play = 1) do
      Программа.Задержка(1000/fps)
      TimePlay <- TimePlay + 1

      if (pause = 0) then
         if (TimePlay = уровень1.[squadron].[1]) then

            pathNBR <- уровень1.[squadron].[2]
            enemyPosX1 <- уровень1.[squadron].[3]  //X position
            enemyPosY1 <- уровень1.[squadron].[4]  //Y position
            enemy_Nbr <- уровень1.[squadron].[6]
            enemy_type <- уровень1.[squadron].[7]
            if (уровень1.[squadron].[5]=1) then
               create_enemies_left()
            else
               create_enemies_right()         
            squadron <- squadron + 1
                 
         if (TimePlay > 4000) then
            Фигуры.Переместить(Фигуры.ДобавитьИзображение(``end``), 230,200)
            Программа.Задержка(5000)
            Программа.Закончить()     
         lock пулиСинхр (fun () ->  
            переместитьвсе()
         )

         ГрафическоеОкно.МышьПеремещена <- Callback(НаДвижениеМыши)
         ГрафическоеОкно.МышьНажата <- Callback(НаНажатиеМыши)

         ПостаретьПулю_Игрока()

and НаДвижениеМыши () =
   ракеткаX <- int ГрафическоеОкно.МышьX - размер_игрока / 2
   ракеткаY <- int ГрафическоеОкно.МышьY - размер_игрока

   if (ракеткаX < 0) then
      ракеткаX <- 0   
   Фигуры.Переместить(игрок, ракеткаX , ракеткаY )

and НаНажатиеМыши () =
   ВыстрелX <- ГрафическоеОкно.МышьX - 15.0 // in order to be from the neck of the plane
   ВыстрелY <- ГрафическоеОкно.МышьY - 80.0
   Огонь()

and переместитьвсе () =
   incbx <- 0.0
   incby <- 0.0
   ГрафическоеОкно.Заголовок <- заголовокИгры + score.ToString() + " Lives:" + Player_Lives.ToString()

   if (ракеткаX > (ширинаИгры-62) ) then
      incx <- incx - скф
      incbx <- incbx - float скф
      for i=1 to количествоостровов do
         incislandx.[i] <- incislandx.[i] - скф    
      if (incx = -32 ) then
         incx <- 0            
   if (ракеткаX < 64 ) then
      incx <- incx + скф
      incbx <- incbx + float скф
      for i=1 to количествоостровов do
         incislandx.[i] <- incislandx.[i] + скф          
      if (incx = 32 ) then
         incx <- 0
   Фигуры.Переместить(фон,incx - 32 ,incy - 32)

   for i=1 to количествоостровов do
      let islx = позx.[i]+incislandx.[i]
      let isly = позy.[i]+incislandy.[i]
      Фигуры.Переместить(массив_Островов.[i],islx,isly)

   incy <- incy + скф
   incby <- incby + float скф
   for i=1 to количествоостровов do
      incislandy.[i] <- incislandy.[i] + скф    

   if (incy = 32) then
      incy <- 0   

   for i=1 to количествоостровов do
      if ((позy.[i]+incislandy.[i]) > (высотаИгры+15)) then // relaunch island if no more visible
         let R = int (Math.Округлить(float (Math.ВзятьСлучайноеЧисло(клвостровов))))
         let AA = Math.Остаток(TimePlay,6)
         // give new coordinates
         позx.[i] <- позОстровов.[AA].[2]
         позy.[i] <- позОстровов.[AA].[3]
         Фигуры.Переместить(массив_Островов.[R],позx.[i],позy.[i])
         incislandy.[i] <- 0
         incislandx.[i] <- 0         
   // Move playerammo
   for i = 1 to Игрок_КоличествоПуль do
      let имяФигуры = Пули_Игрока.[i]
      let Пуля_Игрокаx = Фигуры.ПолучитьЛево(имяФигуры) + incbx
      let Пуля_Игрокаy = Фигуры.ПолучитьВерх(имяФигуры) - СкоростьПули_Игрока
      Фигуры.Переместить(имяФигуры, Пуля_Игрокаx, Пуля_Игрокаy)
      let старыйВозраст = ВозрастПули_Игрока.GetOrDefault(i, 0)
      ВозрастПули_Игрока.[i] <- старыйВозраст + 1
   // Move Enemy ammo
   for iea = 1 to КоличествоПуль_Врага do
      let dx = (Math.Sin((Угол_Пуль_Врага.[iea] )) * float Скорость_ПульВрага)
      let dy = (Math.Cos((Угол_Пуль_Врага.[iea] )) * float Скорость_ПульВрага)
      let Пуля_Врагаx = Фигуры.ПолучитьЛево(Пули_Врага.[iea]) + dx + incbx
      let Пуля_Врагаy = Фигуры.ПолучитьВерх(Пули_Врага.[iea]) + dy + incby * 0.1
      Фигуры.Переместить(Пули_Врага.[iea], Пуля_Врагаx, Пуля_Врагаy)
      let oldAge =
         match ВозрастПули_Врага.TryGetValue(iea) with
         | true, n -> n
         | false, _ -> 0
      ВозрастПули_Врага.[iea] <- oldAge + 1

   // move ennemies
   let mutable i=1
   while i <= количество_Врагов do
      // move as TimeLine and Path say
      let eNBR = enemy_PathNBR.[i]
      let mutable uu = линия_врага.[i]
      let Время = enemy_TimeLine.[i]
      let etl = путьВрага.[eNBR].[1].GetOrDefault(uu, 0.0)  //enemy own timeLine
      if (Время=etl) then  //it's time to rotate enemy
         let rr = путьВрага.[eNBR].[2].GetOrDefault(uu+1, 0.0)            
         Фигуры.Повернуть(массив_Врагов.[i],rr)
      if (Время > etl)  then
         uu <- uu+1
         линия_врага.[i] <- uu    // next line for enemy move      
      let xx1 = позX_Врага.[i]
      let yy1 = позY_Врага.[i]
      let xx = float xx1+путьВрага.[eNBR].[3].GetOrDefault(uu, 0.0)+incbx
      let yy = float yy1+путьВрага.[eNBR].[4].GetOrDefault(uu, 0.0)+incby*0.1
      // Randomly fire-enemy
      if (Math.ВзятьСлучайноеЧисло(Enemy_Agresivity)=1) then
         Выстрел_ВрагаX <- xx1 + 16
         Выстрел_ВрагаY <- yy1 + 4
         if (yy1 > 0 && xx1 > 0 && yy1 < высотаИгры && xx1 < ширинаИгры) then
            // this avoid enemy fire from outside the screen
            выстрел_Врага()

      Фигуры.Переместить(массив_Врагов.[i],xx,yy)
      позX_Врага.[i] <- int xx
      позY_Врага.[i] <- int yy
      enemy_TimeLine.[i] <- Время + 1.0
      if ((float uu > путьВрага.[eNBR].[0].[0]) && (Время > etl)) then // if last timelife remove the enemy sprite 
         let next_enemy_remove = i
         удалить_врага(next_enemy_remove)      
      
      Столкновение_ипв()
      Столкновения_ви()

      i <- i + 1
      
and УдалитьПулю_Игрока (player_Ammo_nextRemove) =
   Фигуры.Удалить(Пули_Игрока.[player_Ammo_nextRemove])
   for iz = player_Ammo_nextRemove to Игрок_КоличествоПуль - 1 do
       Пули_Игрока.[iz] <- Пули_Игрока.[iz+1]
       ВозрастПули_Игрока.[iz] <- ВозрастПули_Игрока.[iz+1]
   Пули_Игрока.Remove(Игрок_КоличествоПуль) |> ignore
   ВозрастПули_Игрока.Remove(Игрок_КоличествоПуль) |> ignore
   Игрок_КоличествоПуль <- Игрок_КоличествоПуль - 1

and УдалитьПулю_Врага (enemy_Ammo_nextRemove) =
   Фигуры.Удалить(Пули_Врага.[enemy_Ammo_nextRemove])
   for irea = enemy_Ammo_nextRemove to КоличествоПуль_Врага - 1 do
       Пули_Врага.[irea] <- Пули_Врага.[irea+1]      
       ВозрастПули_Врага.[irea] <-
         if (irea+1) < ВозрастПули_Врага.Count then ВозрастПули_Врага.[irea+1] else 0
       Угол_Пуль_Врага.[irea] <- Угол_Пуль_Врага.[irea+1]
   Пули_Врага.Remove(КоличествоПуль_Врага) |> ignore
   ВозрастПули_Врага.Remove(КоличествоПуль_Врага) |> ignore
   Угол_Пуль_Врага.Remove(КоличествоПуль_Врага) |> ignore
   КоличествоПуль_Врага <- КоличествоПуль_Врага - 1

and Огонь () =
   lock пулиСинхр (fun () -> 
      // Remove additional player Ammo
      while (Игрок_КоличествоПуль > Игрок_МаксПуль ) do
         УдалитьПулю_Игрока(1)

      // Add the player Ammo
      Игрок_КоличествоПуль <- Игрок_КоличествоПуль + 1
      Пули_Игрока.[Игрок_КоличествоПуль] <- Фигуры.ДобавитьИзображение(пуля0)
      Фигуры.Переместить(Пули_Игрока.[Игрок_КоличествоПуль], ВыстрелX, ВыстрелY)
   )

and выстрел_Врага () =
   // Remove additional Enemy Ammo
   while (КоличествоПуль_Врага > (Враг_МаксПуль - 1)) do      
      УдалитьПулю_Врага(1)

   // Add the Enemy Ammo
   КоличествоПуль_Врага <- КоличествоПуль_Врага + 1
   Пули_Врага.[КоличествоПуль_Врага] <- Фигуры.ДобавитьИзображение(Enemy_bullet)
   Угол_Пуль_Врага.[КоличествоПуль_Врага] <- Math.ArcTan(float(ракеткаX- Выстрел_ВрагаX+размер_игрока/2)/float(ракеткаY-Выстрел_ВрагаY))
   let shape = Пули_Врага.[КоличествоПуль_Врага]
   Фигуры.Переместить(shape, Выстрел_ВрагаX, Выстрел_ВрагаY)

//Check playerammo age
and ПостаретьПулю_Игрока () =
   while (ВозрастПули_Игрока.Count > 0 && ВозрастПули_Игрока.[1] > Player_AmmoLife) do
      УдалитьПулю_Игрока(1)  

// Check enemy ammo age
and ПостаретьПулю_Врага () =
   while (ВозрастПули_Врага.Count > 0 && ВозрастПули_Врага.[1] > Enemy_AmmoLife) do
      УдалитьПулю_Врага(1)

and удалить_врага (next_enemy_remove) =
   Фигуры.Удалить(массив_Врагов.[next_enemy_remove])
   // Remove all references from the arrays
   for ii = next_enemy_remove to количество_Врагов - 1 do
      массив_Врагов.[ii] <- массив_Врагов.[ii+1]
      линия_врага.[ii] <- линия_врага.[ii+1]
      позX_Врага.[ii] <- позX_Врага.[ii+1]
      позY_Врага.[ii] <- позY_Врага.[ii+1]
      enemy_TimeLine.[ii] <- enemy_TimeLine.[ii+1]
      enemy_PathNBR.[ii] <- enemy_PathNBR.[ii+1]
   массив_Врагов.Remove(количество_Врагов) |> ignore
   линия_врага.Remove(количество_Врагов) |> ignore
   позX_Врага.Remove(количество_Врагов) |> ignore
   позY_Врага.Remove(количество_Врагов) |> ignore
   enemy_TimeLine.Remove(количество_Врагов) |> ignore
   enemy_PathNBR.Remove(количество_Врагов) |> ignore
   количество_Врагов <- количество_Врагов - 1

and create_enemies_left () =

   let mutable TimeLine1 = 0.0
   for i=1 to enemy_Nbr do
      количество_Врагов <- количество_Врагов + 1
      enemy_PathNBR.[количество_Врагов] <- pathNBR
      if (enemy_type = 2) then
         массив_Врагов.[количество_Врагов] <- Фигуры.ДобавитьИзображение(враг2)
      else
         массив_Врагов.[количество_Врагов] <- Фигуры.ДобавитьИзображение(враг)
      линия_врага.[количество_Врагов] <- 1
      позX_Врага.[количество_Врагов] <- enemyPosX1
      позY_Врага.[количество_Врагов] <- enemyPosY1
      enemy_TimeLine.[количество_Врагов] <- TimeLine1

      enemyPosX1 <- enemyPosX1 - 64  // distance between ennemies
      TimeLine1 <- TimeLine1 - 64.0 / float enemy_speed   
   for i=(количество_Врагов-enemy_Nbr+1) to количество_Врагов do
      let xxx = позX_Врага.[i]
      let yyy = позY_Врага.[i]
      Фигуры.Переместить(массив_Врагов.[i],xxx,yyy)

and create_enemies_right () =

   let mutable TimeLine1 = 0.0
   for i=1 to enemy_Nbr do
      количество_Врагов <- количество_Врагов + 1
      enemy_PathNBR.[количество_Врагов] <- pathNBR
      массив_Врагов.[количество_Врагов] <- Фигуры.ДобавитьИзображение(враг)
      линия_врага.[количество_Врагов] <- 1
      позX_Врага.[количество_Врагов] <- enemyPosX1
      позY_Врага.[количество_Врагов] <- enemyPosY1
      enemy_TimeLine.[количество_Врагов] <- float TimeLine1

      enemyPosX1 <- enemyPosX1 + 64 // distance between ennemies
      TimeLine1 <- TimeLine1 - 64.0 / enemy_speed
         
   for i=(количество_Врагов-enemy_Nbr+1) to количество_Врагов do
      let xxx=позX_Врага.[i]
      let yyy=позY_Врага.[i]
      Фигуры.Переместить(массив_Врагов.[i],xxx,yyy)
   
and Столкновение_ипв () =  // для пуль-игрока и врагов

   let mutable i1 = 1
   while i1 <= Игрок_КоличествоПуль do
      // player bullet position
      let shapeName = Пули_Игрока.[i1]
      let Player_Ammox = int (Фигуры.ПолучитьЛево(shapeName))
      let Player_Ammoy = int (Фигуры.ПолучитьВерх(shapeName))
      let px1=Player_Ammox+player_bullet_size/3   // in order to have a more precise collison than the bullet image size
      let py1=Player_Ammoy+player_bullet_size/3
      let px2=px1+2*player_bullet_size/3
      let py2=py1+2*player_bullet_size/3

      let mutable ammoRemoved = false
      let mutable i2 = 1
      while i2 <= количество_Врагов do
         // enemy position 
         let ax1=позX_Врага.[i2]+enemy_size/4
         let ay1=позY_Врага.[i2]+enemy_size/4

         let ax2=ax1+3*enemy_size/4
         let ay2=ay1+3*enemy_size/4

         if ( (ax1 < px1 && ax2 > px1) || (ax1 < px2 && ax2 > px2) ) then
            if ( (ay1 < py1 && ay2 > py1) || (ay1 < py2 && ay2 > py2) ) then
               // collision between enemy nbr i2 and player bullet i
               // remove bullet i and animate explosion and remove enemy i2
               if not ammoRemoved then 
                  УдалитьПулю_Игрока(i1)
                  ammoRemoved <- true
               let next_enemy_remove = i2
               удалить_врага(next_enemy_remove)
               // begin animation for explosion at coordinate ax1, ay1
               let toto = Фигуры.ДобавитьИзображение(взрв_врага1)
               Фигуры.Переместить(toto,ax1,ay1)
               Программа.Задержка(30)
               Фигуры.Удалить(toto)
               let toto = Фигуры.ДобавитьИзображение(взрв_врага2)
               Фигуры.Переместить(toto,ax1,ay1)
               Программа.Задержка(30)
               Фигуры.Удалить(toto)
               score <- score + 100

         i2 <- i2 + 1

      
      i1 <- i1 + 1

and Столкновения_ви () =   // для врагов и игрока 
   let px1 = int (Фигуры.ПолучитьЛево(игрок))
   let py1 = int (Фигуры.ПолучитьВерх(игрок))
   let px2 = px1 + размер_игрока
   let py2 = py1 + размер_игрока

   //Фигуры.Move(Фигуры.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   let mutable i2 = 1
   while i2 <= количество_Врагов do
      // enemy position 
      let ax1=позX_Врага.[i2]
      let ay1=позY_Врага.[i2]

      let ax2=ax1+enemy_size
      let ay2=ay1+enemy_size
      //Фигуры.Move(Фигуры.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      if ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) then
         if ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) then
            // collision between enemy nbr i2 and player 
            // animate explosion and decrease lives            
            удалить_врага(i2)
            // begin animation for explosion at coordinate ax1, ay1
            let toto = Фигуры.ДобавитьИзображение(взрв_врага1)
            Фигуры.Переместить(toto,ax1,ay1)
            Программа.Задержка(30)
            Фигуры.Удалить(toto)
            let toto = Фигуры.ДобавитьИзображение(взрв_игрока)
            Фигуры.Переместить(toto,ax1,ay1)
            Программа.Задержка(300)
            Фигуры.Удалить(toto)
            Player_Lives <- Player_Lives - 1
            if (Player_Lives = 0) then
               Программа.Закончить()

      i2 <- i2 + 1

   let px1 = ракеткаX
   let py1 = ракеткаY
   let px2 = px1 + размер_игрока
   let py2 = py1 + размер_игрока
   // Фигуры.Move(Фигуры.AddRectangle(px2-px1 ,py2-py1), px1, py1)
   
   let mutable i3 = 1
   while i3 <= КоличествоПуль_Врага do
      // позиция врага 

      let ax1=int (Фигуры.ПолучитьЛево(Пули_Врага.[i3]))
      let ay1=int (Фигуры.ПолучитьВерх(Пули_Врага.[i3]))

      let ax2=ax1+enemy_ammo_size
      let ay2=ay1+enemy_ammo_size
      //Фигуры.Move(Фигуры.AddRectangle(ax2-ax1 ,ay2-ay1), ax1, ay1) 

      if ( (px1 < ax1 && px2 > ax1) || (px1 < ax2 && px2 > ax2) ) then
         if ( (py1 < ay1 && py2 > ay1) || (py1 < ay2 && py2 > ay2) ) then
            // collision between enemy ammo nbr i3 and player 
            // animate explosion and decrease lives
            УдалитьПулю_Врага(i3)

            // begin animation for explosion at coordinate ax1, ay1
            let toto = Фигуры.ДобавитьИзображение(взрв_врага1)
            Фигуры.Переместить(toto,ракеткаX+ размер_игрока/2,ракеткаY+ размер_игрока/2)
            Программа.Задержка(30)
            Фигуры.Удалить(toto)
            let toto = Фигуры.ДобавитьИзображение(взрв_игрока)
            Фигуры.Переместить(toto,ракеткаX+ размер_игрока/2,ракеткаY+ размер_игрока/2)
            Программа.Задержка(300)
            Фигуры.Удалить(toto)
            Player_Lives <- Player_Lives - 1
            if (Player_Lives = 0) then
               Программа.Закончить()

      i3 <- i3 + 1

and ПозицииОстровов () =
   // island positions, avoid randomGeneration and islands overlap
   позОстровов.[0] <- Словарь()
   позОстровов.[0].[1] <- 1
   позОстровов.[0].[2] <- 0
   позОстровов.[0].[3] <- -150
   позОстровов.[1] <- Словарь()
   позОстровов.[1].[1] <- 1
   позОстровов.[1].[2] <- - int (Math.Округлить(float ширинаИгры/2.0))
   позОстровов.[1].[3] <- -150
   позОстровов.[2] <- Словарь()
   позОстровов.[2].[1] <- 2
   позОстровов.[2].[2] <- -2 * int (Math.Округлить(float ширинаИгры/3.0))
   позОстровов.[2].[3] <- -150
   позОстровов.[3] <- Словарь()
   позОстровов.[3].[1] <- 1
   позОстровов.[3].[2] <- 2 * int (Math.Округлить(float ширинаИгры/3.0))
   позОстровов.[3].[3] <- -150
   позОстровов.[4] <- Словарь()
   позОстровов.[4].[1] <- 2
   позОстровов.[4].[2] <- ширинаИгры
   позОстровов.[4].[3] <- -150
   позОстровов.[5] <- Словарь()
   позОстровов.[5].[1] <- 3
   позОстровов.[5].[2] <- int (Math.Округлить(float ширинаИгры/3.0))
   позОстровов.[5].[3] <- -150
   позОстровов.[6] <- Словарь()
   позОстровов.[6].[1] <- 3
   позОстровов.[6].[2] <- -ширинаИгры
   позОстровов.[6].[3] <- -150

and определить_пути () =
   for i = 0 to 6 do
      путьВрага.[i] <- Словарь()
      for j = 0 to 4 do 
         путьВрага.[i].[j] <- Словарь()

   путьВрага.[0].[0].[0] <- 3.   // nbr of strait lines of path
   путьВрага.[0].[1].[1] <- 30.  // from 0 to this in timeline
   путьВрага.[0].[1].[2] <- 100. // from this to next in timeline
   путьВрага.[0].[1].[3] <- 400. // sprite goes up

   путьВрага.[0].[2].[1] <- 0.   // first line rotation = 0
   путьВрага.[0].[2].[2] <- 45.  // second line rotation = 45
   путьВрага.[0].[2].[3] <- 45.

   путьВрага.[0].[3].[1] <- enemy_speed // first line x movment
   путьВрага.[0].[3].[2] <- enemy_speed // second line x movment
   путьВрага.[0].[3].[3] <- enemy_speed // third line ...

   путьВрага.[0].[4].[1] <- 0. // first line y movment
   путьВрага.[0].[4].[2] <- enemy_speed
   путьВрага.[0].[4].[3] <- enemy_speed
   // ---------- second pat
   путьВрага.[1].[0].[0] <- 4.
   путьВрага.[1].[1].[1] <- 1.
   путьВрага.[1].[1].[2] <- 1.
   путьВрага.[1].[1].[3] <- 100.
   путьВрага.[1].[1].[4] <- 400.

   путьВрага.[1].[2].[1] <- 180.
   путьВрага.[1].[2].[2] <- 135.
   путьВрага.[1].[2].[3] <- 135.
   путьВрага.[1].[2].[4] <- 90.

   путьВрага.[1].[3].[1] <- -enemy_speed
   путьВрага.[1].[3].[2] <- -enemy_speed
   путьВрага.[1].[3].[3] <- -enemy_speed
   путьВрага.[1].[3].[4] <- 0.

   путьВрага.[1].[4].[1] <- 0.
   путьВрага.[1].[4].[2] <- 0.
   путьВрага.[1].[4].[3] <- enemy_speed
   путьВрага.[1].[4].[4] <- enemy_speed
   // round r=5
   путьВрага.[2].[0].[0] <- 21.
   путьВрага.[2].[1].[1] <- 50.
   путьВрага.[2].[1].[2] <- 55.
   путьВрага.[2].[1].[3] <- 60.
   путьВрага.[2].[1].[4] <- 65.
   путьВрага.[2].[1].[5] <- 70.
   путьВрага.[2].[1].[6] <- 75.
   путьВрага.[2].[1].[7] <- 80.
   путьВрага.[2].[1].[8] <- 85.
   путьВрага.[2].[1].[9] <- 90.
   путьВрага.[2].[1].[10] <- 95.
   путьВрага.[2].[1].[11] <- 100.
   путьВрага.[2].[1].[12] <- 105.
   путьВрага.[2].[1].[13] <- 110.
   путьВрага.[2].[1].[14] <- 115.
   путьВрага.[2].[1].[15] <- 120.
   путьВрага.[2].[1].[16] <- 125.
   путьВрага.[2].[1].[17] <- 130.
   путьВрага.[2].[1].[18] <- 135.
   путьВрага.[2].[1].[19] <- 140.
   путьВрага.[2].[1].[20] <- 145.
   путьВрага.[2].[1].[21] <-350.
   путьВрага.[2].[2].[1] <- 0.
   путьВрага.[2].[2].[2] <- 18.
   путьВрага.[2].[2].[3] <- 36.
   путьВрага.[2].[2].[4] <- 54.
   путьВрага.[2].[2].[5] <- 72.
   путьВрага.[2].[2].[6] <- 90.
   путьВрага.[2].[2].[7] <- 108.
   путьВрага.[2].[2].[8] <- 126.
   путьВрага.[2].[2].[9] <- 144.
   путьВрага.[2].[2].[10] <- 162.
   путьВрага.[2].[2].[11] <- 180.
   путьВрага.[2].[2].[12] <- 198.
   путьВрага.[2].[2].[13] <- 216.
   путьВрага.[2].[2].[14] <- 234.
   путьВрага.[2].[2].[15] <- 252.
   путьВрага.[2].[2].[16] <- -90.
   путьВрага.[2].[2].[17] <- -72.
   путьВрага.[2].[2].[18] <- -54.
   путьВрага.[2].[2].[19] <- -36.
   путьВрага.[2].[2].[20] <- -18.
   путьВрага.[2].[2].[21] <- 0.
   путьВрага.[2].[3].[1] <- enemy_speed
   путьВрага.[2].[3].[2] <- 0.95*enemy_speed
   путьВрага.[2].[3].[3] <- 0.81*enemy_speed
   путьВрага.[2].[3].[4] <- 0.59*enemy_speed
   путьВрага.[2].[3].[5] <- 0.31*enemy_speed
   путьВрага.[2].[3].[6] <- 0.
   путьВрага.[2].[3].[7] <- -0.31*enemy_speed
   путьВрага.[2].[3].[8] <- -0.59*enemy_speed
   путьВрага.[2].[3].[9] <- -0.81*enemy_speed
   путьВрага.[2].[3].[10] <- -0.95*enemy_speed
   путьВрага.[2].[3].[11] <- -enemy_speed
   путьВрага.[2].[3].[12] <- -0.95*enemy_speed
   путьВрага.[2].[3].[13] <- -0.81*enemy_speed
   путьВрага.[2].[3].[14] <- -0.59*enemy_speed
   путьВрага.[2].[3].[15] <- -0.31*enemy_speed
   путьВрага.[2].[3].[16] <- 0.
   путьВрага.[2].[3].[17] <- 0.31*enemy_speed
   путьВрага.[2].[3].[18] <- 0.59*enemy_speed
   путьВрага.[2].[3].[19] <- 0.81*enemy_speed
   путьВрага.[2].[3].[20] <- 0.95*enemy_speed
   путьВрага.[2].[3].[21] <- enemy_speed
   путьВрага.[2].[4].[1] <- 0.
   путьВрага.[2].[4].[2] <- 0.31*enemy_speed
   путьВрага.[2].[4].[3] <- 0.59*enemy_speed
   путьВрага.[2].[4].[4] <- 0.81*enemy_speed
   путьВрага.[2].[4].[5] <- 0.95*enemy_speed
   путьВрага.[2].[4].[6] <- enemy_speed
   путьВрага.[2].[4].[7] <- 0.95*enemy_speed
   путьВрага.[2].[4].[8] <- 0.81*enemy_speed
   путьВрага.[2].[4].[9] <- 0.59*enemy_speed
   путьВрага.[2].[4].[10] <- 0.31*enemy_speed
   путьВрага.[2].[4].[11] <- 0.
   путьВрага.[2].[4].[12] <- -0.31*enemy_speed
   путьВрага.[2].[4].[13] <- -0.59*enemy_speed
   путьВрага.[2].[4].[14] <- -0.81*enemy_speed
   путьВрага.[2].[4].[15] <- -0.95*enemy_speed
   путьВрага.[2].[4].[16] <- -enemy_speed
   путьВрага.[2].[4].[17] <- -0.95*enemy_speed
   путьВрага.[2].[4].[18] <- -0.81*enemy_speed
   путьВрага.[2].[4].[19] <- -0.59*enemy_speed
   путьВрага.[2].[4].[20] <- -0.31*enemy_speed
   путьВрага.[2].[4].[21] <- 0.
   // round r=20
   путьВрага.[3].[0].[0] <- 21.
   путьВрага.[3].[1].[1] <- 120.
   путьВрага.[3].[1].[2] <- 140.
   путьВрага.[3].[1].[3] <- 160.
   путьВрага.[3].[1].[4] <- 180.
   путьВрага.[3].[1].[5] <- 200.
   путьВрага.[3].[1].[6] <- 220.
   путьВрага.[3].[1].[7] <- 240.
   путьВрага.[3].[1].[8] <- 260.
   путьВрага.[3].[1].[9] <- 280.
   путьВрага.[3].[1].[10] <- 300.
   путьВрага.[3].[1].[11] <- 320.
   путьВрага.[3].[1].[12] <- 340.
   путьВрага.[3].[1].[13] <- 360.
   путьВрага.[3].[1].[14] <- 380.
   путьВрага.[3].[1].[15] <- 400.
   путьВрага.[3].[1].[16] <- 420.
   путьВрага.[3].[1].[17] <- 440.
   путьВрага.[3].[1].[18] <- 460.
   путьВрага.[3].[1].[19] <- 480.
   путьВрага.[3].[1].[20] <- 500.
   путьВрага.[3].[1].[21] <- 600.
   путьВрага.[3].[2].[1] <- 0.
   путьВрага.[3].[2].[2] <- 18.
   путьВрага.[3].[2].[3] <- 36.
   путьВрага.[3].[2].[4] <- 54.
   путьВрага.[3].[2].[5] <- 72.
   путьВрага.[3].[2].[6] <- 90.
   путьВрага.[3].[2].[7] <- 108.
   путьВрага.[3].[2].[8] <- 126.
   путьВрага.[3].[2].[9] <- 144.
   путьВрага.[3].[2].[10] <- 162.
   путьВрага.[3].[2].[11] <- 180.
   путьВрага.[3].[2].[12] <- 198.
   путьВрага.[3].[2].[13] <- 216.
   путьВрага.[3].[2].[14] <- 234.
   путьВрага.[3].[2].[15] <- 252.
   путьВрага.[3].[2].[16] <- -90.
   путьВрага.[3].[2].[17] <- -72.
   путьВрага.[3].[2].[18] <- -54.
   путьВрага.[3].[2].[19] <- -36.
   путьВрага.[3].[2].[20] <- -18.
   путьВрага.[3].[2].[21] <- 0.
   путьВрага.[3].[3].[1] <- enemy_speed
   путьВрага.[3].[3].[2] <- 0.95*enemy_speed
   путьВрага.[3].[3].[3] <- 0.81*enemy_speed
   путьВрага.[3].[3].[4] <- 0.59*enemy_speed
   путьВрага.[3].[3].[5] <- 0.31*enemy_speed
   путьВрага.[3].[3].[6] <- 0.
   путьВрага.[3].[3].[7] <- -0.31*enemy_speed
   путьВрага.[3].[3].[8] <- -0.59*enemy_speed
   путьВрага.[3].[3].[9] <- -0.81*enemy_speed
   путьВрага.[3].[3].[10] <- -0.95*enemy_speed
   путьВрага.[3].[3].[11] <- -enemy_speed
   путьВрага.[3].[3].[12] <- -0.95*enemy_speed
   путьВрага.[3].[3].[13] <- -0.81*enemy_speed
   путьВрага.[3].[3].[14] <- -0.59*enemy_speed
   путьВрага.[3].[3].[15] <- -0.31*enemy_speed
   путьВрага.[3].[3].[16] <- 0.
   путьВрага.[3].[3].[17] <- 0.31*enemy_speed
   путьВрага.[3].[3].[18] <- 0.59*enemy_speed
   путьВрага.[3].[3].[19] <- 0.81*enemy_speed
   путьВрага.[3].[3].[20] <- 0.95*enemy_speed
   путьВрага.[3].[3].[21] <- enemy_speed
   путьВрага.[3].[4].[1] <- 0.
   путьВрага.[3].[4].[2] <- 0.31*enemy_speed
   путьВрага.[3].[4].[3] <- 0.59*enemy_speed
   путьВрага.[3].[4].[4] <- 0.81*enemy_speed
   путьВрага.[3].[4].[5] <- 0.95*enemy_speed
   путьВрага.[3].[4].[6] <- enemy_speed
   путьВрага.[3].[4].[7] <- 0.95*enemy_speed
   путьВрага.[3].[4].[8] <- 0.81*enemy_speed
   путьВрага.[3].[4].[9] <- 0.59*enemy_speed
   путьВрага.[3].[4].[10] <- 0.31*enemy_speed
   путьВрага.[3].[4].[11] <- 0.
   путьВрага.[3].[4].[12] <- -0.31*enemy_speed
   путьВрага.[3].[4].[13] <- -0.59*enemy_speed
   путьВрага.[3].[4].[14] <- -0.81*enemy_speed
   путьВрага.[3].[4].[15] <- -0.95*enemy_speed
   путьВрага.[3].[4].[16] <- -enemy_speed
   путьВрага.[3].[4].[17] <- -0.95*enemy_speed
   путьВрага.[3].[4].[18] <- -0.81*enemy_speed
   путьВрага.[3].[4].[19] <- -0.59*enemy_speed
   путьВрага.[3].[4].[20] <- -0.31*enemy_speed
   путьВрага.[3].[4].[21] <- 0.

   // round r=10
   путьВрага.[4].[0].[0] <- 21.
   путьВрага.[4].[1].[1] <- 110.
   путьВрага.[4].[1].[2] <- 120.
   путьВрага.[4].[1].[3] <- 130.
   путьВрага.[4].[1].[4] <- 140.
   путьВрага.[4].[1].[5] <- 150.
   путьВрага.[4].[1].[6] <- 160.
   путьВрага.[4].[1].[7] <- 170.
   путьВрага.[4].[1].[8] <- 180.
   путьВрага.[4].[1].[9] <- 190.
   путьВрага.[4].[1].[10] <- 200.
   путьВрага.[4].[1].[11] <- 210.
   путьВрага.[4].[1].[12] <- 220.
   путьВрага.[4].[1].[13] <- 230.
   путьВрага.[4].[1].[14] <- 240.
   путьВрага.[4].[1].[15] <- 250.
   путьВрага.[4].[1].[16] <- 260.
   путьВрага.[4].[1].[17] <- 270.
   путьВрага.[4].[1].[18] <- 280.
   путьВрага.[4].[1].[19] <- 290.
   путьВрага.[4].[1].[20] <- 300.
   путьВрага.[4].[1].[21] <- 500.
   путьВрага.[4].[2].[1] <- 0.
   путьВрага.[4].[2].[2] <- 18.
   путьВрага.[4].[2].[3] <- 36.
   путьВрага.[4].[2].[4] <- 54.
   путьВрага.[4].[2].[5] <- 72.
   путьВрага.[4].[2].[6] <- 90.
   путьВрага.[4].[2].[7] <- 108.
   путьВрага.[4].[2].[8] <- 126.
   путьВрага.[4].[2].[9] <- 144.
   путьВрага.[4].[2].[10] <- 162.
   путьВрага.[4].[2].[11] <- 180.
   путьВрага.[4].[2].[12] <- 198.
   путьВрага.[4].[2].[13] <- 216.
   путьВрага.[4].[2].[14] <- 234.
   путьВрага.[4].[2].[15] <- 252.
   путьВрага.[4].[2].[16] <- -90.
   путьВрага.[4].[2].[17] <- -72.
   путьВрага.[4].[2].[18] <- -54.
   путьВрага.[4].[2].[19] <- -36.
   путьВрага.[4].[2].[20] <- -18.
   путьВрага.[4].[2].[21] <- 0.
   путьВрага.[4].[3].[1] <- enemy_speed
   путьВрага.[4].[3].[2] <- 0.95*enemy_speed
   путьВрага.[4].[3].[3] <- 0.81*enemy_speed
   путьВрага.[4].[3].[4] <- 0.59*enemy_speed
   путьВрага.[4].[3].[5] <- 0.31*enemy_speed
   путьВрага.[4].[3].[6] <- 0.
   путьВрага.[4].[3].[7] <- -0.31*enemy_speed
   путьВрага.[4].[3].[8] <- -0.59*enemy_speed
   путьВрага.[4].[3].[9] <- -0.81*enemy_speed
   путьВрага.[4].[3].[10] <- -0.95*enemy_speed
   путьВрага.[4].[3].[11] <- -enemy_speed
   путьВрага.[4].[3].[12] <- -0.95*enemy_speed
   путьВрага.[4].[3].[13] <- -0.81*enemy_speed
   путьВрага.[4].[3].[14] <- -0.59*enemy_speed
   путьВрага.[4].[3].[15] <- -0.31*enemy_speed
   путьВрага.[4].[3].[16] <- 0.
   путьВрага.[4].[3].[17] <- 0.31*enemy_speed
   путьВрага.[4].[3].[18] <- 0.59*enemy_speed
   путьВрага.[4].[3].[19] <- 0.81*enemy_speed
   путьВрага.[4].[3].[20] <- 0.95*enemy_speed
   путьВрага.[4].[3].[21] <- enemy_speed
   путьВрага.[4].[4].[1] <- 0.
   путьВрага.[4].[4].[2] <- 0.31*enemy_speed
   путьВрага.[4].[4].[3] <- 0.59*enemy_speed
   путьВрага.[4].[4].[4] <- 0.81*enemy_speed
   путьВрага.[4].[4].[5] <- 0.95*enemy_speed
   путьВрага.[4].[4].[6] <- enemy_speed
   путьВрага.[4].[4].[7] <- 0.95*enemy_speed
   путьВрага.[4].[4].[8] <- 0.81*enemy_speed
   путьВрага.[4].[4].[9] <- 0.59*enemy_speed
   путьВрага.[4].[4].[10] <- 0.31*enemy_speed
   путьВрага.[4].[4].[11] <- 0.
   путьВрага.[4].[4].[12] <- -0.31*enemy_speed
   путьВрага.[4].[4].[13] <- -0.59*enemy_speed
   путьВрага.[4].[4].[14] <- -0.81*enemy_speed
   путьВрага.[4].[4].[15] <- -0.95*enemy_speed
   путьВрага.[4].[4].[16] <- -enemy_speed
   путьВрага.[4].[4].[17] <- -0.95*enemy_speed
   путьВрага.[4].[4].[18] <- -0.81*enemy_speed
   путьВрага.[4].[4].[19] <- -0.59*enemy_speed
   путьВрага.[4].[4].[20] <- -0.31*enemy_speed
   путьВрага.[4].[4].[21] <- 0.

   // round r=15 + exit down
   путьВрага.[5].[0].[0] <- 27.
   путьВрага.[5].[1].[1] <- 120.
   путьВрага.[5].[1].[2] <- 125.
   путьВрага.[5].[1].[3] <- 150.
   путьВрага.[5].[1].[4] <- 165.
   путьВрага.[5].[1].[5] <- 180.
   путьВрага.[5].[1].[6] <- 195.
   путьВрага.[5].[1].[7] <- 210.
   путьВрага.[5].[1].[8] <- 225.
   путьВрага.[5].[1].[9] <- 240.
   путьВрага.[5].[1].[10] <- 255.
   путьВрага.[5].[1].[11] <- 270.
   путьВрага.[5].[1].[12] <- 285.
   путьВрага.[5].[1].[13] <- 300.
   путьВрага.[5].[1].[14] <- 315.
   путьВрага.[5].[1].[15] <- 330.
   путьВрага.[5].[1].[16] <- 345.
   путьВрага.[5].[1].[17] <- 360.
   путьВрага.[5].[1].[18] <- 375.
   путьВрага.[5].[1].[19] <- 390.
   путьВрага.[5].[1].[20] <- 405.
   путьВрага.[5].[1].[21] <- 600.
   путьВрага.[5].[1].[22] <- 615.
   путьВрага.[5].[1].[23] <- 630.
   путьВрага.[5].[1].[24] <- 645.
   путьВрага.[5].[1].[25] <- 660.
   путьВрага.[5].[1].[26] <- 675.
   путьВрага.[5].[1].[27] <- 800.

   путьВрага.[5].[2].[1] <- 0.
   путьВрага.[5].[2].[2] <- 18.
   путьВрага.[5].[2].[3] <- 36.
   путьВрага.[5].[2].[4] <- 54.
   путьВрага.[5].[2].[5] <- 72.
   путьВрага.[5].[2].[6] <- 90.
   путьВрага.[5].[2].[7] <- 108.
   путьВрага.[5].[2].[8] <- 126.
   путьВрага.[5].[2].[9] <- 144.
   путьВрага.[5].[2].[10] <- 162.
   путьВрага.[5].[2].[11] <- 180.
   путьВрага.[5].[2].[12] <- 198.
   путьВрага.[5].[2].[13] <- 216.
   путьВрага.[5].[2].[14] <- 234.
   путьВрага.[5].[2].[15] <- 252.
   путьВрага.[5].[2].[16] <- -90.
   путьВрага.[5].[2].[17] <- -72.
   путьВрага.[5].[2].[18] <- -54.
   путьВрага.[5].[2].[19] <- -36.
   путьВрага.[5].[2].[20] <- -18.
   путьВрага.[5].[2].[21] <- 0.

   путьВрага.[5].[2].[22] <- 18.
   путьВрага.[5].[2].[23] <- 36.
   путьВрага.[5].[2].[24] <- 54.
   путьВрага.[5].[2].[25] <- 72.
   путьВрага.[5].[2].[26] <- 90.
   путьВрага.[5].[2].[27] <- 90.


   путьВрага.[5].[3].[1] <- enemy_speed
   путьВрага.[5].[3].[2] <- 0.95*enemy_speed
   путьВрага.[5].[3].[3] <- 0.81*enemy_speed
   путьВрага.[5].[3].[4] <- 0.59*enemy_speed
   путьВрага.[5].[3].[5] <- 0.31*enemy_speed
   путьВрага.[5].[3].[6] <- 0.
   путьВрага.[5].[3].[7] <- -0.31*enemy_speed
   путьВрага.[5].[3].[8] <- -0.59*enemy_speed
   путьВрага.[5].[3].[9] <- -0.81*enemy_speed
   путьВрага.[5].[3].[10] <- -0.95*enemy_speed
   путьВрага.[5].[3].[11] <- -enemy_speed
   путьВрага.[5].[3].[12] <- -0.95*enemy_speed
   путьВрага.[5].[3].[13] <- -0.81*enemy_speed
   путьВрага.[5].[3].[14] <- -0.59*enemy_speed
   путьВрага.[5].[3].[15] <- -0.31*enemy_speed
   путьВрага.[5].[3].[16] <- 0.
   путьВрага.[5].[3].[17] <- 0.31*enemy_speed
   путьВрага.[5].[3].[18] <- 0.59*enemy_speed
   путьВрага.[5].[3].[19] <- 0.81*enemy_speed
   путьВрага.[5].[3].[20] <- 0.95*enemy_speed
   путьВрага.[5].[3].[21] <- enemy_speed
   путьВрага.[5].[3].[22] <- 0.95*enemy_speed
   путьВрага.[5].[3].[23] <- 0.81*enemy_speed
   путьВрага.[5].[3].[24] <- 0.59*enemy_speed
   путьВрага.[5].[3].[25] <- 0.31*enemy_speed
   путьВрага.[5].[3].[26] <- 0.
   путьВрага.[5].[3].[27] <- 0.

   путьВрага.[5].[4].[1] <- 0.
   путьВрага.[5].[4].[2] <- 0.31*enemy_speed
   путьВрага.[5].[4].[3] <- 0.59*enemy_speed
   путьВрага.[5].[4].[4] <- 0.81*enemy_speed
   путьВрага.[5].[4].[5] <- 0.95*enemy_speed
   путьВрага.[5].[4].[6] <- enemy_speed
   путьВрага.[5].[4].[7] <- 0.95*enemy_speed
   путьВрага.[5].[4].[8] <- 0.81*enemy_speed
   путьВрага.[5].[4].[9] <- 0.59*enemy_speed
   путьВрага.[5].[4].[10] <- 0.31*enemy_speed
   путьВрага.[5].[4].[11] <- 0.
   путьВрага.[5].[4].[12] <- -0.31*enemy_speed
   путьВрага.[5].[4].[13] <- -0.59*enemy_speed
   путьВрага.[5].[4].[14] <- -0.81*enemy_speed
   путьВрага.[5].[4].[15] <- -0.95*enemy_speed
   путьВрага.[5].[4].[16] <- -enemy_speed
   путьВрага.[5].[4].[17] <- -0.95*enemy_speed
   путьВрага.[5].[4].[18] <- -0.81*enemy_speed
   путьВрага.[5].[4].[19] <- -0.59*enemy_speed
   путьВрага.[5].[4].[20] <- -0.31*enemy_speed
   путьВрага.[5].[4].[21] <- 0.
   путьВрага.[5].[4].[22] <- 0.31*enemy_speed
   путьВрага.[5].[4].[23] <- 0.59*enemy_speed
   путьВрага.[5].[4].[24] <- 0.81*enemy_speed
   путьВрага.[5].[4].[25] <- 0.95*enemy_speed
   путьВрага.[5].[4].[26] <- enemy_speed
   путьВрага.[5].[4].[27] <- enemy_speed

   путьВрага.[6].[0].[0] <- 3.
   путьВрага.[6].[1].[1] <- 1.
   путьВрага.[6].[1].[2] <- 80.
   путьВрага.[6].[1].[3] <- 200.
   путьВрага.[6].[2].[1] <- 0.
   путьВрага.[6].[2].[2] <- 90.
   путьВрага.[6].[2].[3] <- -90.
   путьВрага.[6].[3].[1] <- 0.
   путьВрага.[6].[3].[2] <- 0.
   путьВрага.[6].[3].[3] <- 0.
   путьВрага.[6].[4].[1] <- 0.
   путьВрага.[6].[4].[2] <- enemy_speed
   путьВрага.[6].[4].[3] <- -enemy_speed


and создать_уровень1 () =  // this define the behavior of the différent squadron along the time play for level 1
   уровень1.[1] <- Словарь()
   уровень1.[1].[1] <- 20    // when timeplay=level1[1][1]
   уровень1.[1].[2] <- 2    // lauch enemy with Path level1[1][2]
   уровень1.[1].[3] <- -10  // at x coordinate level1[1][3]
   уровень1.[1].[4] <- 0   // at y coordinate level1[1][4]
   уровень1.[1].[5] <- 1   // 1 for create enemy at the left side; 2 for the right side of screen
   уровень1.[1].[6] <- 4   // level[1][6] is the number of enemies
   уровень1.[1].[7] <- 1   // type of enemy
   уровень1.[2] <- Словарь()
   уровень1.[2].[1] <- 80
   уровень1.[2].[2] <- 6
   уровень1.[2].[3] <- ширинаИгры/2
   уровень1.[2].[4] <- -500
   уровень1.[2].[5] <- 1
   уровень1.[2].[6] <- 3
   уровень1.[2].[7] <- 1
   уровень1.[3] <- Словарь()
   уровень1.[3].[1] <- 150
   уровень1.[3].[2] <- 0
   уровень1.[3].[3] <- -10
   уровень1.[3].[4] <- 0
   уровень1.[3].[5] <- 1
   уровень1.[3].[6] <- 6
   уровень1.[3].[7] <- 2
   уровень1.[4] <- Словарь()
   уровень1.[4].[1] <- 280
   уровень1.[4].[2] <- 4
   уровень1.[4].[3] <- -10
   уровень1.[4].[4] <- 0
   уровень1.[4].[5] <- 1
   уровень1.[4].[6] <- 3
   уровень1.[4].[7] <- 2
   уровень1.[5] <- Словарь()
   уровень1.[5].[1] <- 410
   уровень1.[5].[2] <- 6
   уровень1.[5].[3] <- ширинаИгры/3
   уровень1.[5].[4] <- -50
   уровень1.[5].[5] <- 1
   уровень1.[5].[6] <- 3
   уровень1.[5].[7] <- 1
   уровень1.[6] <- Словарь()
   уровень1.[6].[1] <- 430
   уровень1.[6].[2] <- 6
   уровень1.[6].[3] <- 2*ширинаИгры/3
   уровень1.[6].[4] <- -50
   уровень1.[6].[5] <- 2
   уровень1.[6].[6] <- 3
   уровень1.[6].[7] <- 1

   уровень1.[5].[1] <- 500
   уровень1.[5].[2] <- 6
   уровень1.[5].[3] <- ширинаИгры/3
   уровень1.[5].[4] <- -50
   уровень1.[5].[5] <- 1
   уровень1.[5].[6] <- 6
   уровень1.[5].[7] <- 2

   уровень1.[6].[1] <- 590
   уровень1.[6].[2] <- 5
   уровень1.[6].[3] <- 100
   уровень1.[6].[4] <- -80
   уровень1.[6].[5] <- 1
   уровень1.[6].[6] <- 3
   уровень1.[6].[7] <- 3
  
   уровень1.[7] <- Словарь()
   уровень1.[7].[1] <- 690
   уровень1.[7].[2] <- 6
   уровень1.[7].[3] <- ширинаИгры/3
   уровень1.[7].[4] <- -50
   уровень1.[7].[5] <- 2
   уровень1.[7].[6] <- 3
   уровень1.[7].[7] <- 2
   for i= 1 to 10 do
      уровень1.[7+i] <- Словарь()
      уровень1.[7+i].[1] <- 700+50*i
      уровень1.[7+i].[2] <- 6
      уровень1.[7+i].[3] <- Math.ВзятьСлучайноеЧисло(ширинаИгры)
      уровень1.[7+i].[4] <- -50 + i
      уровень1.[7+i].[5] <- Math.ВзятьСлучайноеЧисло(2)
      уровень1.[7+i].[6] <- Math.ВзятьСлучайноеЧисло(3)
      уровень1.[7+i].[7] <- Math.ВзятьСлучайноеЧисло(2)
   уровень1.[18] <- Словарь()
   уровень1.[18].[1] <- 1300
   уровень1.[18].[2] <- 1
   уровень1.[18].[3] <- ширинаИгры
   уровень1.[18].[4] <- -10
   уровень1.[18].[5] <- 2
   уровень1.[18].[6] <- 6
   уровень1.[18].[7] <- 2

   for i=1 to 10 do
      уровень1.[18+i] <- Словарь()
      уровень1.[18+i].[1] <- 1330+50*i
      уровень1.[18+i].[2] <- 4+Math.ВзятьСлучайноеЧисло(2)
      уровень1.[18+i].[3] <- Math.ВзятьСлучайноеЧисло(50)
      уровень1.[18+i].[4] <- i
      уровень1.[18+i].[5] <- 1
      уровень1.[18+i].[6] <- Math.ВзятьСлучайноеЧисло(3)
      уровень1.[18+i].[7] <- Math.ВзятьСлучайноеЧисло(2)

   for i= 1 to 10 do
      уровень1.[28+i] <- Словарь()
      уровень1.[28+i].[1] <- 1900+50*i
      уровень1.[28+i].[2] <- 4+Math.ВзятьСлучайноеЧисло(2)
      уровень1.[28+i].[3] <- -Math.ВзятьСлучайноеЧисло(50)
      уровень1.[28+i].[4] <- i
      уровень1.[28+i].[5] <- 1
      уровень1.[28+i].[6] <- Math.ВзятьСлучайноеЧисло(3)
      уровень1.[28+i].[7] <- Math.ВзятьСлучайноеЧисло(2)

   for i= 1 to 10 do
     уровень1.[38+i] <- Словарь()
     уровень1.[38+i].[1] <- 2450+100*i
     уровень1.[38+i].[2] <- 6
     уровень1.[38+i].[3] <- Math.ВзятьСлучайноеЧисло(ширинаИгры)
     уровень1.[38+i].[4] <- -50 + i
     уровень1.[38+i].[5] <- Math.ВзятьСлучайноеЧисло(2)
     уровень1.[38+i].[6] <- Math.ВзятьСлучайноеЧисло(5)
     уровень1.[38+i].[7] <- Math.ВзятьСлучайноеЧисло(2)

//Presentation
// todo

// Начать игру
Инициализация()
определить_пути()
//создать_врагов1()
Игра()
printfn "ИГРА ОКОНЧЕНА"