простір Бібліотека

відкрити System
відкрити Avalonia.Media.Imaging
відкрити Avalonia.Media

[<Sealed>]
тип ГрафичнеВікно приватний () =   
   статичний нехай рнд = Random()
   статичний нехай змінливий фоновийКолір = Кольори.White
   статичний нехай змінливий ширина = 640
   статичний нехай змінливий висота = 480
   статичний нехай перо () = Перо(ГрафичнеВікно.КолірПера,ГрафичнеВікно.ШиринаПера)
   статичний нехай пензлик () = ГрафичнеВікно.КолірПензлика
   статичний нехай шрифт () = 
      Шрифт.Шрифт(ГрафичнеВікно.РозмірШрифта,ГрафичнеВікно.ІмяШрифта,ГрафичнеВікно.ЖирністьШрифта, ГрафичнеВікно.КурсивністьШрифта)
   статичний нехай намалювати малюнок = додатиМалюнок малюнок      
   статичний нехай намалюватиУ (x,y) малюнок = додатиМалюнокУ малюнок (x,y)
   статичний член Заголовок
      із set заголовок =
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Вікно.Title <- заголовок)
   статичний член КолірФона
      із get () = фоновийКолір
      та set цвет = 
         фоновийКолір <- цвет
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.Background <- новий Avalonia.Media.SolidColorBrush(доКольораАвалонії цвет))
   статичний член Ширина
      із get () = ширина
      та set новаШирина =
         ширина <- новаШирина
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.ВстановитиШиринуВікна(float новаШирина))
   статичний член Висота
      із get () = висота
      та set новаВысота =
         висота <- новаВысота
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.ВстановитиВисотуВікна(float новаВысота))
   статичний член МожнаЗмінитиРозмір
      із get () = істина
      та set (значення:bool) = ()
   статичний член знач КолірПера = Кольори.Black із get, set
   статичний член знач ШиринаПера = 2.0 із get, set
   статичний член знач КолірПензлика = Кольори.Purple із get,set
   статичний член знач РозмірШрифта = 12.0 із get,set
   статичний член знач ІмяШрифта = "" із get,set
   статичний член знач ЖирністьШрифта = ложь із get,set
   статичний член знач КурсивністьШрифта = ложь із get,set
   статичний член Очистити () =
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ОчиститиМалюнки())
   статичний член НамалюватиЛінію(x1,y1,x2,y2) =
      НамалюватиЛінію(Лінія(x1,y1,x2,y2),перо()) |> намалювати
   статичний член НамалюватиЛінію(x1:int,y1:int,x2:int,y2:int) =
      ГрафичнеВікно.НамалюватиЛінію(float x1, float y1, float x2, float y2)
   статичний член НамалюватиПрямокутник(x,y,width,height) =
      НамалюватиПрямокутник(Прямокутник(width,height),перо()) |> намалюватиУ (x,y)
   статичний член НамалюватиПрямокутник(x:int,y:int,width:int,height:int) =
      ГрафичнеВікно.НамалюватиПрямокутник(float x, float y, float width, float height)
   статичний член НамалюватиТрикутник(x1,y1,x2,y2,x3,y3) =
      НамалюватиТрикутник(Трикутник(x1,y1,x2,y2,x3,y3),перо()) |> намалювати
   статичний член НамалюватиЕліпс(x,y,width,height) =
      НамалюватиЕлліпс(Елліпс(width,height),перо()) |> намалюватиУ (x,y)
   статичний член НамалюватиЕліпс(x:int,y:int,width:int,height:int) =
      ГрафичнеВікно.НамалюватиЕліпс(float x, float y, float width, float height)
   статичний член НамалюватиЗображення(імяЗображення,x,y) =
      нехай посиланняЗображення =
         відповідає СписокЗображень.СпробуватиОтриматиБайтиЗображення імяЗображення із
         | Some байти -> 
            вживати потокПамяти = новий System.IO.MemoryStream(байти)
            ref (новий Bitmap(потокПамяти) :> Avalonia.Media.IImage)           
         | None ->
            якщо імяЗображення.StartsWith("http:") || імяЗображення.StartsWith("https:") 
            тоді
                нехай посиланняЗображення = ref нуль
                async {
                   нехай! зображення = Хттп.ЗавантажитиЗображенняАсінх імяЗображення
                   посиланняЗображення := зображення
                   Моя.Апплікація.Викликати(фун () -> Моя.Апплікація.Полотно.ЗробитиНедійсним())
                } |> Async.Start
                посиланняЗображення
            інакше
                ref (новий Bitmap(Reflection.Assembly.GetEntryAssembly().GetManifestResourceStream(імяЗображення)) :> IImage)
      НамалюватиЗображення(посиланняЗображення,x,y) |> намалювати
   статичний член НамалюватиЗображення(імяЗображення,x:int,y:int) =
      ГрафичнеВікно.НамалюватиЗображення(імяЗображення, float x, float y)
   статичний член НамалюватиТекст(x,y,текст) =
      НамалюватиТекст(x,y,текст,шрифт(),пензлик()) |> намалювати
   статичний член НамалюватиТекст(x:int,y:int,текст) =
      ГрафичнеВікно.НамалюватиТекст(float x,float y,текст)
   статичний член НамалюйтеОбмеженийТекст(x,y,ширина,текст) =
      НамалюватиТекстУРамці(x,y,ширина,текст,шрифт(),пензлик()) |> намалювати
   статичний член ЗаповнитиПрямокутник(x,y,ширина,высота) =
      ЗаповнитиПрямокутник(Прямокутник(ширина,высота),пензлик()) |> намалюватиУ (x,y)
   статичний член ЗаповнитиПрямокутник(x:int,y:int,ширина:int,высота:int) =
      ГрафичнеВікно.ЗаповнитиПрямокутник(float x,float y,float ширина,float высота)
   статичний член ЗаповнитиТрикутник(x1,y1,x2,y2,x3,y3) =
      ЗаповнитиТрикутник(Трикутник(x1,y1,x2,y2,x3,y3),пензлик()) |> намалювати
   статичний член ЗаповнитиЕліпс(x,y,ширина,высота) =
      ЗаповнитиЕліпс(Елліпс(ширина,высота),пензлик()) |> намалюватиУ (x,y)
   статичний член ЗаповнитиЕліпс(x:int,y:int,ширина:int,высота:int) =
      ЗаповнитиЕліпс(Елліпс(float ширина,float высота),пензлик()) |> намалюватиУ (float x,float y)
   статичний член ОстанняКнопка із get() = Моя.Апплікація.ОстанняКнопка
   статичний член КлавішаДогори із set callback = Моя.Апплікація.KeyUp <- callback
   статичний член КлавішаНатиснута із set callback = Моя.Апплікація.KeyDown <- callback 
   статичний член МишаX із get() = Моя.Апплікація.МишаX
   статичний член МишаY із get() = Моя.Апплікація.МишаY
   статичний член МишаДонизу із set callback = Моя.Апплікація.MouseDown <- callback
   статичний член МышьДогори із set callback = Моя.Апплікація.MouseUp <- callback
   статичний член МишаПереміщена із set callback = Моя.Апплікація.MouseMove <- callback
   статичний член ОтриматиКолірЗRGB(r,g,b) = Колір(255uy,byte r,byte g,byte b)
   статичний член ОтриматиВипадковийКолір() : Колір =
      нехай байты = [|1uy..3uy|]
      рнд.NextBytes(байты)
      Колір(255uy,байты.[0],байты.[1],байты.[2])
   статичний член Показати() = Моя.Апплікація.Показати()
   статичний член Сховати() = Моя.Апплікація.Сховати()
   статичний член ПоказатиПовідомлення(текст:string,заголовок) = 
      Моя.Апплікація.Викликати(фун () -> Моя.Апплікація.ПоказатьСообщение(текст,заголовок))