простір Бібліотека

[<Sealed>]
тип Миша приватний () =
   статичний член ЛіваКнопкаНатиснута = Моя.Апплікація.ЛіваКнопкаНатиснута
   статичний член ПраваКнопкаНатиснута = Моя.Апплікація.ПраваКнопкаНатиснута
   статичний член X = Моя.Апплікація.МишаX
   статичний член Y = Моя.Апплікація.МишаY
   статичний член СховатиКурсор () =
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.Cursor <- нуль)
   статичний член ПоказатиКурсор () =
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.Cursor <- Avalonia.Input.Cursor.Default)