простір Бібліотека

відкрити System

[<Sealed>]
тип СписокЗображень приватний () =
   статичний нехай зображення = Словник<string,byte[]>()
   статичний член ЗавантажитиЗображення(шлях:string) =
      нехай імя = "СписокЗображень" + Guid.NewGuid().ToString()
      нехай байти =
         якщо шлях.StartsWith("http:") || шлях.StartsWith("https:") 
         тоді Хттп.ЗавантажитиБайти шлях
         інакше Ресурс.ЗавантажитиБайти шлях
      зображення.Add(імя, байти)
      імя
   статичний член внутрішній СпробуватиОтриматиБайтиЗображення(імя:string) =
      відповідає зображення.TryGetValue(імя) із
      | істина, байты -> Some(байты)
      | ложь, _ -> None



