простір Бібліотека

тип Колір = 
   struct
      val A:byte
      val R:byte
      val G:byte
      val B:byte
   end
   new (a,r,g,b) = { A=a; R=r; G=g; B=b }

[<AutoOpen>]
module внутрішній ПеретворювачКольорів =
   нехай доКольораАвалонії (color:Колір) = Avalonia.Media.Color.FromArgb(color.A, color.R, color.G, color.B)

тип внутрішній Ширина = float
тип внутрішній Висота = float
тип внутрішній Розмір = float
тип внутрішній Родина = string
тип внутрішній Жирний = bool
тип внутрішній Курсив = bool
тип внутрішній X = float
тип внутрішній Y = float

тип внутрішній Перо = Перо з Колір * Ширина
тип внутрішній Шрифт = Шрифт з Розмір * Родина * Жирний * Курсив
тип внутрішній Лінія = Лінія з X * Y * X * Y
тип внутрішній Прямокутник = Прямокутник з Ширина * Висота
тип внутрішній Трикутник = Трикутник з X * Y * X * Y * X * Y
тип внутрішній Елліпс = Елліпс з Ширина * Висота

тип внутрішній Фігура =
   | ФігураЛінії з Лінія * Перо   
   | ФігураПрямокутника з Прямокутник * Перо * Колір
   | ФігураТрикутника з Трикутник * Перо * Колір
   | ФігураЕлліпса з Елліпс * Перо * Колір
   | ФігураЗображения з Avalonia.Media.IImage ref
   | ФігураТекста з string ref * Шрифт * Колір

тип внутрішній Малювання =
   | НамалюватиЛінію з Лінія * Перо
   | НамалюватиПрямокутник з Прямокутник * Перо
   | НамалюватиТрикутник з Трикутник * Перо
   | НамалюватиЕлліпс з Елліпс * Перо
   | НамалюватиЗображення з Avalonia.Media.IImage ref * float * float
   | НамалюватиТекст з float * float * string * Шрифт * Колір
   | НамалюватиТекстУРамці з float * float * float * string * Шрифт * Колір
   | ЗаповнитиПрямокутник з Прямокутник * Колір
   | ЗаповнитиТрикутник з Трикутник * Колір
   | ЗаповнитиЕліпс з Елліпс * Колір
   | НамалюватиФігуру з string * Фігура

