простір Бібліотека

тип Колір = 
   структ
      знач A:байт
      знач R:байт
      знач G:байт
      знач B:байт
   кінець
   новий (a,r,g,b) = { A=a; R=r; G=g; B=b }

[<AutoOpen>]
модуль внутрішній ПеретворювачКольорів =
   нехай доКольораАвалонії (color:Колір) = Avalonia.Media.Color.FromArgb(color.A, color.R, color.G, color.B)

тип внутрішній Ширина = плаваюча
тип внутрішній Висота = плаваюча
тип внутрішній Розмір = плаваюча
тип внутрішній Родина = строка
тип внутрішній Жирний = логічний
тип внутрішній Курсив = логічний
тип внутрішній X = плаваюча
тип внутрішній Y = плаваюча

тип внутрішній Перо = Перо з Колір * Ширина
тип внутрішній Шрифт = Шрифт з Розмір * Родина * Жирний * Курсив
тип внутрішній Лінія = Лінія з X * Y * X * Y
тип внутрішній Прямокутник = Прямокутник з Ширина * Висота
тип внутрішній Трикутник = Трикутник з X * Y * X * Y * X * Y
тип внутрішній Елліпс = Елліпс з Ширина * Висота

тип внутрішній Фігура =
   | ФігураЛінії з Лінія * Перо   
   | ФігураПрямокутника з Прямокутник * Перо * Колір
   | ФігураТрикутника з Трикутник * Перо * Колір
   | ФігураЕлліпса з Елліпс * Перо * Колір
   | ФігураЗображения з Avalonia.Media.IImage ссил
   | ФігураТекста з строка ссил * Шрифт * Колір

тип внутрішній Малювання =
   | НамалюватиЛінію з Лінія * Перо
   | НамалюватиПрямокутник з Прямокутник * Перо
   | НамалюватиТрикутник з Трикутник * Перо
   | НамалюватиЕлліпс з Елліпс * Перо
   | НамалюватиЗображення з Avalonia.Media.IImage ссил * плаваюча * плаваюча
   | НамалюватиТекст з плаваюча * плаваюча * строка * Шрифт * Колір
   | НамалюватиТекстУРамці з плаваюча * плаваюча * плаваюча * строка * Шрифт * Колір
   | ЗаповнитиПрямокутник з Прямокутник * Колір
   | ЗаповнитиТрикутник з Трикутник * Колір
   | ЗаповнитиЕліпс з Елліпс * Колір
   | НамалюватиФігуру з строка * Фігура

