простір Бібліотека

відкрити Avalonia
відкрити System

тип внутрішній ІнфоФигури = { Фігура:Фігура; змінливий Зсув:Point; змінливий Непрозорість:float }

[<Sealed>]
тип Фігури приватний () =
   статичний нехай перо () = Перо(ГрафичнеВікно.КолірПера,ГрафичнеВікно.ШиринаПера)
   статичний нехай пензлик () = ГрафичнеВікно.КолірПензлика
   статичний нехай шрифт () = 
      Шрифт(ГрафичнеВікно.РозмірШрифта,ГрафичнеВікно.ІмяШрифта,ГрафичнеВікно.ЖирністьШрифта, ГрафичнеВікно.КурсивністьШрифта)
   статичний нехай фігури = Словник<string,ІнфоФигури>()
   статичний нехай додатиФігуру назва фігура =
      нехай инфо = { Фігура=фігура; Зсув=Point(); Непрозорість=1.0 }
      фігури.Add(назва,инфо)      
      додатиМалюнок (НамалюватиФігуру(назва,фігура))
   статичний нехай наМалюнок назваФігури дія =
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, інфо -> дія інфо
      | ложь, _ -> ()
   статичний нехай згенНазву назва = назва + Guid.NewGuid().ToString()
   статичний член Видалити(назваФігури) =
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВидалитиФігуру(назваФігури))
   статичний член ДодатиЛінію(x1,y1,x2,y2) =
      нехай назва = згенНазву "Линия"
      ФігураЛінії(Лінія(x1,y1,x2,y2),перо()) |> додатиФігуру назва
      назва
   статичний член ДодатиЛінію(x1:int,y1:int,x2:int,y2:int) =
      Фігури.ДодатиЛінію(float x1, float y1, float x2, float y2)
   статичний член ДодатиПрямокутник(ширина,высота) =
      нехай назва = згенНазву "Прямоугольник"
      ФігураПрямокутника(Прямокутник(ширина,высота),перо(),пензлик()) |> додатиФігуру назва
      назва
   статичний член ДодатиПрямокутник(ширина:int,висота:int) =
      Фігури.ДодатиПрямокутник(float ширина, float висота)
   статичний член ДодатиТрикутник(x1,y1,x2,y2,x3,y3) =
      нехай назва = згенНазву "Треугольник"
      ФігураТрикутника(Трикутник(x1,y1,x2,y2,x3,y3),перо(),пензлик()) |> додатиФігуру назва
      назва
   статичний член ДобавитьЭллипс(ширина,висота) =
      нехай назва = згенНазву "Эллипс"
      ФігураЕлліпса(Елліпс(ширина,висота),перо(),пензлик()) |> додатиФігуру назва
      назва
   статичний член ДодатиЭллипс(ширина:int,висота:int) =
      Фігури.ДобавитьЭллипс(float ширина,float висота)
   статичний член ДодатиЗображення(назваЗображення) =
      нехай назва = згенНазву "Изображение"
      відповідає СписокЗображень.СпробуватиОтриматиБайтиЗображення(назваЗображення) із
      | Some байти ->
         нехай струм = новий System.IO.MemoryStream(байти)
         нехай зображення = новий Avalonia.Media.Imaging.Bitmap(струм) :> Avalonia.Media.IImage
         ФігураЗображения(ссил зображення) |> додатиФігуру назва
      | None ->
         нехай зображенняПосил = 
            якщо назваЗображення.StartsWith("http:") || назваЗображення.StartsWith("https:") 
            тоді
               нехай зображенняПосил = ссил нуль
               асинх {
                  нехай! зображення = Хттп.ЗавантажитиЗображенняАсінх назваЗображення
                  зображенняПосил := зображення
                  Моя.Апплікація.Викликати(фун () -> Моя.Апплікація.Полотно.ЗробитиНедійсним())
               } |> Асинх.Запустити
               зображенняПосил
            інакше             
               нехай зображенняПосил = ссил нуль                 
               Моя.Апплікація.Викликати(фун () ->
                  вживати струм = Ресурс.ОтриматиСтрум(назваЗображення)
                  зображенняПосил := новий Avalonia.Media.Imaging.Bitmap(струм) :> Avalonia.Media.IImage
               )
               зображенняПосил
         ФігураЗображения(зображенняПосил) |> додатиФігуру назва
      назва
   статичний член ДодатиТекст(текст) =
      нехай назва = згенНазву "Text"
      ФігураТекста(ссил текст, шрифт(), пензлик()) |> додатиФігуру назва
      назва
   статичний член СкрытьФигуру(назваФігури) =      
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВстановитиВидимістьФігури(назваФігури,ложь))      
   статичний член ПоказатьФигуру(назваФігури) =
      Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВстановитиВидимістьФігури(назваФігури,істина))      
   статичний член Перемістити(назваФігури,x,y) =
      наМалюнок назваФігури (фун инфо ->
         инфо.Зсув <- Point(x,y)
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ПереміститиФигуру(назваФігури,инфо.Зсув))
      )
   статичний член Перемістити(назваФігури,x:int,y:int) =
      Фігури.Перемістити(назваФігури, float x, float y)
   статичний член ОтриматиЛіво(назваФігури) =      
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, info -> info.Зсув.X
      | ложь, _ -> 0.0
   статичний член ОтриматиВерх(назваФігури) =
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, info -> info.Зсув.Y
      | ложь, _ -> 0.0
   статичний член ВстановитиНепрозорість(назваФігури, непрозорість) =
      наМалюнок назваФігури (фун info ->
         info.Непрозорість <- непрозорість
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВстановитиНепрозорістьФігури(назваФігури,непрозорість))
      )
   статичний член ВстановитиНепрозорість(назваФігури, непрозорість:int) =
      Фігури.ВстановитиНепрозорість(назваФігури, float непрозорість)
   статичний член ОтриматиНепрозорість(назваФігури) =
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, info -> info.Непрозорість
      | ложь, _ -> 1.0
   статичний член Повернути(назваФігури, кут) =
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, info ->
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВстановитиОбертанняФігури(назваФігури,кут))
      | ложь, _ -> ()
   статичний член Повернути(назваФігури, кут:int) =
      Фігури.Повернути(назваФігури, float кут)
   статичний член Збільшити(назваФігури, масштабX, масштабY) =
      відповідає фігури.TryGetValue(назваФігури) із
      | істина, інфо ->
         Моя.Апплікація.Викликати (фун () -> Моя.Апплікація.Полотно.ВстановитиМасштабФігури(назваФігури,масштабX,масштабY))
      | ложь, _ -> ()
   статичний член УстановитьТекст(назваФігури, текст) =
      наМалюнок назваФігури (фун інфо ->
         відповідає інфо.Фігура із
         | ФігураТекста(текстРеф, шрифт, кулір) ->
            Моя.Апплікація.Викликати (фун () -> текстРеф := текст; Моя.Апплікація.Полотно.ЗробитиНедійсним())
         | _ -> invalidOp "Expecting text shape"
      )       
   статичний член Анімувати(назваФігури,x:float,y:float,мс:int) =
      Фігури.Перемістити(назваФігури, x, y)
   статичний член Анімувати(назваФігури,x:int,y:int,мс:int) =
      Фігури.Анімувати(назваФігури, float x, float y, мс)

