namespace Бібліотека

open Avalonia
open System

type internal ІнфоФигури = { Фігура:Фігура; mutable Зсув:Point; mutable Непрозорість:float }

[<Sealed>]
type Фігури private () =
   static let перо () = Перо(ГрафичнеВікно.КолірПера,ГрафичнеВікно.ШиринаПера)
   static let пензлик () = ГрафичнеВікно.КолірПензлика
   static let шрифт () = 
      Шрифт(ГрафичнеВікно.РозмірШрифта,ГрафичнеВікно.ІмяШрифта,ГрафичнеВікно.ЖирністьШрифта, ГрафичнеВікно.КурсивністьШрифта)
   static let фігури = Словник<string,ІнфоФигури>()
   static let додатиФігуру назва фігура =
      let инфо = { Фігура=фігура; Зсув=Point(); Непрозорість=1.0 }
      фігури.Add(назва,инфо)      
      додатиМалюнок (НамалюватиФігуру(назва,фігура))
   static let наМалюнок назваФігури дія =
      match фігури.TryGetValue(назваФігури) with
      | true, інфо -> дія інфо
      | false, _ -> ()
   static let згенНазву назва = назва + Guid.NewGuid().ToString()
   static member Видалити(назваФігури) =
      Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВидалитиФігуру(назваФігури))
   static member ДодатиЛінію(x1,y1,x2,y2) =
      let назва = згенНазву "Линия"
      ФігураЛінії(Лінія(x1,y1,x2,y2),перо()) |> додатиФігуру назва
      назва
   static member ДодатиЛінію(x1:int,y1:int,x2:int,y2:int) =
      Фігури.ДодатиЛінію(float x1, float y1, float x2, float y2)
   static member ДодатиПрямокутник(ширина,высота) =
      let назва = згенНазву "Прямоугольник"
      ФігураПрямокутника(Прямокутник(ширина,высота),перо(),пензлик()) |> додатиФігуру назва
      назва
   static member ДодатиПрямокутник(ширина:int,висота:int) =
      Фігури.ДодатиПрямокутник(float ширина, float висота)
   static member ДодатиТрикутник(x1,y1,x2,y2,x3,y3) =
      let назва = згенНазву "Треугольник"
      ФігураТрикутника(Трикутник(x1,y1,x2,y2,x3,y3),перо(),пензлик()) |> додатиФігуру назва
      назва
   static member ДобавитьЭллипс(ширина,висота) =
      let назва = згенНазву "Эллипс"
      ФігураЕлліпса(Елліпс(ширина,висота),перо(),пензлик()) |> додатиФігуру назва
      назва
   static member ДодатиЭллипс(ширина:int,висота:int) =
      Фігури.ДобавитьЭллипс(float ширина,float висота)
   static member ДодатиЗображення(назваЗображення) =
      let назва = згенНазву "Изображение"
      match СписокЗображень.СпробуватиОтриматиБайтиЗображення(назваЗображення) with
      | Some байти ->
         let струм = new System.IO.MemoryStream(байти)
         let зображення = new Avalonia.Media.Imaging.Bitmap(струм) :> Avalonia.Media.IImage
         ФігураЗображения(ref зображення) |> додатиФігуру назва
      | None ->
         let зображенняПосил = 
            if назваЗображення.StartsWith("http:") || назваЗображення.StartsWith("https:") 
            then
               let зображенняПосил = ref null
               async {
                  let! зображення = Хттп.ЗавантажитиЗображенняАсінх назваЗображення
                  зображенняПосил := зображення
                  Моя.Апплікація.Викликати(fun () -> Моя.Апплікація.Полотно.ЗробитиНедійсним())
               } |> Async.Start
               зображенняПосил
            else             
               let зображенняПосил = ref null                 
               Моя.Апплікація.Викликати(fun () ->
                  use струм = Ресурс.ОтриматиСтрум(назваЗображення)
                  зображенняПосил := new Avalonia.Media.Imaging.Bitmap(струм) :> Avalonia.Media.IImage
               )
               зображенняПосил
         ФігураЗображения(зображенняПосил) |> додатиФігуру назва
      назва
   static member ДодатиТекст(текст) =
      let назва = згенНазву "Text"
      ФігураТекста(ref текст, шрифт(), пензлик()) |> додатиФігуру назва
      назва
   static member СкрытьФигуру(назваФігури) =      
      Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВстановитиВидимістьФігури(назваФігури,false))      
   static member ПоказатьФигуру(назваФігури) =
      Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВстановитиВидимістьФігури(назваФігури,true))      
   static member Перемістити(назваФігури,x,y) =
      наМалюнок назваФігури (fun инфо ->
         инфо.Зсув <- Point(x,y)
         Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ПереміститиФигуру(назваФігури,инфо.Зсув))
      )
   static member Перемістити(назваФігури,x:int,y:int) =
      Фігури.Перемістити(назваФігури, float x, float y)
   static member ОтриматиЛіво(назваФігури) =      
      match фігури.TryGetValue(назваФігури) with
      | true, info -> info.Зсув.X
      | false, _ -> 0.0
   static member ОтриматиВерх(назваФігури) =
      match фігури.TryGetValue(назваФігури) with
      | true, info -> info.Зсув.Y
      | false, _ -> 0.0
   static member ВстановитиНепрозорість(назваФігури, непрозорість) =
      наМалюнок назваФігури (fun info ->
         info.Непрозорість <- непрозорість
         Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВстановитиНепрозорістьФігури(назваФігури,непрозорість))
      )
   static member ВстановитиНепрозорість(назваФігури, непрозорість:int) =
      Фігури.ВстановитиНепрозорість(назваФігури, float непрозорість)
   static member ОтриматиНепрозорість(назваФігури) =
      match фігури.TryGetValue(назваФігури) with
      | true, info -> info.Непрозорість
      | false, _ -> 1.0
   static member Повернути(назваФігури, кут) =
      match фігури.TryGetValue(назваФігури) with
      | true, info ->
         Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВстановитиОбертанняФігури(назваФігури,кут))
      | false, _ -> ()
   static member Повернути(назваФігури, кут:int) =
      Фігури.Повернути(назваФігури, float кут)
   static member Збільшити(назваФігури, масштабX, масштабY) =
      match фігури.TryGetValue(назваФігури) with
      | true, інфо ->
         Моя.Апплікація.Викликати (fun () -> Моя.Апплікація.Полотно.ВстановитиМасштабФігури(назваФігури,масштабX,масштабY))
      | false, _ -> ()
   static member УстановитьТекст(назваФігури, текст) =
      наМалюнок назваФігури (fun інфо ->
         match інфо.Фігура with
         | ФігураТекста(текстРеф, шрифт, кулір) ->
            Моя.Апплікація.Викликати (fun () -> текстРеф := текст; Моя.Апплікація.Полотно.ЗробитиНедійсним())
         | _ -> invalidOp "Expecting text shape"
      )       
   static member Анімувати(назваФігури,x:float,y:float,мс:int) =
      Фігури.Перемістити(назваФігури, x, y)
   static member Анімувати(назваФігури,x:int,y:int,мс:int) =
      Фігури.Анімувати(назваФігури, float x, float y, мс)

