простір Бібліотека

відкрити System
відкрити Avalonia

[<Sealed>]
тип Черепаха private () =
   static нехай змінливий прихованоКористувачем = false
   static нехай змінливий швидкість = 0
   static нехай змінливий кут = 0.0
   static нехай змінливий _x = float ГрафичнеВікно.Ширина / 2.0
   static нехай змінливий _y = float ГрафичнеВікно.Висота / 2.0
   static нехай змінливий пероНажато = true
   static нехай показати () =
      якщо not прихованоКористувачем then
        Моя.Апплікація.Полотно.Черепаха.Видно <- true
        Моя.Апплікація.Полотно.ЗробитиНедійсним()
   static member Швидкість
      із get () = швидкість
      та set значення = 
         швидкість <- значення
         показати ()
   static member Кут
      із get () = кут
      та set значення = 
         кут <- значення
         Моя.Апплікація.Полотно.Черепаха.Обертання <- Some кут
         показати ()
   static member X
      із get () = _x
      та set значення = 
         _x <- значення
         показати ()
   static member Y
      із get () = _y
      та set значення = 
         _y <- значення
         показати ()
   static member Повернути(amount:float) =
      Черепаха.Кут <- кут + amount
   static member Повернути(amount:int) =
      Черепаха.Повернути(float amount)      
   static member ПовернутиНалево() =
      Черепаха.Повернути(-90.0)
   static member ПовернутиНаправо() =
      Черепаха.Повернути(90.0)
   static member Перемістити(відстань:float) =
      нехай r = (кут - 90.0) * Math.PI / 180.0
      нехай x' = _x + відстань * cos r
      нехай y' = _y + відстань * sin r
      якщо пероНажато then
         ГрафичнеВікно.НамалюватиЛінію(_x,_y,x',y')
      _x <- x'
      _y <- y'
      Моя.Апплікація.Полотно.Черепаха.Зсув <- Point(_x,_y)
      показати ()
   static member Перемістити(distance:int) =
      Черепаха.Перемістити (float distance)
   static member ПереміститиВ(x:float,y:float) =
      _x <- x; _y <- y
      Моя.Апплікація.Полотно.Черепаха.Зсув <- Point(_x,_y)
      показати()
   static member ПереміститиВ(x:int, y:int) = 
      Черепаха.ПереміститиВ(float x, float y)
   static member ПіднятиПеро() =
      пероНажато <- false
      показати ()
   static member ОпуститиПеро() =
      пероНажато <- true
      показати ()
   static member Показати() =
      прихованоКористувачем <- false
      показати()
   static member Сховати() =
      прихованоКористувачем <- true
      Моя.Апплікація.Полотно.Черепаха.Видно <- false
