простір Бібліотека

відкрити System
відкрити Avalonia.Controls

[<Sealed>]
тип ЭлементиКерування приватний () =
   статичний нехай змінливий наКлік = Callback(ignore)
   статичний нехай змінливий останняНажатаКнопка = ""
   статичний нехай элементиКерування = Словник<string,Avalonia.Controls.Control>()
   статичний нехай позиції = Словник<string,int * int>()
   /// Додає кнопку до графичного вікна
   статичний член ДодатиКнопку(позначка:string, x:int, y:int) =
      Моя.Апплікація.ВикликатиЗРезультатом(фун () ->
         нехай назва = "Button" + Guid.NewGuid().ToString()
         нехай кнопка = новий Button(Content = позначка)
         кнопка.Click.Add(фун _ -> останняНажатаКнопка <- назва; наКлік.Invoke())
         элементиКерування.Add(назва,кнопка)
         позиції.Add(назва,(x,y))
         Моя.Апплікація.Полотно.ДодатиДітину(кнопка,float x,float y)
         назва
      )
   /// Добавляет текстовое поле ввода к графическому окну
   статичний член ДодатиТекстовеВікно(x,y) =
      Моя.Апплікація.ВикликатиЗРезультатом(фун () ->
          нехай назва = "ТекстовеВікно" + Guid.NewGuid().ToString()
          нехай элементКерування = новий Avalonia.Controls.TextBox()
          элементКерування.Text <- "Бу!"
          элементиКерування.Add(назва,элементКерування)
          позиції.Add(назва,(x,y))
          Моя.Апплікація.Полотно.ДодатиДітину(элементКерування,float x,float y)
          назва
      )
   /// Встановлює розмір элемента керування
   статичний член ВстановитиРозмір(назваЕлемента, ширина:int, висота:int) =
      нехай элементКерування = элементиКерування.[назваЕлемента]
      нехай x, y = позиції.[назваЕлемента]
      Моя.Апплікація.Викликати( фун () ->
         Моя.Апплікація.Полотно.ВидалитиДітину(элементКерування)        
         элементКерування.Width <- float ширина
         элементКерування.Height <- float висота
         элементКерування.MinWidth <- float ширина
         элементКерування.MinHeight <- float висота
         Моя.Апплікація.Полотно.ДодатиДітину(элементКерування,float x,float y)
      )
   /// Встановлює текст у вказанному текстовому полі
   статичний член ВстановитиТекстТекстовогоВікна(назваЕлемента, текст) = 
      нехай элементКерування = элементиКерування.[назваЕлемента] :?> TextBox
      Моя.Апплікація.Викликати( фун () ->
         элементКерування.Text <- текст
         элементКерування.Focus() |> ignore
      )
   /// Отримує поточний текст у вказанному текстовому полі
   статичний член ОтриматиТекстТекстовогоВікна(назваЕлемента) =
      нехай элементКерування = элементиКерування.[назваЕлемента] :?> TextBox
      элементКерування.Text
   статичний член КнопкаКликнута із set (зворотьнійВиклик:Callback) = наКлік <- зворотьнійВиклик
   статичний член ОстанняНажатаКнопка із get() = останняНажатаКнопка